Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: name of the mode, must be either <quote>SDI</quote>, <quote>MDI</quote> or <quote>TAB</quote>.
de: Name des Modus muss entweder <quote>SDI</quote>, <quote>MDI</quote> oder <quote>TAB</quote> sein.

source: Invert the <quote>enabled</quote> state of all tracks. This is the same as calling the command <quote><command>&no-i18n-cmd_select_track_toggle;</command>()</quote> for all existing tracks.
de: Invertiert den <quote>aktiviert</quote>-Zustand aller Spuren. Dies entspricht dem Aufrufen des Befehls <quote><command>&no-i18n-cmd_select_track_toggle;</command>()</quote> für jede existierende Spur.

source: Mark all tracks <quote>disabled</quote>. This is the same as calling the command <quote><command>&no-i18n-cmd_select_track_off;</command>()</quote> for all existing tracks.
de: Markiert alle Spuren als <quote>deaktiviert</quote>. Dies entspricht einem Aufruf von <quote><command>&no-i18n-cmd_select_track_off;</command>()</quote> für alle existierenden Spuren.

source: Disables a single track, so that it does not get affected by most operations.
de: Deaktiviert eine einzelne Spur, so dass sie nicht mehr von allen Operationen beeinflusst wird.

source: index of the track, starting with zero
de: Index der Spur, beginnend bei 0

source: Enables a single track, so that it gets affected by all operations.
de: Aktiviert eine einzelne Spur, so dass sich alle Operationen auf sie auswirken.

source: Enables a track if it is currently disabled, or disables it if it is currently enabled.
de: Aktiviert eine Spur wenn sie aktuell deaktiviert ist, oder deaktiviert sie falls sie gerade aktiviert ist.

source: Selects the range of the whole signal, from the first to the last sample.
de: Setzt den ausgewählten Bereich auf das komplette Signal, vom ersten bis zum letzten Sample.

source: Selects a range of samples that starts right after the current selection, using the same length as the current selection. The selection is automatically clipped to the end of the signal. For example: if you have selected samples 1000 ... 1019, then the result will be a selection from sample 1020 ... 1039.
de: Setzt die Auswahl auf den nächsten Bereich nach der aktuellen Auswahl, mit gleicher Länge wie die aktuelle Auswahl. Die Auswahl wird automatisch auf das Ende des Signals beschränkt. Beispiel: wenn Sie den Bereich von 1000 ... 1019 ausgewählt hatten, dann wird die resultierende Auswahl der Bereich von 1020 ... 1039 sein.

source: Selects a range of samples between the next two labels after the current selection. If nothing is selected, it selects from the start of the signal up to the first label. Otherwise the left border of the new selection will be the position of first label after the selection (or the last label if there are no more labels right from the selection), and the right border of the new selection will be the first label after the left border of the new selection (or the end of the signal if there is none). This command returns an error when there are no labels at all.
de: Wählt einen Bereich aus der zwischen den beiden Markern liegt die nach der aktuellen Auswahl liegen. Wenn nichts ausgewählt ist, wird der Bereich vom Anfang des Signals bis zum ersten Marker ausgewählt. Ansonsten wird der linke Rand der neuen Auswahl auf den Marker nach der aktuellen Auswahl (oder des letzten Markers falls nach der aktuellen Auswahl keine weiteren Marker liegen)und der rechte Rand der neuen Auswahl wird auf den Marker nach dem linken Rand der aktuellen Auswahl gesetzt (oder auf das Ende des Signals wenn dort kein Marker existiert). Dieser Befehl gibt einen Fehler zurück wenn kein einziger Marker vorhanden ist.

source: Resets the selection to zero length.
de: Setzt die Auswahl auf Länge Null.

source: Selects a range of samples that starts left from the current selection, using the same length as the current selection. The selection is automatically clipped to the start of the signal. For example: if you have selected samples 1000 ... 1019, then the result will be a selection from sample 980 ... 999.
de: Setzt die Auswahl auf den nächsten Bereich vor der aktuellen Auswahl, mit gleicher Länge wie die aktuelle Auswahl. Die Auswahl wird automatisch auf den Anfang des Signals beschränkt. Beispiel: wenn Sie den Bereich von 1000 ... 1019 ausgewählt hatten, dann wird die resultierende Auswahl der Bereich von 980 ... 999 sein.

source: Selects a range of samples between the previous two labels before the current selection. If nothing is selected, it selects from the start of the signal up to the first label. Otherwise the right border of the new selection will be the position of first label before the selection (or the first label if there are no more labels left from the selection), and the left border of the new selection will be the first label before the right border of the new selection (or the start of the signal if there is none). This command returns an error when there are no labels at all.
de: Wählt einen Bereich aus der zwischen den beiden Markern liegt die vor der aktuellen Auswahl liegen. Wenn nichts ausgewählt ist, wird der Bereich vom Anfang des Signals bis zum ersten Marker ausgewählt. Ansonsten wird der rechte Rand der neuen Auswahl auf den Marker vor der aktuellen Auswahl (oder des ersten Markers falls vor der aktuellen Auswahl keine weiteren Marker liegen)und der linke Rand der neuen Auswahl wird auf den Marker vor dem rechten Rand der aktuellen Auswahl gesetzt (oder auf den Start des Signals wenn dort kein Marker existiert). Dieser Befehl gibt einen Fehler zurück wenn kein einziger Marker vorhanden ist.

source: Sets the start of the selection to the start of the signal, the end of the current selection stays unchanged.
de: Setzt den Start der Auswahl auf den Start des Signals, das Ende der Auswahl bleibt unverändert.

source: Sets the end of the selection to the end of the signal, the start of the current selection stays unchanged.
de: Setzt das Ende der Auswahl auf das Ende des Signals, der Anfang der aktuellen Auswahl bleibt unverändert.

source: Selects the range of samples that is visible in the current window.
de: Setzt die Auswahl auf den im aktuellen Fenster angezeigten Bereich.

source: Corresponds to to the <guibutton>Start</guibutton> toolbar button and lets the playback start from the beginning of the selection or continue if it is currently paused.
de: Entspricht der Werkzeugleisten-Schaltfläche <guibutton>Start</guibutton> und lässt die Wiedergabe von Anfang an starten wenn sie angehalten ist oder weiterlaufen falls sie aktuell pausiert wurde.

source: Corresponds to to the <guibutton>Stop</guibutton> toolbar button and lets the playback stop if it is currently running.
de: Entspricht der Werkzeugleisten-Schaltfläche <guibutton>Stop</guibutton> und lässt die Wiedergabe anhalten wenn sie gerade läuft.

source: Corresponds to the <guibutton>Undo</guibutton> toolbar button and reverts the last operation.
de: Entspricht der Werkzeugleisten-Schaltfläche <guibutton>Rückgängig</guibutton> und macht die letzte Operation rückgängig.

source: Scrolls the current view to the <emphasis>end</emphasis> of the signal.
de: Verschiebt die aktuelle Ansicht an das <emphasis>Ende</emphasis> des Signals.

source: Scrolls the current view by 1/10 of the currently visible range towards the start of the signal. If the start of the signal is reached the visible area starts at offset zero.
de: Verschiebt die aktuelle Ansicht um 1/10 der Breite des aktuell sichtbaren Bereichs in Richtung Anfang des Signals. Wenn der Anfang des Signals erreicht wurde, beginnt die Ansicht mit dem Anfang des Signals.

source: Scrolls the current view towards the end of the signal by the currently visible range.
de: Verschiebt die aktuelle Ansicht in Richtung des Endes des Signals, um die Breite des aktuell sichtbaren Bereichs.

source: Scrolls right and tries to show the next label centered in the view. If there was no label right from the current position, it will scroll to the end of the signal.
de: Verschiebt die Ansicht nach rechts und versucht auf die Position des nächsten Markers zu zentrieren. Wenn rechts von der aktuellen Position kein Marker liegt, wird die Ansicht an das Ende des Signals verschoben.

source: Scrolls the current view towards the start of the signal by the currently visible range.
de: Verschiebt die aktuelle Ansicht in Richtung des Anfangs des Signals, um die Breite des aktuell sichtbaren Bereichs.

source: Scrolls left and tries to show the previous label centered in the view. If there was no label left from the current position, it will scroll to the start of the signal.
de: Verschiebt die Ansicht nach links und versucht auf die Position des vorhergehenden Markers zu zentrieren. Wenn links von der aktuellen Position kein Marker liegt, wird die Ansicht auf den Start des Signals verschoben.

source: Scrolls the current view by 1/10 of the currently visible range towards the end of the signal. If the end of the signal is reached the visible area ends at the end of the signal.
de: Verschiebt die aktuelle Ansicht um 1/10 der Breite des aktuell sichtbaren Bereichs in Richtung Ende des Signals. Wenn das Ende des Signals erreicht wurde, endet die Ansicht mit dem Ende des Signals.

source: Scrolls the current view to the start of the signal.
de: Verschiebt die aktuelle Ansicht an den Anfang des Signals.

source: Adjusts the zoom factor so that the complete signal is visible in the current view.
de: Passt den Vergrößerungsfaktor so an dass das Signal vollständig in der aktuellen Ansicht angezeigt wird.

source: Reduces the zoom factor (in samples per pixel) by 30%, so that more details get visible. If a <replaceable>position</replaceable> is given, it tries to show that position centered in the current view, otherwise the center of the view before the zoom change is used for centering. The minimum zoom factor is limited to a minimum of five samples per width of the view.
de: Reduziert den Vergrößerungsfaktor (in Samples pro Pixel) um 30%, so dass mehr Details sichtbar werden. Wenn eine <replaceable>Position</replaceable> angegeben wurde, wird versucht die Ansicht auf diese Position zu zentrieren, ansonsten wird die Mitte der Ansicht vor der Zoom-Änderung zum zentrieren verwendet.Der Vergrößerungsfaktor wird auf ein Minimum von fünf Samples pro Breite der Ansicht begrenzt.

source: a zero based position is samples to center the view (optional)
de: eine mit Null beginnende Position in Samples auf die die Ansicht zentriert werden soll (optional)

source: Sets the zoom factor to one pixel per sample (factor 1.0) and tries to keep the previous center of the view.
de: Setzt den Vergrößerungsfaktor auf ein Pixel pro Sample (Faktor 1,0) und versucht die aktuelle Zentrierung der Ansicht beizubehalten.

source: Increases the zoom factor (in samples per pixel) by 30%, so that less details get visible. If a <replaceable>position</replaceable> is given, it tries to show that position centered in the current view, otherwise the center of the view before the zoom change is used for centering. The maximum zoom factor is limited to the number of samples of the complete signal and the width of the view.
de: Erhöht den Vergrößerungsfaktor (in Samples pro Pixel) um 30%, so dass weniger Details sichtbar sind. Wenn eine <replaceable>Position</replaceable> angegeben wurde, wird versucht die Ansicht auf diese Position zu zentrieren, ansonsten wird die Mitte der Ansicht vor der Zoom-Änderung zum zentrieren verwendet. Der maximale Vergrößerungsfaktor wird durch die Anzahl der Samples des gesamten Signals und der Breite der Ansicht begrenzt.

source: Adjusts the view (zoom factor and start of visible area) so that it matches the current selection. This command does nothing if the selection is empty.
de: Passt die Ansicht Vergrößerungsfaktor und Start des sichtbaren Bereichs) so an dass sie der aktuellen Auswahl entspricht. Dieser Befehl bewirkt nichts wenn die Auswahl leer ist.

source: &i18n-cmd_syntax;<command>&no-i18n-cmd_window_activate;</command>(<replaceable>title</replaceable>])
de: &i18n-cmd_syntax;<command>&no-i18n-cmd_saveas;</command>([<replaceable>Überschrift</replaceable>])

source: Activates a sub window, identified by it's window <replaceable>title</replaceable>. If the sub window is minimized it will be restored. Only available if in MDI and tab mode. This command is internally used by the <quote><guisubmenu>Window</guisubmenu></quote> menu.
de: Aktiviert ein Unterfenster, das über seine <replaceable>Überschrift</replaceable> identifiziert wird. Wenn das Unterfenster minimiert ist wird es wiederhergestellt. Nur verfügbar wenn im MDI- oder Tab-Modus. Dieser Befehl wird intern vom <quote><guisubmenu>Fenster</guisubmenu></quote>-Menü verwendet.

source: <parameter>title</parameter>:
de: <parameter>Überschrift</parameter>:

source: the title of the sub window that should be activated
de: die Überschrift des Unterfensters das aktiviert werden soll

source: Cascades all sub windows when in MDI mode. All sub windows that are currently minimized stay minimized, they will not be restored.
de: Kaskadiert alle Unterfenster wenn im MDI-Modus. Alle Unterfenster die aktuell minimiert sind bleiben minimiert, sie werden nicht wiederhergestellt.

source: &i18n-cmd_syntax;<command>&no-i18n-cmd_window_resize;</command>( <replaceable>class</replaceable>, <replaceable>x</replaceable>, <replaceable>y</replaceable> )
de: &i18n-cmd_syntax;<command>&no-i18n-cmd_window_resize;</command>( <replaceable>Klasse</replaceable>, <replaceable>x</replaceable>, <replaceable>y</replaceable> )

source: Sends a mouse click event to window, identified by it's <replaceable>class</replaceable> name. The event will only be sent to the first window that has the given class name, therefore you should make sure that you have only one instance of the given window when this command gets executed.
de: Sendet einen Mausklick-Ereignis an ein Fenster das über seine <replaceable>Klasse</replaceable> identifiziert wird. Das Ereignis wird nur zu dem ersten Fenster gesendet das den angegebenen Klassen-Namen hat, deshalb sollten Sie sicher stellen dass nur eine einzige Instanz des angegebenen Fensters existiert wenn der Befehl ausgeführt wird.

source: <parameter>class</parameter>:
de: <parameter>Klasse</parameter>:

source: name of the window class
de: Name der Fensterklasse

source: x position, relative to the left border of the window (in pixels)
de: X-Position, relativ zum linken Rand des Fensters (in Pixel)

source: y position, relative to the top border of the window (in pixels)
de: Y-Position, relativ zur Oberkante des Fensters (in Pixel)

source: &i18n-cmd_syntax;<command>&no-i18n-cmd_window_close;</command>( <replaceable>class</replaceable> )
de: &i18n-cmd_syntax;<command>&no-i18n-cmd_window_close;</command>( <replaceable>Klasse</replaceable> )

source: Closes a window, identified by it's <replaceable>class</replaceable> name. Only the first window that has the given class name will be closed, therefore you should make sure that you have only one instance of the given window when this command gets executed.
de: Schließt ein Fenster, das über seine <replaceable>Klasse</replaceable> identifiziert wird. Nur das erste Fenster mit dem angegebenen Klassen-Namen wird geschlossen, deshalb sollten Sie sicher stellen dass nur eine einzige Instanz des angegebenen Fensters existiert wenn der Befehl ausgeführt wird.

source: Activates the <emphasis>next</emphasis> sub window when in MDI or tab mode. If the next sub window is minimized it will be restored.
de: Aktiviert das <emphasis>nächste</emphasis> Unterfenster wenn im MDI- oder Tab-Modus. Wenn des nächste Unterfenster minimiert war wird es wiederhergestellt.

source: Activates the <emphasis>previous</emphasis> sub window when in MDI or tab mode. If the previous sub window is minimized it will be restored.
de: Aktiviert das <emphasis>vorhergehende</emphasis> Unterfenster wenn im MDI- oder Tab-Modus. Wenn des vorhergehende Unterfenster minimiert war wird es wiederhergestellt.

source: &i18n-cmd_syntax;<command>&no-i18n-cmd_window_resize;</command>( <replaceable>class</replaceable>, <replaceable>width</replaceable>, <replaceable>height</replaceable> )
de: &i18n-cmd_syntax;<command>&no-i18n-cmd_window_resize;</command>( <replaceable>Klasse</replaceable>, <replaceable>Breite</replaceable>, <replaceable>Höhe</replaceable> )

source: Changes the size of a window, identified by it's <replaceable>class</replaceable> name to a new <replaceable>width</replaceable> and <replaceable>height</replaceable>. The change will only be applied to the first window that has the given class name, therefore you should make sure that you have only one instance of the given window when this command gets executed.
de: Ändert die Größe eines Fensters, das anhand seiner <replaceable>Klasse</replaceable> identifiziert wird auf eine neue <replaceable>Breite</replaceable> und <replaceable>Höhe</replaceable>. Die Änderung wirkt sich nur auf das erste Fenster mit dem angegebenen Klassen-Namen aus, deshalb sollten Sie sicher stellen dass nur eine einzige Instanz des angegebenen Fensters existiert wenn der Befehl ausgeführt wird.

source: <parameter>width</parameter>:
de: <parameter>Breite</parameter>:

source: new width of the window (in pixels)
de: neue Breite des Fensters (in Pixel)

source: <parameter>height</parameter>:
de: <parameter>Höhe</parameter>:

source: new height of the window (in pixels)
de: neue Höhe des Fensters (in Pixel)

source: &i18n-cmd_syntax;<command>&no-i18n-cmd_window_screenshot;</command>( <replaceable>class</replaceable>, <replaceable>filename</replaceable> )
de: &i18n-cmd_syntax;<command>&no-i18n-cmd_window_screenshot;</command>( <replaceable>Klasse</replaceable>, <replaceable>Dateiname</replaceable> )

source: Takes a screenshot of a window, identified by it's <replaceable>class</replaceable> and saves it to a file. The screenshot will be taken from the first window that has the given class name, therefore you should make sure that you have only one instance of the given window when this command gets executed. Currently the format of the file is hardcoded and has to be <literal>*.png</literal>.
de: Erstellt ein Bildschirmfoto eines Fensters, das über seine <replaceable>Klasse</replaceable> identifiziert wird und speichert es in einer Datei. Das Bildschirmfoto wird nur vom ersten Fenster erstellt das den angegebenen Klassen-Namen hat, deshalb sollten Sie sicher stellen dass nur eine einzige Instanz des angegebenen Fensters existiert wenn der Befehl ausgeführt wird.Das Dateiformat ist aktuell festgelegt und muss <literal>*.png</literal> sein.

source: name of the file to save the screenshot, must have the extension <literal>*.png</literal>
de: Dateiname unter dem das Bildschirmfoto gespeichert werden soll, muss die Erweiterung <literal>*.png</literal> haben

source: &i18n-cmd_syntax;<command>&no-i18n-cmd_window_sendkey;</command>( <replaceable>class</replaceable>, <replaceable>key code</replaceable> )
de: &i18n-cmd_syntax;<command>&no-i18n-cmd_window_sendkey;</command>( <replaceable>Klasse</replaceable>, <replaceable>Tastenkürzel</replaceable> )

source: Sends a key press and release event to a window, identified by it's <replaceable>class</replaceable> name. The key will only be sent to the first window that has the given class name, therefore you should make sure that you have only one instance of the given window when this command gets executed.
de: Sendet einen Tastendruck- und Loslassen-Ereignis an ein Fenster das über seine <replaceable>Klasse</replaceable> identifiziert wird. Die Ereignisse werden nur zu dem ersten Fenster gesendet das den angegebenen Klassen-Namen hat, deshalb sollten Sie sicher stellen dass nur eine einzige Instanz des angegebenen Fensters existiert wenn der Befehl ausgeführt wird.

source: <parameter>key code</parameter>:
de: <parameter>Tastenkürzel</parameter>:

source: the key code that should be sent, using the same syntax as used for setting up menus
de: Das zu sendende Tastenkürzel, gleiche Syntax wie beim Einrichten der Menüs

source: description of the parameter <link linkend="cmd_menu_param_hotkey"><parameter>hotkey</parameter></link> of the <command>&no-i18n-cmd_menu;</command> command.
de: Beschreibung des Parameters <link linkend="cmd_menu_param_hotkey"><parameter>Tastenkürzel</parameter></link> des Befehls <command>&no-i18n-cmd_menu;</command>.

source: Tiles all sub windows when in MDI mode, using some scheme of KDE. All sub windows that are currently minimized stay minimized, they will not be restored.
de: Kachelt alle Unterfenster wenn im MDI-Modus, auf eine von KDE vorgegebene Art und Weise. Alle aktuell minimierten Unterfenster bleiben minimiert, sie werden nicht wiederhergestellt.

source: Tiles all sub windows vertically when in MDI mode. All windows that are currently minimized stay minimized, they will not be restored.
de: Ordnet alle Unterfenster untereinander an wenn im MDI-Modus. Alle aktuell minimierten Unterfenster bleiben minimiert, sie werden nicht wiederhergestellt.

source: Plugin Reference
de: Plugin-Referenz

source: Amplify Free
de: Frei Verstärken

source: Screenshot
de: Bildschirmfoto

source: Screenshot of the Amplify Free Plugin
de: Bildschirmfoto des Frei Verstärken-Plugins

source: <emphasis role="bold">Internal&nbsp;Name</emphasis>:
de: <emphasis role="bold">Interner&nbsp;Name</emphasis>:

source: amplifyfree
de: Frei Verstärken

source: <emphasis role="bold">Plugin&nbsp;Type</emphasis>:
de: <emphasis role="bold">Plugin-Typ</emphasis>:

source: effect
de: Effekt

source: <emphasis role="bold">Description</emphasis>:
de: <emphasis>Kommentar</emphasis>:

source: Amplifies the current selection with a curve that consists of a set of coordinates and an interpolation method. The coordinates on the time axis as well as on the amplitude axis must be normed between 0.0 and 1.0.
de: Verstärkt die aktuelle Auswahl mit einer Kurve die aus einem Satz von Koordinaten und einer Interpolations-Methode besteht. Sowohl die Koordinaten auf der Zeitachse als auch auf der Amplituden-Achse müssen auf den Bereich zwischen 0,0 und 1,0 normiert sein.

source: <emphasis role="bold">Parameters</emphasis>:
de: <emphasis>Paramter</emphasis>:

source: Internal name, for undo/redo handling. Possible values are:
de: Interner Name, für die Behandlung von Rückgängig/Wiederherstellen. Mögliche Werte sind:

source: keyword
de: Schlüsselwort

source: description
de: Beschreibung

source: fade in, curve from 0.0/0.0 to 1.0/1.0
de: Einblenden, Kurve von 0,0/0,0 nach 1,0/1,0

source: fade out, curve from 0.0/1.0 to 1.0/0.0
de: Ausblenden, Kurve von 0,0/1,0 nach 1,0/0,0

source: fade intro, one second pause, then fade in
de: Intro-Einblenden, eine Sekunde Pause, dann Einblenden

source: fade outro, first fade out, then one second pause
de: Outro-Ausblenden, erst Ausblenden, dann eine Sekunde Pause

source: user defined curve
de: benutzerdefinierte Kurve

source: Interpolation type, possible values are:
de: Interpolations-Art, mögliche Werte sind:

source: Polynom, nth Degree
de: Polynom, n-ter Grad

source: Polynom, 3rd Degree
de: Polynom, dritter Grad

source: Polynom, 5th Degree
de: Polynom, 5ter Grad

source: Polynom, 7th Degree
de: Polynom, 7ter Grad

source: Sample and Hold
de: Sample + Hold

source: curve
de: Kurve

source: A comma separated list of pairs of coordinates, normed between 0.0 and 1.0, must be sorted by time axis (ascending), should start at time 0.0 and end with time 1.0.
de: Eine per Komma getrennte Liste von Koordinaten, normiert zwischen 0,0 und 1,0, müssen (aufsteigend) nach Zeitachse sortiert sein, beginnend mit der Zeit 0,0 und endend mit der Zeit 1,0.

source: Developer's Guide to &kwave;
cs: Vývojářův průvodce k programu &kwave;
de: Entwickler-Handbuch zu &kwave;
es: Guía del desarrolador de &kwave;
