Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: menu entry / keyboard shortcut: <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>Space</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Zoom to Selection</guimenuitem> </menuchoice>
cs: položka hlavní lišty/klávesová zkratka: <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>Mezerník</keycap></keycombo></shortcut> <guimenu>Pohled</guimenu><guimenuitem>Najet na výběr</guimenuitem> </menuchoice>
de: Menü-Eintrag / Tastenkürzel: <menuchoice> <shortcut><keycombo><keycap>Strg</keycap><keycap>Leertaste</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu><guimenuitem>Zoom auf Auswahl</guimenuitem> </menuchoice>
es: entrada de menú / atajo de teclado:<menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>Espacio</keycap></keycombo></shortcut> <guimenu>Vista</guimenu><guimenuitem>Zum a la selección</guimenuitem> </menuchoice>

source: zoom to selection button
cs: tlačítko Přiblížit výběr
de: Taste für Vergrösserung auf Auswahl
es: botón de zum a la selección

source: <emphasis>select predefined zoom:</emphasis> select a zoom factor from the zoom combo box in the toolbar.
cs: <emphasis>Vybrat předem stanovené zvětšení:</emphasis> vybere násobek zvětšení z okénka v nástrojové liště.
de: <emphasis>Vordefinierter Faktor:</emphasis> Verwendet einen Vergrösserung-Faktor aus der Auswahlbox in der Werkzeugleiste.
es: <emphasis>seleccionar factor de zum:</emphasis> seleccione factor de zum desde el cuadro combinado de la barra de herramientas.

source: Scrolling left and right
cs: Projíždění vlevo a vpravo
de: Ansicht nach links und rechts verschieben
es: Rebobinado y avance

source: <emphasis>scroll left:</emphasis> scrolls to the start of the signal by 1/3 of the current view.
cs: <emphasis>Projíždět vlevo:</emphasis> projíždí na začátek signálu podle 1/3 nynějšího pohledu.
de: <emphasis>Ansicht nach links verschieben:</emphasis> verschiebt die Ansicht um 1/3 des aktuell sichtbaren Bereichs nach links.
es: <emphasis>Rebobinado:</emphasis> rebobina por 1/3 de la vista actual.

source: menu entry / keyboard shortcut: <menuchoice> <shortcut><keycombo><keycap>cursor Left</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Scroll left</guimenuitem> </menuchoice>
cs: položka hlavní lišty/klávesová zkratka: <menuchoice> <shortcut><keycombo><keycap>šipka Vlevo</keycap></keycombo></shortcut> <guimenu>Pohled</guimenu><guimenuitem>Projíždět vlevo</guimenuitem> </menuchoice>
de: Menü-Eintrag / Tastenkürzel: <menuchoice> <shortcut><keycombo><keycap>Cursor Links</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu><guimenuitem>nach links verschieben</guimenuitem> </menuchoice>
es: entrada de menú / atajo de teclado:<menuchoice> <shortcut><keycombo><keycap>flecha izquierda</keycap></keycombo></shortcut> <guimenu>Vista</guimenu><guimenuitem>Rebobinar</guimenuitem> </menuchoice>

source: scroll left button
cs: tlačítko Projíždět doleva
de: Taste für Ansicht nach links
es: botón de rebobinar

source: <emphasis>scroll right:</emphasis> scrolls to the end of the signal by 1/3 of the current view.
cs: <emphasis>Projíždět vpravo:</emphasis> projíždí na konec signálu podle 1/3 nynějšího pohledu.
de: <emphasis>Ansicht nach rechts verschieben:</emphasis> verschiebt die Ansicht um 1/3 des aktuell sichtbaren Bereichs nach rechts.
es: <emphasis>Avanzar:</emphasis> avanza por 1/3 de la vista actual.

source: menu entry / keyboard shortcut: <menuchoice> <shortcut><keycombo><keycap>cursor right</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Scroll right</guimenuitem> </menuchoice>
cs: položka hlavní lišty/klávesová zkratka: <menuchoice> <shortcut><keycombo><keycap>šipka Vpravo</keycap></keycombo></shortcut> <guimenu>Pohled</guimenu><guimenuitem>Projíždět vpravo</guimenuitem> </menuchoice>
de: Menü-Eintrag / Tastenkürzel: <menuchoice> <shortcut><keycombo><keycap>Cursor Rechts</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu><guimenuitem>nach rechts verschieben</guimenuitem> </menuchoice>
es: entrada de menú / atajo de teclado: <menuchoice> <shortcut><keycombo><keycap>flecha derecha</keycap></keycombo></shortcut> <guimenu>Vista</guimenu><guimenuitem>Avanzar</guimenuitem> </menuchoice>

source: scroll right button
cs: tlačítko Projíždět doprava
de: Taste für nächste Seite
es: botón de avanzar

source: <emphasis>previous page:</emphasis> scrolls to the position right before the current view (left).
cs: <emphasis>Předchozí strana:</emphasis> projíždí na polohu právě před nynějším pohledem (vlevo)
de: <emphasis>vorherige Seite:</emphasis> verschiebt den sichtbaren Bereich zu einer Position direkt vor der aktuellen Ansicht (nach links).
es: <emphasis>Página anterior:</emphasis> se desplaza a la posición justo antes de la vista actual (izquierda)

source: menu entry / keyboard shortcut: <menuchoice> <shortcut><keycombo><keycap>Page up</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Previous Page</guimenuitem> </menuchoice>
cs: položka hlavní lišty/klávesová zkratka: <menuchoice> <shortcut><keycombo><keycap>Page up</keycap></keycombo></shortcut> <guimenu>Pohled</guimenu><guimenuitem>Předchozí strana</guimenuitem> </menuchoice>
de: Menüeintrag / Tastenkürzel: <menuchoice> <shortcut><keycombo><keycap>Bild auf</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu><guimenuitem>Vorherige Seite</guimenuitem> </menuchoice>
es: entrada de menú / atajo de teclado:<menuchoice> <shortcut><keycombo><keycap>RePág</keycap></keycombo></shortcut> <guimenu>Vista</guimenu><guimenuitem>Página anterior:</guimenuitem> </menuchoice>

source: previous page button
cs: tlačítko Předchozí strana
de: Taste für vorherige Seite
es: botón de página anterior

source: <emphasis>next page:</emphasis> scrolls to the position right after the current view (right).
cs: <emphasis>Další strana:</emphasis> projíždí na polohu právě po nynějším pohledu (vpravo)
de: <emphasis>Nächste Seite:</emphasis> verschiebt den sichtbaren Bereich auf eine Position direkt nach der aktuellen Ansicht (nach rechts).
es: <emphasis>Página siguiente:</emphasis> se desplaza a la posición justo después de la vista acutal (derecha).

source: menu entry / keyboard shortcut: <menuchoice> <shortcut><keycombo><keycap>Page down</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Next Page</guimenuitem> </menuchoice>
cs: položka hlavní lišty/klávesová zkratka: <menuchoice> <shortcut><keycombo><keycap>Page down</keycap></keycombo></shortcut> <guimenu>Pohled</guimenu><guimenuitem>Další strana</guimenuitem> </menuchoice>
de: Menüeintrag / Tastenkürzel: <menuchoice> <shortcut><keycombo><keycap>Bild ab</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu><guimenuitem>Nächste Seite</guimenuitem> </menuchoice>
es: entrada de menú / atajo de teclado: <menuchoice> <shortcut><keycombo><keycap>AvPág</keycap></keycombo></shortcut> <guimenu>Vista</guimenu><guimenuitem>Página siguiente</guimenuitem> </menuchoice>

source: next page button
cs: tlačítko Další strana
de: Taste für nächste Seite
es: botón de página siguiente

source: <emphasis>to begin:</emphasis> scrolls the current view so that it starts at the beginning of the signal.
cs: <emphasis>Na začátek:</emphasis> projíždí nynější pohled, tak aby začínal na začátku signálu.
de: <emphasis>zum Anfang:</emphasis> verschiebt den sichtbaren Bereich so dass er am Anfang des Signals beginnt.
es: <emphasis>Comienzo:</emphasis> desplaza la vista actual para que comience al inicio de la señal.

source: menu entry / keyboard shortcut: <menuchoice> <shortcut><keycombo><keycap>Pos1</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Begin</guimenuitem> </menuchoice>
cs: položka hlavní lišty/klávesová zkratka: <menuchoice> <shortcut><keycombo><keycap>Pos1</keycap></keycombo></shortcut> <guimenu>Pohled</guimenu><guimenuitem>Začátek</guimenuitem> </menuchoice>
de: Menüeintrag / Tastenkürzel: <menuchoice> <shortcut><keycombo><keycap>Pos1</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu><guimenuitem>Anfang</guimenuitem> </menuchoice>
es: entrada de menú / atajo de teclado: <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>Inicio</keycap></keycombo></shortcut> <guimenu>Vista</guimenu><guimenuitem>Comienzo</guimenuitem> </menuchoice>

source: <emphasis>to end:</emphasis> scrolls the current view so that it ends at the end of the signal.
cs: <emphasis>Na konec:</emphasis> projíždí nynější pohled, tak aby končil na konci signálu.
de: <emphasis>ans Ende:</emphasis> verschiebt die aktuelle Ansicht so dass sie beim Ende des Signals endet.
es: <emphasis>Final:</emphasis> desplaza la vista actual para que acabe al final de la señal.

source: menu entry / keyboard shortcut: <menuchoice> <shortcut><keycombo><keycap>End</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>End</guimenuitem> </menuchoice>
cs: položka hlavní lišty/klávesová zkratka: <menuchoice> <shortcut><keycombo><keycap>End</keycap></keycombo></shortcut> <guimenu>Pohled</guimenu><guimenuitem>Konec</guimenuitem> </menuchoice>
de: Menüeintrag / Tastenkürzel: <menuchoice> <shortcut><keycombo><keycap>Ende</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu><guimenuitem>Ende</guimenuitem> </menuchoice>
es: entrada de menú / atajo de teclado: <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>Fin</keycap></keycombo></shortcut> <guimenu>Vista</guimenu><guimenuitem>Final</guimenuitem> </menuchoice>

source: Using the overview
cs: Používání přehledu
de: Verwenden der Übersicht
es: Usando la vista de conjunto

source: The main screen of &kwave; shows a small <emphasis>overview</emphasis> of the whole signal above the horizontal scroll bar of the main window. This overview also provides some functionality for navigating:
cs: Hlavní obrazovka &kwave; ukazuje malý <emphasis>přehled</emphasis> celého signálu nad vodorovným projížděcím pruhem hlavního okna. Tento přehled také poskytuje určitý rozsah funkcí pro pohyb po dokumentu:
de: Das Hauptfenster von &kwave; enthält oberhalb des horizontalen Scrollbalkens eine kleine <emphasis>Übersicht</emphasis> über das gesamte Signal. Diese Übersicht stellt ebenfalls Funktionen zum Navigieren zur Verfügung:
es: La ventana principal de &kwave; muestra una pequeña <emphasis>vista de conjunto</emphasis> de toda la señal encima de la barra de desplazamiento horizontal. Esta vista de conjunto también proporciona cierta funcionalidad para la navegación:

source: <emphasis>single click with left mouse button</emphasis>: directly move the current view to the clicked position.
cs: <emphasis>Jednoduché klepnutí levým tlačítkem myši</emphasis>: přímo přesune nynější pohled na odklepnutou polohu.
de: <emphasis>einfacher Klick mit der linken Maustaste</emphasis>: verschiebt die aktuelle Ansicht direkt zur geklickten Position.
es: <emphasis>clic con el botón izquierdo del ratón</emphasis>: mueve directamente la vista actual a la posición cliqueada.

source: <emphasis>double click with left mouse button</emphasis>: directly move the current view to the clicked position and additionally zoom in.
cs: <emphasis>Dvojité klepnutí levým tlačítkem myši</emphasis>: přímo přesune nynější pohled na odklepnutou polohu a vedle toho pohled přiblíží.
de: <emphasis>Doppelklick mit der linken Maustaste</emphasis>: verschiebt die aktuelle Ansicht direkt zur geklickten Position und vergrössert zusätzlich.
es: <emphasis>doble clic con el botón izquierdo del ratón</emphasis>: mueve directamente la vista actual a la posición cliqueada y adicionalmente realiza un aumento.

source: <emphasis>double click with left mouse button, with <keycap>shift</keycap> pressed</emphasis>: directly move the current view to the clicked position and additionally zoom out.
cs: <emphasis>Dvojité klepnutí levým tlačítkem myši spojené se stisknutím <keycap>shift</keycap> klávesy</emphasis>: přímo přesune nynější pohled na odklepnutou polohu a vedle toho pohled oddálí.
de: <emphasis>Doppelklick mit der linken Maustaste mit gedrückter <keycap>Shift-Taste</keycap></emphasis>: verschiebt die aktuelle Ansicht direkt zur geklickten Position und verkleinert zusätzlich.
es: <emphasis>doble clic con el botón izquierdo con <keycap>mayúsculas</keycap> pulsada</emphasis>: mueve directamente la vista actual a la posición cliqueada y adicionalmente realiza un alejamiento.

source: Vertical zoom
cs: Svislý pohled
de: Vertikale Vergrösserung
es: Zum vertical

source: You can zoom the current view vertically by pressing the <keycap>Alt</keycap> key and scrolling with the mouse wheel.
cs: Současný pohled můžete přibližovat a oddalovat svisle stisknutím klávesy <keycap>Alt</keycap> a projížděním za pomoci kolečka myši.
de: Sie können die aktuelle Ansicht vertikal vergrössern und verkleinern indem Sie die <keycap>Alt</keycap>-Taste drücken während Sie mit dem Mausrad rollen.
es: Puede hacer zum vertical en la vista actual pulsando la tecla <keycap>Alt</keycap> y desplazando la rueda del ratón.

source: How to select
cs: Jak provádět výběr
de: Die Funktionsweise der Auswahl
es: Como seleccionar
fr: Comment faire une sélection

source: &kwave; allows you to select a continuous range of samples as well as any combination of channels (if you edit a multi-channel file). By selecting a range of samples (time scope) all following commands will be limited to that range and by de-selecting a channel it's content will not be changed.
cs: &kwave; vám umožňuje vybrat souvislou řadu vzorků, stejně tak jakékoli spojení kanálů (v případě, že upravujete vícekanálový soubor). Výběrem řady vzorků (časový rozsah) budou všechny následující příkazy omezeny na tuto řadu a zrušením výběru kanálu nebude jeho obsah změněn.
de: &kwave; erlaubt es Ihnen, einen kontinuierlichen Bereich von Samples wie auch jede Kombination von Spuren (wenn Sie eine Mehrspur-Datei bearbeiten) auszuwählen. Wenn Sie einen Sample-Bereich (Zeitrahmen) ausgewählt haben, werden alle folgenden Befehle darauf angewendet, wobei das Deselektieren einer Spur den Inhalt nicht verändert.
es: &kwave; le permite seleccionar un rango continuo de muestras además de cualquier combinación de canales (si edita un archivo multicanal). Mediante la selección de un rango de muestras (alcance temporal) los siguientes comandos estarán limitados a ese rango y mediante la anulación de la selección de un canal su contenido no cambiará.

source: Selecting channels
cs: Výběr vzorků
de: Auswahl von Samples
es: Seleccionar canales
fr: La sélection de canaux sonores

source: Selecting or de-selecting a channel is quite simple. Just click on the lamp symbol on the left side of the signal to toggle it's state:
cs: Výběr anebo naopak zrušení výběru kanálu je docela jednoduché. Jenom klepněte na symbol žárovky po levé straně signálu, abyste přepli její stav:
de: Das Auswählen oder das Deselektieren einer Spur ist recht einfach. Klicken Sie einfach auf das Lampensymbol auf der linken Seite des Signalfensters um seinen Status zu verändern:
es: Seleccionar o anular la selección de un canal es bastante simple. Simplemente cliquée en el símbolo circular que aparece en la parte izquierda del canal cuyo estado quiere cambiar:
fr: La sélection et la désélection d'un canal est très simple. Il suffit de cliquer sur le témoin lumineux placé à la gauche des pistes sonores. Les états du témoins sont les suivants :

source: green lamp
cs: zelená žárovka
de: grüne Lampe
es: círculo verde

source: a green lamp means "enabled", whereas
cs: zelená žárovka znamená "povoleno", zatímco
de: ein grünes Licht bedeutet "aktiviert", wohingegen
es: un círculo verde significa "activado", mientras que

source: red lamp
cs: červená žárovka
de: rote Lampe
es: círculo rojo

source: a red lamp means "disabled".
cs: červená žárovka znamená "vyřazeno z činnosti"
de: eine rote Lampe bedeutet "deaktiviert".
es: un círculo rojo signfica "desactivado".

source: Note: If a channel is de-selected it will also not be audible for playback!
cs: Poznámka: Pokud je výběr kanálu zrušen, nebude taktéž slyšet při přehrávání!
de: Hinweis: Wird eine Spur deselektiert, wird sie bei der Wiedergabe nicht hörbar sein!
es: Nota: Si un canal está desactivado no será audible durante la reproducción!
fr: Si le canal est désélectionné, il ne sera pas écoutable lors d'une lecture des pistes sonores !

source: Selecting samples
cs: Výběr vzorků
de: Auswahl von Samples
es: Seleccionar muestras
fr: La sélection d'échantillons

source: If you select a range of samples in &kwave;, that range will be <emphasis>inclusive</emphasis>. That means that the first and the last selected sample both belong to the selection and will be used for the following actions. So even if you not selected a <emphasis>range</emphasis> but only a single sample, the selection will never be really "empty". So for example if you see no selected range, the "delete" function applies to that single sample.
cs: Pokud vyberete řadu vzorků v &kwave;, bude tato řada <emphasis>vše zahrnující</emphasis>. Znamená to, že jak první tak poslední vybraný vzorek patří do tohoto výběru a bude jich použito pro následující kroky. Takže, i kdybyste nevybral určítý <emphasis>rozsah</emphasis>, ale pouze jeden vzorek, tento výběr nebude nikdy skutečně "prázdný". Takže, například, jestliže nevidíte žádný vybraný rozsah, funkce "smazání" bude použita na tento jeden vzorek.
de: Wenn Sei einen Sample-Bereich in &kwave; auswählen, wird dieser Bereich <emphasis>inclusive</emphasis> sein. Das heisst, dass das erste und das letzte ausgewählte Sample mit zur Auswahl gehören und benutzt werden für die folgenden Aktionen. Deshalb wird, selbst wenn Sie keinen <emphasis>Bereich</emphasis> sondern nur ein einzelnes Sample ausgewählt haben, die Auswahl niemals wirklich "leer" sein. So zum Beispiel wird, selbst wenn Sie keinen Bereich ausgewählt haben, die "Löschen" Funktion auf dieses einzelne Sample angewendet.
es: Si selecciona un rango de muestras en &kwave; ese rango será <emphasis>inclusivo</emphasis>. Esto significa que la primera y laúltima muestra seleccionadas pertenecen a la selección y serán usadas en las posteriores acciones. Asi que incluso aunque no seleccione un <emphasis>rango</emphasis>, excepto una sola muestra, la selección nunca estará realmente "vacía". Asi que por ejemplo, si no ve ningún rango seleccionado la función "eliminar" sólo se aplica a esa muestra en concreto.

source: The easiest way of selecting a range of samples is just to do that with mouse. It works like you are used from other applications: just press the left mouse button at the point you want to let the selection start and release the button where you want it to end.
cs: Nejsnadnějším způsobem, jak vybrat řadu vzorků, je prostě provést výběr myší. Pracuje to tak, jak jste zvyklý z jiných programů: jen stiskněte levé tlačítko myši nad bodem, který jste zvolili jako začátek výběru, a uvolněte stisk tlačítka tam, kde si přejete, aby výběr končil.
de: Der einfachste Weg einen Sample-Bereich auszuwählen ist einfach mit der Maus. Es funktioniert so, wie Sie es von anderen Anwendungen her bereits gewohnt sind: drücken Sie einfach die linke Maustaste auf den Punkt, beim dem die Auswahl beginnen soll und lassen die Maustaste am Endpunkt wieder los.
es: La manera más fácil de seleccionar un rango de muestras es haciendole con el ratón. Funciona como ya está acostumbrado en otras aplicaiones: simplemente pulse el botón izquierdo del raton en un punto que desée establecer como el inicio de la selección y suéltelo donde quiere terminar la selección.
fr: La méthode la plus simple pour sélectionner une plage d'échantillons sonores est d'utiliser la souris. Le principe est le même que pour n'importe qu'elle application graphique : il suffit d'appuyer avec le bouton gauche de la souris dans l'espace de travail pour indiquer le début de la sélection, et de déplacer la souris en maintenant appuyer le bouton gauche jusqu'à la fin de la sélection.

source: If you want to adjust or move the selection's start or end, you can move the mouse cursor near to the start or the end of the selection until it changes from the standard arrow cursor into the left-right arrow cursor and then press the left mouse button and adjust.
cs: Pokud chcete upravit či posunout začátek nebo konec výběru, můžete pohnout ukazatelem myši poblíž začátku nebo konce výběru, dokud se nezmění z obvyklého ukazatele se šipkou na ukazatel se šipkami na obě strany, a potom stiskněte levé tlačítko myši a proveďte úpravy.
de: Wenn Sie die Auswahl verschieben oder ihren Start- oder Endpunkt anpassen wollen, können Sie den Mauscursor an den Rand der Auswahl bewegen bis sich der Standard-Pfeil Cursor in einen Links-Rechts Pfeil Cursor geändert hat, um dann die linke Maustaste zu drücken und die Anpassung vorzunehmen.
es: Si quiere ajustar o mover el inicio o el final de la selección puede mover el cursor del ratón cerca del inicio o el final de la selección hasta que cambie de flecha estandar a doble flecha, luego pulse el botón izquierdo y realiceentonces el ajuste que desée.
fr: Si vous désirez ajuster ou déplacer le début ou la fin de la sélection, il suffit de positionner le curseur de la souris sur une des extrémités (le curseur doit changer de forme), d'appuyer sur le bouton gauche de la souris, de déplacer l'extrémité à l'emplacement voulu, puis de relâcher le bouton.

source: You can also extend or shrink the selection to a specific point by holding down the shift button while klicking with the left mouse button. Depending on which border is nearer, the left or right border of the selection will be set to a new position.
cs: Výběr můžete také rozšířit nebo zmenšit k určitému bodu podržením tlačítka shift, zatímco klepáte levým tlačítkem myši. Podle toho, která hranice výběru je blíže, bude stanovena nová poloha buď levého nebo pravého okraje výběru.
de: Sie können ebenso die Auswahl auf einen bestimmten Punkt erweitern oder verkürzen indem Sie die Shift-Taste gedrückt halten und mit der linken Maustaste klicken. Abhängig davon welcher Rand näher ist, wird der linke oder rechte Rand der Auswahl neu gesetzt.
es: También puede extender o contraer la selección a un punto específico manteniendo la tecla mayúsculas mientras cliquea con el botón derecho del ratón. Dependiendo de que borde esté más cerca, el borde izquierdo o derecho de la selección será fijado en la nueva posición.
fr: Vous pouvez aussi étendre ou réduire la sélection à un emplacement particulier en appuyant sur la touche SHIFT tout en cliquant sur le bouton gauche de la souris. En fonction de la position du curseur de la souris dans l'espace de travail vis à vis de la sélection, le bord gauche ou le bord droit de la sélection sera ajusté à la position pointée par le curseur.

source: There are also some functions available via the menu and of course some keyboard shortcuts:
cs: Jsou zde rovněž některé nové činnosti dostupné přes hlavní nabídku a samozřejmě nějaké ty klávesové zkratky:
de: Es sind auch einige Funktionen über das Menü und über einige Tastatur- Kurztasten (Shortcuts) verfügbar:
es: Hay algunas funciones disponibles por medio del menú y por supuesto de atajos de teclado:
fr: Il y a également quelques fonctions qui sont disponibles par le menu et bien sur quelques raccourcis clavier qui sont :
