Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: Shows the name of the engineer who worked on the file. If there are multiple engineers, separate the names by a semicolon and a blank.
de: Nennt den Namen des Ton-Technikers der die Datei bearbeitet hat. Bei mehreren Technikern sind die Namen durch ein Semikolon und ein Leerzeichen zu trennen.

source: Estimated length of the file in samples
de: Geschätzte Länge der Datei in Samples
es: Duración estimada del archivo en muestras

source: Name of the opened file
de: Name der geöffneten Datei
es: Nombre del archivo abierto

source: Size of the file in bytes
de: Grösse der Datei in Bytes
es: Tamaño del archivo en bytes

source: Describes the genre or style of the original work. Examples: 'classic', 'pop'
de: Beschreibt das Genre bzw. den Stil des Originalwerkes. Beispiele: 'Klassik', 'Pop'

source: ISRC number for the track; see the ISRC intro page for more information on ISRC numbers. http://www.ifpi.org/site-content/online/isrc_intro.html
de: ISRC-Nummer des Stücks. Für weitere Informationen über ISRC-Nummern siehe die ISRC-Einführungs-Seite unter: http://www.ifpi.org/site-content/online/isrc_intro.html

source: Provides a list of keywords that refer to the file or subject of the file.
de: Enthält eine Liste von Schlüsselworten die sich auf die Datei oder deren Inhalt beziehen.

source: The list of labels.
de: Die Liste aller Marker.

source: Length of the file in samples.
de: Länge der Datei in Samples.
es: Duración del archivo en muestras

source: License information, e.g., 'All Rights Reserved', 'Any Use Permitted', an URL to a license or the EFF Open Audio License ('distributed under the terms of the Open Audio License. See http://www.eff.org/IP/Open_licenses/eff_oal.html for details')), etc.
de: Lizenzinformation, z.B., 'Alle Rechte Vorbehalten', 'Zur freien Verwendung', ein URL zu einer Lizenz oder die EFF Open Audio License ('verbreitet unter den Bedingungen der Open Audio License. siehe http://www.eff.org/IP/Open_licenses/eff_oal.html für weiter Informationen'), etc.

source: Describes the original subject of the file, where it was first recorded. Example: 'orchester'
de: Beschreibt den ursprünglichen Gegenstand des Stücks, bei der erstmaligen Aufnahme. Beispiel: 'Orchester'

source: Mime type of the file format
de: Mime-Typ des Dateiformates
es: Tipo MIME del formato de archivo

source: Audio emphasis mode
de: Audio-Emphase Einstellung
es: Tipo de énfasis del audio

source: MPEG Layer, I, II or III
de: MPEG Layer, I, II oder III
es: MPEG capa I, II o III

source: MPEG Mode Extension (only if Joint Stereo)
de: MPEG Modus-Erweiterung (nur im Joint-Stereo Modus)
es: MPEG Mode de extensión (sólo con estéreo conjunto)

source: MPEG Version, 1, 2 or 2.5
de: MPEG Version, 1, 2 oder 2.5
es: MPEG Versión, 1, 2, o 2.5

source: Stores the title of the subject of the file. Example: "Symphony No.6, Op.68 'Pastoral'"
de: Enthält den Titel des Gegenstands der Datei. Beispiel: 'Symphonie No.6, Op.68 "Pastoral"'

source: Opus Frame Length in ms (supported values are 2.5, 5, 10, 20, 40, or 60 ms)
de: Opus Frame-Länge in ms (unterstützte Werte sind 2.5, 5, 10, 20, 40, und 60 ms)
es: Duración de la trama Opus (son valores soportados 2.5, 5, 10, 20, 40 o 60 ms)

source: Name of the organization producing the track (i.e. the 'record label')
de: Name der Organisation die das Stück produziert hat (z.B. der "Platten-Label")

source: Indicates whether the file is an original or a copy
de: Gibt an ob es sich beim Inhalt der Datei um ein Original handelt.
es: Indica si el archivo es un original o una copia

source: The artist(s) who performed the work. In classical music this would be the conductor, orchestra, soloists. In an audio book it would be the actor who did the reading.
de: Der oder die Künstler, die das Werk ausführten. Bei klassischer Musik kann dies der Dirigent, das Orchester oder der Solist sein, oder der Vortragende bei einem Hörspiel.

source: Indicates whether the subject is private
de: Gibt an ob der Inhalt der Datei nur für privaten Gebrauch ist.
es: Indica si el tema es privado

source: Specifies the name or the title the file was originally intended for. Example: 'Linux audio collection'
de: Bezeichnet den Namen oder den Titel des Produkts für den die Datei ursprünglich gedacht war. Beispiel: 'Linux Audio-Sammlung'

source: Format used for storing the digitized audio samples. Example: '32-bit IEEE floating-point'
de: Das zum Speichern der digitalisierten Audio-Samples verwendete Format. Beispiel: '32-Bit IEEE Fließkomma'

source: Number of samples per second
de: Anzahl der Samples pro Sekunde

source: Identifies the name of the software package used to create the file. Example: 'Kwave v0.6.4-1'
de: Nennt den Namen des Software-Paketes das zur Erstellung der Datei verwendet wurde. Beispiel: 'Kwave v0.6.4-1'

source: Identifies the name of the person or organization who supplied the original subject of the file. Example: 'Chaotic Sound Research'
de: Nennt den Namen der Person oder Organisation die das Original der Datei oder den Gegenstand zur Verfügung gestellt hat. Beispiel: 'Chaotic Sound Research'

source: Identifies the original form of the material that was digitized. Examples: 'Record/Vinyl/90RPM', 'Audio DAT', 'tape/CrO2/60min'
de: Gibt an von welchem Ursprungs-Medium das Stück digitalisiert wurde. Beispiele: 'Langspielplatte/Vinyl/90UPM', 'Audio-DAT', 'Kassette/CrO2/60min'

source: Describes the subject of the file. Example: 'Bird voices at early morning'
de: Beschreibt den Inhalt der Datei. Beispiel: 'Vogelgesang am frühen Morgen'

source: Identifies the technican who digitized the subject file. Example: 'Torvalds, Linus'
de: Nennt den Techniker der das Werk digitalisiert hat. Beispiel: 'Torvalds, Linus'

source: Track of the CD if the source was a CDROM.
de: Track der CD wenn die Quelle eine CDROM war.
es: Pista del CD si la fuente era un CDROM.

source: Number of tracks of the CD if the source was a CDROM.
de: Nummer des Tracks wenn die Quelle eine CD war.
es: Número de pistas del CD si la fuente era un CDROM.

source: Base quality of the compression in VBR mode
de: Basisqualität der Kompression im VBR-Modus
es: Calidad base de la compresión en modo VBR

source: May be used to differentiate multiple versions of the same track title in a single collection. (e.g. remix info)
de: Kann verwendet werden um verschiedene Versionen des selben Stücks in einer Single-Sammlung zu unterscheiden. (z.B. Name des Remixes)

source: The &kapp; Handbook
fr: Le manuel de &kapp;

source: &kapp; is a simple sound editor for KDE.
fr: &kapp; est un éditeur de sons pour KDE.

source: multimedia
cs: Multimédia
fr: multimédia

source: sound
cs: Zvuk
es: sonido
fr: son

source: editor
fr: éditeur

source: sonagram
cs: Obraz vytvořený ultrazvukem (sonogram)
es: sonograma
fr: sonogramme

source: This is "&kapp;", a simple sound editor for KDE3. Its features include:
fr: « &kapp; » est un éditeur de pistes sonores pour l'environnement de bureau KDE3. Il inclut les fonctionnalités suivantes :

source: MP3 import
fr: Importation de fichier au format MP3.

source: support for editing of multi-channel files
fr: Le support des multicanaux pour l'édition de fichiers sonores.

source: playback of multi-channel audio files (audio output will be mixed down to mono or stereo)
fr: La lecture de fichiers sonores multicanaux (l'écoute des pistes audio est mixée en mono ou en stéréo).

source: import/export of other audio formats through <ulink url="http://freeware.sgi.com/Installable/audiofile-0.2.3.html">audiofile</ulink>
fr: Importation/exportation d'autre formats audio à l'aide de <ulink url="freeware.sgi.com/Installable/audiofile-0.2.3.html">libaudiofile</ulink>.

source: &kapp; Resources
fr: Les ressources de &kapp;

source: So if you want to get in contact with the developers, need some further help on using &kapp;, submit patches, bug reports or other stuf, the following resources might be of interest for you:
fr: Si vous voulez prendre contact avec les développeurs, pour fournir de l'aide sur l'élaboration de &kapp;, soumettre des correctifs, rapporter des bogues ou des dysfonctionnements, les informations suivantes peuvent vous intéresser :

source: Project Homepage
fr: La page WEB du projet.

source: For informations about new up-to-date releases or some other information about this project, take a look at the <ulink url="http://kwave.sourceforge.net/">&kapp; homepage</ulink>
fr: Pour toutes informations sur les nouvelles mises à jour ou sur l'ensemble du projet, visitez l'URL de <ulink url="http://kwave.sourceforge.net/">la page WEB officielle de &kapp;</ulink>

source: Mailing List
fr: La liste de diffusion.

source: If you need some help on using &kapp; or want to get involved in the development, join the Kwave developer mailing list by visiting <ulink url="https://lists.sourceforge.net/lists/listinfo/kwave-devel"> "https://lists.sourceforge.net/lists/listinfo/kwave-devel"</ulink>.
fr: Si vous désirez avoir de l'aide sur l'utilisation de &kapp; ou si vous voulez participer au développement, inscrivez-vous sur la liste de diffusion en visitant l'URL <ulink url="https://lists.sourceforge.net/lists/listinfo/kwave-devel"> "https://lists.sourceforge.net/lists/listinfo/kwave-devel"</ulink>.

source: CVS Repository
fr: Le dépôt CVS

source: There also is a CVS repository, hosted by <ulink url="http://sourceforge.net">SourceForge</ulink> where you can get the sources of the latest development version. For instructions on how to get access to the repository, read in the chapter about <link linkend="building_rpm_from_cvs">building from CVS</link>, look at <ulink url="http://sourceforge.net/cvs/?group_id=6478">"http://sourceforge.net/cvs/?group_id=6478"</ulink>, or just browse through the CVS tree through a nice web interface. <emphasis>Anonymous CVS access is allowed!</emphasis>
fr: Il y a également un dépôt CVS, qui est hébergé par <ulink url="http://sourceforge.net">SourceForge</ulink> ou vous pouvez télécharger les dernières versions des sources du programme. Pour toute information concernant la procédure d'accès au dépôt CVS, lisez le chapitre sur <link linkend="building_rpm_from_cvs">la construction à partir du CVS</link>, consultez l'URL <ulink url="http://sourceforge.net/cvs/?group_id=6478">"http://sourceforge.net/cvs/?group_id=6478"</ulink>, ou visiter l'arborescence CVS directement à travers votre navigateur internet. <emphasis>Un accès anonyme au dépôt CVS est disponible !</emphasis>

source: &kapp; Revision History
fr: L'historique des différentes versions de &kapp;

source: first version with recording functionality (still alpha)
fr: Première version avec le module externe d'enregistrement audio (alpha)

source: removed workaround for uic invocation
fr: Suppression des appels au programme « uic ».

source: bugfix: handling of persistent and unique plugins was wrong, which caused playback to work only in the first main window instance
fr: Correction de bogue : le drapeau d'activation des modules externes était mauvais. Une seule instance de Kwave était possible.

source: added project files for kdevelop-3
fr: Ajout des fichiers projet pour Kdevelop version 3

source: new plugin: "pitch_shift"
fr: Nouveau module externe « pitch_shift ».

source: new plugin: "lowpass"
fr: Nouveau module externe « lowpass ».

source: new plugin: "notch_filter", contrinuted by Dave Flogeras
fr: Nouveau module externe « notch_filter », par Dave Flogeras.

source: included a bugfixed version of the synth_pitch_shift aRts plugin
fr: Ajout de la version corrigée du module externe « synth_pitch_shift » de aRts.

source: new feature: "pre-listen", first implementation in pitch_shift plugin
fr: Nouvelle caractéristique : « Aperçu sonore ». Première implantation dans le module externe « pitch_shift ».

source: ported to work with Qt-3.1 without Qt-2 compatibility, also compiles with -DQT_NO_COMPAT -DQT_CLEAN_NAMESPACE
fr: Portage vers QT3.1 sans compatibilité avec QT2. Compilation possible avec les options « -DQT_NO_COMPAT » et « -DQT_CLEAN_NAMESPACE ».

source: works with KDE-3.1
fr: Fonctionne avec KDE 3.1.

source: many improvements on the build system. Now compiles under Debian, Mandrake, RedHat, Gentoo and SuSE
fr: Plusieurs améliorations sur le processus de compilation du programme. Cela doit fonctionner avec les systèmes Debian, Mandrake, RedHat, Gentoo et SuSE.

source: starting up with last window size
fr: Utilisation de la taille de fenêtre principale utilisée lors de la dernière session.

source: Xt toolkit option for geometry works again, including workaround for bug in KDE3's geometry management. example: "kwave -geometry 800x600"
fr: Ajout d'options « Xt » pour la gestion de la géométrie de la fenêtre principale. Correction d'un bogue avec KDE 3.x. Exemple : « kwave -geometry 800x600 ».

source: bugfix: select to left selected one sample less then needed
fr: Correction de bogue : sélection d'un échantillon en moins à gauche d'une sélection quand cela est nécessaire.

source: volume plugin: simple clipping
fr: Module externe « Volume » : simple découpage.

source: volume plugin: mode for "multiply with /divide through factor"
fr: Module externe « Volume » : mode « Multiplier avec / Diviser par un coefficient ».

source: newsignal and selectrange plugin: got rid of KDoubleNumInput and it's weird display and entry behaviour
fr: Module externe « newsignal » et « selectrange » : « KDoubleNumInput » n'est plus utilisé à cause d'un comportement étrange dans l'affichage.

source: selectrange plugin: also select start position of selection
fr: Module externe « selectrange » : sélection correcte au début de la plage sélectionnée.

source: can use libmad and libaudiofile from the host system if usable
fr: Possibilité d'utiliser les bibliothèques « libmad » et « libaudiofile » si elle sont installées sur votre système.

source: show the fileinfo plugin when saving under a different mime type
fr: Affichage des informations du module externe « fileinfo » quand on enregistre sous un type MIME différent.

source: MP3 import with ID3 tag support through id3lib and libmad
fr: Importation de fichiers au format MP3 avec le support des marquages ID3 avec les bibliothèques « id3lib » et « libmad ».

source: Ogg/Vorbis import and export (only ABR mode)
fr: Importation et exportation des fichier Ogg / Vorbis (seulement en mode ABR).

source: new plugin "volume"
fr: Nouveau module externe « volume ».

source: show selected range as time (feature requested by Christian Hollaender)
fr: Affichage des plages sélectionnées avec le temps (caractéristique demandé par Christian Hollaender).

source: support for saving compressed .wav files
fr: Support de l'enregistrement des fichiers « .wav » compressés.

source: thrown away Qt2/KDE2 compatibility, now only supports Qt3/KDE3
fr: La compatibilité avec Qt2/KDE2 n'est plus respectée. Seul Qt3/KDE3 sont supportées.

source: playback plugin: enabled the "select..." button for choosing other playback devices (feature requested by Len Ovens)
fr: Module externe de lecture : activation du bouton « Sélectionner... » pour choisir d'autres périphériques de lecture (caractéristique demandé par Len Ovens).

source: solved problem with name mangling in plugins and different gcc versions
fr: Résolution des problèmes avec label « mangling » dans les modules externes et les versions différentes du compilateur « gcc ».

source: works with gcc-3.2 / solved __dso_handle problem
fr: Fonctionne avec le compilateur « gcc » en version 3.2. Résolution des problèmes avec « __dso_handle ».

source: stricter checks for programs in configure script
fr: Ajout de contrôles plus stricts pour des programmes dans le script « .configure ».

source: support for different file formats / integrated libaudiofile
fr: Support pour différents formats de fichiers. Intégration de « libaudiofile ».

source: drag and drop bugfix: dropping into the same signal left from the selection removed wrong range
fr: Correction de bogues pour le glisser / déposer : le lâchement dans un même signal audio à gauche d'une sélection supprime une mauvaise partie du signal.

source: auto-repair for structurally damaged wav files
fr: Réparation automatique des structures endommagées des fichiers au format WAVE.

source: bugfix: save selection works again
fr: Correction de bogues dans la sauvegarde d'une sélection.

source: integrated libkwavemt into libkwave
fr: Intégration de « libkwavemt » dans « libkwave ».

source: using time instead of zoom factor, e.g. set zoom to "1 minute" (feature requested by Gilles Caulier)
fr: Utilisation du temps à la place du facteur de zoom (tel que lorsque le zoom correspond à « 1 minute »).

source: menu entries for playback control
fr: Entrées dans le menu pour le contrôle de la lecture d'une piste sonore.

source: some more icons in the menues
fr: Quelques icônes supplémentaires dans les menus.

source: replaced KFileDialog with subclass KwaveFileDialog (works around some bugs in KDE)
fr: Remplacement de « KFileDialog » par la sous-classe « KwaveFileDialog » (corrige quelques bogues avec KDE).

source: added a little chapter about digital audio basics to online help
fr: Ajout d'un petit chapitre dans l'aide sur les rudiments des enregistrements audio numériques.

source: added "select range" plugin
fr: Ajout du module externe « Selectrange ».

source: simple drag and drop
fr: Le glisser / déposer simple.

source: french translation
fr: Traductions Française.

source: handling of "signal modified"
fr: Traitement de « signal modified ».

source: shows error message and aborts if loading failed
fr: Affichage d'un message d'erreur et d'arrêt si le chargement d'un fichier échoue.

source: new plugin "amplifyfree"
fr: Nouveau module externe « amplifyfree ».

source: new plugin "noise"
fr: Nouveau module externe « noise ».

source: new aRts plugin adapter framework now Kwave is able to use existing aRts plugins in it's own plugins for sound processing
fr: Un nouveau module externe pour le serveur de sons aRts fonctionne maintenant avec Kwave et il est possible de l'utiliser pour jouer des pistes sonores.

source: changed documentation to XML / Docbook-4.1
fr: Changement du format de la documentation en XML / Docbook-4.1.

source: recovery of damaged files if non-zero file length but data length entry in the wav header is zero (e.g. happens when krecord crashes during recording)
fr: Récupération des fichiers endommagés si leur longueur n'est pas égale à zéro mais que les données d'entrées dans l'en-tête du fichier au format WAVE indique une valeur nulle (tel que lorsqu'une application comme « Krecord » s'arrête indésirablement pendant l'enregistrement d'une piste sonore).

source: bugfix: freeing virtual memory fixed in MemoryManager
fr: Correction de bogue : libération de la mémoire virtuelle allouée dans le gestionnaire de mémoire.

source: bugfix: problem with TSS in TSS_Object cleanup
fr: Correction de bogue : problème avec TSS dans la libération de « TSS_Object ».

source: bugfix: class Track made duplicate entry in stripe list when inserting signals into an empty track
fr: Correction de bogue : la classe « Track » construit une entrée en double dans la liste des pistes quand on insère des signaux dans une piste sonore vide.

source: fixed that weird layout behavior in dialogs, seems that Qt has problems with complex nested layouts :(
fr: Correction du comportement étrange de l'affichage dans les boîtes de dialogues, depuis que la librairie Qt a des problèmes avec la construction de boîtes de dialogues complexes.

source: USE OF VIRTUAL MEMORY
fr: UTILISATION DE LA MÉMOIRE VIRTUELLE

source: changed Makefiles: html docu stays in distribution due to too much trouble with the KDE documentation tools
fr: Changement des fichiers « Makefiles » : la documentation au format HTML restant dans la distribution de l'application provoque des dysfonctionnements avec les outils de construction de la documention pour KDE.

source: when inserting from clipboard into a signal with a different number of tracks, the result will be mixed (still not optimized/slow)
fr: Quand on insère des données issues du presse papier vers un nombre de pistes sonores non cohérent, le résultat est mixé (opération non optimisée / lente).

source: fixed compile problem with gcc-2.96 / gcc-3.0
fr: Correction de problèmes pour la compilation avec les compilateurs gcc-2.96 / gcc-3.0.

source: fixed missing header file in NewSigDlg.ui
fr: Correction de l'oubli d'un fichier d'en-tête dans « NewSigDlg.ui ».

source: the RPM should be relocateable again
fr: Le RPM doit pouvoir être relogeable lors de l'installation.

source: fixed bug in shutdown sequence, now clipboard is flushed before the application closes.
fr: Correction d'un bogue dans les séquences de fermeture de l'application. Le presse-papiers est alors vidé de son contenu.

source: PORTED TO QT-2 AND KDE2
fr: PORTAGE VERS QT-2 ET KDE2

source: completely new internal architecture
fr: Architecture interne revue et corrigé complètement.

source: plugins can be located in a user directory
fr: Les modules externes peuvent être installés dans les dossiers des utilisateurs.

source: libkwave is included and no longer supported (at least by me) as a separate package
fr: « libkwave » est incluse dans le programme alors qu'elle était avant un paquetage séparé.

source: playback via aRts
fr: Écoute des pistes audio via le module sonore aRts.

source: many more bugfixes, too many to mention here...
fr: Nombreuses correction de bogues.

source: bugfix: selection across end of file no longer possible
fr: Correction de bogues : impossible de sélectionner jusqu'à la fin des pistes sonores.

source: bugfix: no overflow in wav header when saving large wav files above 268MB (bug reported by Sven-Steffen Arndt, ssa29@gmx.de )
fr: Correction de bogues : plus de débordement mémoire dans le traitement des en-têtes wav lors de la sauvegarde de fichiers de plus de 268Mo (bogue reporté par Sven-Steffen Arndt, ssa29@gmx.de).

source: new playback handling, allows pause/continue
fr: Nouvelle gestion de la lecture de pistes sonores avec les fonctions Pause et Continuer.

source: limited the playback buffer to be between 256 and 65536 bytes due to problems (system hang) with small playback buffers with 16..64 bytes (might be a hardware problem)
fr: Limitation de la taille de la mémoire tampon de lecture a une valeur comprise entre 256 et 65536 octets. Il y avait quelques problèmes avec de petites tailles lorsque la taille était comprise entre 16 et 64 octets (peut être liés à des dysfonctionnements matériels).

source: introduced a toolbar for some standard operations
fr: Ajout d'une barre d'outils comme dans toute application standard.

source: fixed some bugs concerning selection with the mouse
fr: Correction de quelques bogues concernant les sélections avec la souris.

source: rework of the overview widget (used in main window and sonagram)
fr: Reprise des « Widgets » de l'IHM (utilisés dans la fenêtre principale et le sonogramme).

source: fixed menu command "zoom selection"
fr: Correction de la commande « zoomer sur la sélection ».

source: sonagram: saving to file, auto-brightness adjust
fr: Sonogramme : sauvegarde dans un fichier et ajustement automatique de la brillance.

source: replaced QFileDialog with KFileDialog
fr: Remplacement de « QFileDialog » par « KFileDialog ».

source: tested with AMD Athlon-optimized compiler (patched pegcs)
fr: Tests des optimisations de compilation pour un processeur AMD Athlon (correctifs pour pegcs).

source: some fixes for safer multithreading
fr: Correction de bogues pour un fonctionnement correct du multithreading.

source: checking for much more header files at configure time (due to a problem reported by issiac@evcom.net )
fr: Vérification de quelques fichiers d'en-tête pour la séquence de configuration (Problèmes reportés par issiac@evcom.net).
