Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: The <emphasis>frequency range</emphasis> is also limited. Due to the mechanical constrains of microphones and the limited frequency range of amplifiers, a signal's frequency range is limited. There are no hard borders besides which the sound abruptely disappears, but below some low and above some higher frequency the amplitude of the signal starts to decrease more and more. The existance of a maximum frequency can be easily understood as a limited speed of the electrical signal to rise and fall. By using high quality amplifiers and microphones, the limits can be spread into ranges where the human ear is no longer able to hear their results and thus get out of interest. The human ear normally is not able to hear sound above 20 kHz.
cs: <emphasis>Kmitočtový rozsah</emphasis> je také omezený. Kvůli mechanickým omezením mikrofonů a omezenému kmitočtovému rozsahu zesilovačů je kmitočtový rozsah signálu omezený. Nejsou pevné hranice, za nimiž zvuk znenadání zmizí, ale pod některými nízkými a nad některými vyššími kmitočty se rozkmit signálu začíná více a více snižovat. Bytí nejveššího možného kmitočtu lze snadno chápat jako omezenou rychlost elektrického signálu při stoupání a klesání. Používáním vysoce kvalitních zesilovačů a mikrofonů mohou být tato omezení rozšířena až po rozsah, kdy lidské ucho již dále není schopno uslyšet jejich výsledky a tím se o ně přestává zajímat. Lidské ucho obyčejně není schopné zaslechnout zvuk s kmitočtem nad 20 kHz.
de: Der <emphasis>Frequenzbereich</emphasis> ist ebenfalls begrenzt. Aufgrund der mechanischen Einschränkungen von Mikrophonen und dem begrenzten Frequenzbereich von Verstärkern ist auch der Frequenzbereich eines Signals begrenzt. Es gibt dabei keine harten Grenzen ausserhalb derer das Signal abrupt verschwindet, aber unterhalb und oberhalb bestimmter Grenzen nimmt die Amplitude des Signals immer mehr ab. Die Existenz einer maximalen Frequenz lässt sich mit der begrenzen Geschwindigkeit erklären mit der ein elektrisches Signal steigen oder fallen kann. Indem man hochwertige Mikrophone und Verstärker verwendet, können diese Grenzen jedoch in Bereiche verschoben werden in denen sie vom menschlichen Ohr nicht mehr wahrgenommen werden können und daher nicht mehr interessieren. Das menschliche Ohr kann normalerweise keine Frequenzen oberhalb von 20 kHz mehr wahrnehmen.
es: El <emphasis>rango de frecuencia</emphasis> también está limitado. Debido a las limitaciones mecánicas de los micrófonos y el limite en el rango de frecuencia de los amplificadores, el rango de frecuencia de una señal está limitado. No hay unos límites estrictos en los cuales el sonido desaparece abruptamente, sino que pero por debajo y por encima de ciertas frecuencias la amplitud de la señal comienza a disminuir más y más. La existencia de una frecuencia máxima se puede entender como un límite de velocidad de la señal eléctrica en cuanto a subida y caida. Al usar amplificadores y microfonos de alta calidad, los límites pueden ir más allá de los rangos audibles por el ser humano. El oido humano no es capaz de oir por encima de 20 kHz.
fr: La <emphasis>plage de fréquences</emphasis> est aussi limitée. Cela est dû à des contraintes mécaniques des microphones et aux limitations des plages de fréquences des amplificateurs. Il n'y a pas de cassures nettes au niveau fréquentiel pour lesquelles le son disparait. Généralement, le son est atténué progressivement dans les basses et hautes fréquences. L'existence d'une fréquence maximale peut être facilement comprise en associant cette hypothèse aux limites de temps de monté et de descente du signal électrique dans les composants électroniques. En utilisant un amplificateur et un microphone de haute qualité, ces limites peuvent être repoussées dans des plages de fréquences inaudibles pour des êtres humains. Un homme entend normalement les sons jusqu'à une fréquence de 20 kHz.

source: The signal contains <emphasis>noise</emphasis>. Noise is the most ugly enemy of everyone who has to handle audio signals in any way. Noise is a typical analogue effect, that makes the audio signal "unsharp" and disturbed, it is always present and cannot be avoided. One can only try to use high quality components that produce as low noise as possible, so that one can't hear it. Normally noise has a certain volume, so that the interesting sound should be much louder in comparism to the noise. This is called the <emphasis>signal to noise ratio (SNR)</emphasis>, the higher it is the better the sound's quality will be. Sounds that have lower volume than the noise cannot be heart.
cs: Signál obsahuje <emphasis>šum</emphasis>. Šum je nejošklivějším nepřítelem každému, kdo musí jakkoli zpracovávat audio signál. Šum je typickým účinkem anologu, který vede k tomu, že audio signál je "neostrý" a nevyrovnaný. Je vždy přítomen a nelze se mu vyhnout. Člověk může akorát tak používat vysoce kvalitní součástky, které vytvářejí šum nízký natolik, až jak je to vůbec možné, takže jej již nelze slyšet. Obyčejně má šum určitou hlasitost, takže poutavý zvuk by měl být mnohem hlasitější ve srovnání se šumem. Říká se tomu <emphasis>poměr signálu a šumu (SNR; signal to noise ratio)</emphasis>. Čím je poměr vyšší, tím lepší je kvalita zvuku. Zvuky, u nichž je jejich hlasitost nižší než hlasitost šumu, nelze slyšet.
de: Das Signal enthält <emphasis>Rauschen</emphasis>. Rauschen ist der unangenehmste Feind eines jeden der Audiosignale in irgendeiner Art und Weise bearbeiten muss. Rauschen ist ein typischer analoger Effekt, der das Audiosignal "unscharf" macht und stört, es ist immer vorhanden und kann nicht vermieden werden. Man kann lediglich versuchen, durch den Einsatz von qualitativ hochwertigen Komponenten so wenig Rauschen wie möglich zu erzeugen, so dass man es nicht hörbar wahrnehmen kann. Normalerweise besitzt das Rauschen eine gewisse Lautstärke, so dass das interessierende Signal im Vergleich zum Rauschen lauter sein sollte. Diese Relation wird auch als das <emphasis>Signal-Rausch-Verhältnis (SNR)</emphasis> bezeichnet. Je höher es ist, desto besser ist die Qualität des Signals. Töne die leiser sind als das Rauschen können nicht mehr gehört werden.
es: La señal contiene <emphasis>ruido</emphasis>. El ruido es el mayor enemigo para alguien que tiene que tratar con señales de audio. El ruido es un efecto analógico que perturba la señal de audio, que siempre está presente y que no puede ser evitado. Uno sólo puede intentar usar componentes de alta calidad que produzcan niveles de ruido lo más bajos posibles para evitar oirlos. Normalmente el ruido tiene un cierto volumen por lo que el sonido que nos interesa debe ser mucho más alto en comparación con el ruido. Esto se denomina <emphasis>relación señal/ruido (SNR)</emphasis>, cuanto más alto sea mayor será la calidad del sonido. Sonidos que tienen un volumen menor que el ruido no pueden ser oidos.
fr: Le signal contient du <emphasis>bruit</emphasis>. Le bruit est l'ennemi le plus néfaste. Il marque le signal à tous les niveaux. Typiquement, le bruit est un effet analogique qui perturbe le signal. Il est toujours présent et ne peut pas être supprimé. On peut seulement essayer d'utiliser des composants électroniques de haute qualité qui produisent un bruit de faible amplitude que l'on ne peut pas distinguer. Normalement le bruit a un certain volume qui doit être le plus négligeable possible par rapport au signal utile. On appelle cela le <emphasis>rapport signal sur bruit (SNR)</emphasis>. Une valeur élevée de ce rapport donne une bonne qualité de sons. Un son qui a un faible volume plus faible que le bruit ne peut être entendu.

source: Digitalization
cs: Digitalizace
de: Digitalisierung
es: Digitalización
fr: La numérisation

source: When we want to store and play audio in a computer, we must convert the analogue sound into digital data first. This process is called <emphasis>digitalization</emphasis>. It converts an electronic signal into a sequence of digital values.
cs: Když chceme ukládat a přehrávat zvuk v počítači, musíme nejprve převést analogový zvuk na digitální data. Tomuto procesu převodu se říká <emphasis>digitalizace</emphasis>. Dochází při něm k převodu elektronického signálu na sled číslicových hodnot (digitálních).
de: Wenn wir Audiosignale im Computer speichern oder abspielen wollen, müssen die analogen Klänge zuerst in digitale Daten umgewandelt werden. Dieser Vorgang wird als <emphasis>Digitalisierung</emphasis> bezeichnet. Es wandelt ein elektronisches Signal in eine Abfolge von digitalen Werten um.
es: Cuando queremos almacenar y reproduir audio en un ordenador debemos convertir el sonido analógico en información digital primero. Este proceso recibe el nombre de <emphasis>digitalización</emphasis>. Este proceso convierte la señal electrónica en una secuencia de valores digitales.
fr: Quand nous voulons enregistrer et jouer une piste audio sur un ordinateur, nous devons d'abord convertir le signal analogique en données numériques. Ce procédé est appelé <emphasis>numérisation</emphasis>. Il converti un signal électronique en une séquence de valeurs numériques.

source: <phrase>Digitalization of the electronic signal</phrase>
cs: <phrase>Digitalizace elektronického signálu</phrase>
de: <phrase>Digitalisierung des elektronischen Signals</phrase>
es: <phrase>Digitalización de la señal electrónica</phrase>
fr: <phrase>La numérisation d'un signal électronique</phrase>

source: <para>Digitalization of the electronic signal</para>
cs: <para>Digitalizace elektronického signálu</para>
de: <para>Digitalisierung des elektronischen Signals</para>
es: <para>Digitalización de la señal electrónica</para>
fr: <para>La numérisation d'un signal électronique</para>

source: The conversion can be understood as a repetitive measurement of the electonic signal's value at certain time, thus taking a <emphasis>sample</emphasis> of the signal. The result is then encoded as a digital value.
cs: Převod lze chápat jako v určitém čase se opakující měření hodnoty elektronického signálu, čímž se získává <emphasis>vzorek</emphasis> signálu. Výsledek se pak zakóduje jako číslicová hodnota.
de: Die Umwandlung kann als eine wiederholte Messung des augenblicklichen Wertes eines elektrischen Signals verstanden werden, es werden also einzelne Abtastwerte (Samples) bestimmt. Das Ergebnis wird dann als digitaler Wert kodiert.
es: La conversión se puede entender como una medida repetitiva del valor de la señal electrónica en un momento determinado, tomando de este modo una <emphasis>muestra</emphasis> de la señal. El resultado es codificado como un valor digital.
fr: La conversion peut être comprise comme des mesures répétitives des valeurs du signal électronique à un certain temps. On appelle cela <emphasis>l'échantillonnage</emphasis> du signal. Le résultat est alors encodé en valeurs numériques.

source: The sampling could be done in arbitrary distances or in constant intervals. The later method is much easier to handle, and thus it is normally used, with a constant rate - the so-called <emphasis>sample rate</emphasis>. Usual sample rates are 8000, 11025, 22050, and 44100 samples per second. In practice sample rates are also given as frequencies, in Hz or kHz.
cs: Vzorkování lze provádět v libovolných vzdálenostech nebo ve stálých rozmezích (intervalech). Posledně jmenovaný způsob se dá provést mnohem snadněji, a proto se obvykle používá, se stálým kmitočtem (rychlostí) - tzv. <emphasis>vzorkovací kmitočet (rychlost)</emphasis>. Obyvyklými vzorkovacími kmitočty (rychlostmi) jsou 8000, 11025, 22050, a 44100 vzorků za sekundu. V provozu se vzorkovací kmitočty udávají jako kmitočty (frekvence) v Hz nebo kHz.
de: Die Abtastung kann in wechselnden oder gleichmässigen Intervallen vorgenommen werden. Letztere Methode ist viel einfacher zu handhaben und wird deshalb normalerweise angewandt, mit einer konstanten Rate - der sogenannten <emphasis>Abtastrate</emphasis>. Übliche Abtastraten sind 8000, 11025, 22050 und 44100 Samples pro Sekunde. In der Praxis werden Abtastraten auch als Frequenzen in Hz oder kHz angegeben.
es: La muestra puede ser hecha en distancias arbitrarias o en intervalos constantes. El último método es mucho más facil de implementar, y por tanto es el usado normalmente, con una frecuencia constante - la llamada <emphasis>frecuencia de muestreo</emphasis>. Frecuencias de muestreo habituales son 8000, 11025, 22050 y 44100 muestras por segundo.En la práctica las frecuencias de muestreo son también dadas como frecuencias en Hz o KHz.
fr: L'échantillonnage peut être fait à des distances temporelles arbitraires ou à des intervalles constants. La dernière méthode est la plus facile à utiliser. Elle utilise un taux constant que l'on l'appelle <emphasis>période d'échantillonnage</emphasis>. Normalement, ce taux est de 8000, 11025, 22050, ou 44100 échantillons par seconde. Dans la pratique, les périodes d'échantillonnage donnent aussi des fréquences en Hz ou en kHz.

source: The sample rate limts the highest frequency a digitized signal can represent. Due to Shannon's theorem the highest usable frequency is half of the sample rate, so with 44.1 kHz sample rate you cannot sample signals with more than 22 kHz. To avoid a violation of that half-sample rate rule, your soundcard already has built-in filters that filter away frequencies that are higher than half of the used sample rate.
de: Die Abtastrate begrenzt die höchste Frequenz die digitalisiert werden kann. Aufgrund des Shannon'schen Abtasttheorems entspricht die höchste darstellbare Frequenz der halben Abtastfrequenz, somit können mit einer Abtastrate von 44,1 kHz keine Frequenzen oberhalb von ca. 22kHz fehlerfrei digitalisiert werden. Um eine Verletzung dieser Halbe-Abtastrate-Regel zu vermeiden, besitzt Ihre Soundkarte bereits eingebaute Filter, die alle Frequenzen oberhalb der halben Abtastrate wegfiltert.

source: <phrase>Sampled signal</phrase>
cs: <phrase>Vzorkovaný signál</phrase>
de: <phrase>Gesampletes Signal</phrase>
es: <phrase>Señal muestreada</phrase>
fr: <phrase>Le signal échantillonné</phrase>

source: <para>Sampled signal</para>
cs: <para>Vzorkovaný signál</para>
de: <para>Gesampletes Signal</para>
es: <para>Señal muestreada</para>
fr: <para>Le signal échantillonné</para>

source: Sample Encoding
cs: Kódování vzorku
de: Sample-Codierung
es: Codificación de la muestra
fr: L'encodage échantillonné

source: The result of the digital sampling process is a sequence of single <emphasis>samples</emphasis>. One sample is a digital representation of a signal's value at a certain time.
cs: Výsledkem číslicového vzorkovacího procesu je sled jednoduchých <emphasis>vzorků</emphasis>. Jeden vzorek je číslicovým zachycením hodnoty signálu v určitý čas.
de: Das Ergebnis der Abtastung ist eine Folge von <emphasis>Samples</emphasis> (Abtastwerten). Ein Sample repräsentiert den Wert eines Signal zu einem bestimmten Zeitpunkt als digitalen Wert.
es: El resultado del proceso de muestreo digital es una secuencia de <emphasis>muestras</emphasis> simples. Una muestra es una representación digital del valor de una señal en un determinado momento.
fr: Le résultat d'un processus d'échantillonnage numérique est une séquence de simple <emphasis>échantillons</emphasis>. Un échantillon est une représentation numérique du signal à un temps donné.

source: The value of a sample can be interpreted and encoded in several ways. The simplest one is <emphasis>linear</emphasis> encoding. This means that each sample's value directly represents the analogue signal's value multiplied with a constant factor. This is easy to handle, but has the disadvantage that noise will be audibles especially on low amplitudes, where it disturbes most, and less audible on high amplitudes, where it is less audible.
cs: Hodnota vzorku může být vykládána a zakódována několika způsoby. Nejjednodušším je <emphasis>přímočaré</emphasis> zakódování. Znamená to, že každá hodnota vzorku přímo vyjadřuje hodnotu analogového signálu násobenou stálým násobkem. Dobře se s tím dá zacházet, ale nevýhodou je, že šum je slyšitelný obzvláště při nízkých rozkmitech, kde ruší nejvíce, a méně slyšitelný u vysokých rozkmitů, kde je to méně slyšet.
de: Der Wert eines Samples kann auf verschiedene Arten interpretiert und kodiert werden. Die einfachste Art ist die <emphasis>lineare</emphasis> Kodierung. Dies bedeutet, dass der Wert eines Samples direkt dem Wert des Signals entspricht, multipliziert mit einem Faktor. Das ist zwar einfach zu handhaben, hat jedoch den Nachteil dass Rauschen besonders bei leisen Passagen zu hören ist, wo es am meisten stört, und weniger bei hohen Lautstärken, wo es weniger hörbar ist.
es: El valor de una muestra puede ser interpretado y codificado de varias maneras. La más simple es la codificación <emphasis>linear</emphasis>. Esto significa que cada valor de muestreo representa directamente el valor de la señal analógica multiplicada por un factor constante. Este método es fácil de implementar, pero tiene la desventaja de que el ruido será audible especialmente a bajas amplitudes, donde es más molesto, y menos audible en altas amplitudes, donde es menos audible.
fr: La valeur d'un échantillon peut être interprété et encodé de plusieurs manières. La plus simple est l'encodage <emphasis>linéaire</emphasis>. Avec cet encodage, on peut pour chaque valeur des échantillons, déterminer directement la valeur du signal analogique en utilisant un coefficient multiplicateur constant. Cette technique est facile à mettre en oeuvre, mais présente l'inconvénient de rendre audible le bruit pour les faibles amplitudes. C'est pour ces valeurs du signal que le bruit est le plus perturbateur. Il est cependant moins audible pour les hautes fréquences.

source: One way to reduce the influence of noise is <emphasis>non-linear</emphasis> encoding. This means that lower amplitudes are amplified before processing. As lower amplitudes are amplified, their distance from noise increases and the quality improves. The most common methods for this are <emphasis>A-Law</emphasis> and <emphasis>U-Law</emphasis> encoding - some standardized logarithmic amplification curves, used in digital telephony (ITU G.711 standard).
cs: Jedním ze způsobů, jak omezit vliv šumu je <emphasis>nepřímočaré</emphasis> zakódování. Znamená to, že nižší rozkmity jsou zesíleny před zpracováním. Když jsou nižší rozkmity zesíleny, jejich vzdálenost od šumu se zvětší a kvalita zlepší. Nejběžnějšími metodami pro provedení tohoto způsobu jsou zakódování podle <emphasis>pravidla A</emphasis> a <emphasis>pravidla U</emphasis> - standardizované křivky logaritmického zesílení používané při digitálním telefonování (ITU G.711 standard).
de: Eine Massnahme zur Reduzierung des Einflusses des Rauschens ist <emphasis>nicht-lineare</emphasis> Kodierung. Dies bedeutet, dass kleinere Amplituden vor der Verarbeitung angehoben werden. Indem kleinere Amplituden verstärkt werden, nimmt ihr Abstand zum Rauschen zu und die Qualität verbessert sich. Die beiden am weitesten verbreiteten Methoden sind <emphasis>A-Law</emphasis> und <emphasis>U-Law</emphasis> - zwei standardisierte logarithmische Verstärkungskurven, die in der digitalen Telefonie Verbreitung gefunden haben (ITU-Standard G.711).
es: Una manera de reducir la influencia del ruido es a través de la codificación <emphasis>no-linear</emphasis>. Esto significa que las bajas amplitudes son amplificadas antes del procesado. Ya que las bajas amplitudes son amplificadas su distancia del ruido aumenta lo que provoca una mejora de la calidad. Los métodos más comunes para esto son usando los algoritmos <emphasis>Ley A</emphasis> o el <emphasis>Ley Mu</emphasis>. Estos algoritmos se encuentran estandarizados y son usados en telefonía digital (Estandar ITU G.711).
fr: Une des solutions pour réduire l'influence du bruit est d'utiliser un encodage <emphasis>non linéaire</emphasis>. Avec cette technique, les faibles amplitudes sont amplifiées avant d'être traitées. Les distances entre le bruit et les faibles amplitudes sont alors réduites et la qualité du signal est alors meilleure. Les méthodes d'encodages non linéaires les plus utilisées sont <emphasis>l'encodage A-Law</emphasis> et <emphasis>l'encodage U-Law</emphasis>. Quelques techniques d'amplifications sont standardisées en téléphonie numérique (ITU G.711 par exemple).

source: <phrase>Nonlinear Encoding</phrase>
cs: <phrase>Nepřímočaré zakódování</phrase>
de: <phrase>Nichtlineare Codierung</phrase>
es: <phrase>Codificación no-linear</phrase>
fr: <phrase>L'encodage non linéaire</phrase>

source: <para>Nonlinear Encoding</para>
cs: <para>Nepřímočaré zakódování</para>
de: <para>Nichtlineare Codierung</para>
es: <para>Codificación no-linear</para>
fr: <para>L'encodage non linéaire</para>

source: Sample Formats
cs: Vzorkovací formáty
de: Sample-Formate
es: Formatos de muestreo
fr: Formats d'échantillonnage

source: Samples can be stored in different formats and precisions. The most common ones are integer (fixed-point) formats, that store values with <emphasis>fixed quantisations</emphasis>. Depending on where the zero line is defined, it has to be destinguished between <emphasis>unsigned</emphasis> (only positive values, "zero line" is at half of the numeric range) and <emphasis>signed</emphasis> (positive and negative values) integer formats.
cs: Vzorky se dají ukládat do různých formátů a s různou přesností. Nejběžnější jsou formáty celočíselné (s pevnou desetinnou čárkou), které ukládají hodnoty s <emphasis>pevným kvantováním</emphasis>. V závislosti na tom, kde je určena nulová čára, musí se rozlišovat mezi celočíselnými formáty <emphasis>jsoucí bez znaménka</emphasis> (pouze kladné hodnoty), "nulová čára" je v polovině číselného rozsahu), a <emphasis>se znaménkem</emphasis> (kladné a záporné hodnoty)
de: Samples können in verschiedenen Formaten und Genauigkeiten gespeichert werden. Die häufigsten sind Integer- (Festkomma-) Formate, die Werte in <emphasis>festen</emphasis> Quantisierungsstufen speichern. Abhängig davon wo die 'Null-Linie' festgelegt wird, muss man zwischen <emphasis>vorzeichenlosen</emphasis> (nur positive Werte, "Null-Linie" in der Mitte des Zahlenbereichs) und <emphasis>vorzeichenbehafteten</emphasis> (positive und negative Werte) Festkommaformaten unterscheiden.
es: Las muestras pueden ser almacenadas en diferentes formatos y precisiones. Los más comunes son en formatos enteros (coma fija), los cuales almacenan valores con <emphasis>cuantificación fija</emphasis>. Dependiendo de dónde se defina la línea cero se tiene que distinguir entre formatos enteros <emphasis>sin signo</emphasis> (solo valores positivos, la "línea cero" se encuentra en la mitad del rango numérico) y <emphasis>con signo</emphasis> (valores positivos y negativos).
fr: Les échantillons peuvent être stockés avec différents formats et différentes précisions. Le format le plus utilisé est le nombre entier qui stocke les valeurs avec des <emphasis>valeurs fixes de numérisation</emphasis>. Comme cela dépend de la position de la valeur zéro du signal, on distingue un format dit <emphasis>non signé</emphasis> (pour les valeurs strictement positives) et un format dit <emphasis>signé</emphasis> (pour les valeurs positives et négatives).

source: <phrase>Signed Format</phrase>
cs: <phrase>Formát se znaménkem</phrase>
de: <phrase>Vorzeichenbehaftetes Format</phrase>
es: <phrase>Formato con signo</phrase>
fr: <phrase>Le format signé</phrase>

source: <para>Signed Format</para>
cs: <para>Formát se znaménkem</para>
de: <para>Vorzeichenbehaftetes Format</para>
es: <para>Formato con signo</para>

source: <phrase>Unsigned Format</phrase>
cs: <phrase>Formát bez znaménka</phrase>
de: <phrase>Vorzeichenloses Format</phrase>
es: <phrase>Formato sin signo</phrase>
fr: <phrase>Le format non signé</phrase>
