Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: A text command (including parameters) or a command list that will be executed when the menu entry gets activated. If a menu entry does not have a corresponding command (for example if it is a sub menu and not menu entry), you should use the special command <command>ignore()</command>.
de: Ein Befehl (inklusive Parameter) oder eine Befehlsliste die ausgeführt wird wenn der Menüeintrag aktiviert wird. Wenn der Menüeintrag keinen zugehörigen Befehl besitzt (beispielsweise bei wenn es sich um ein Untermenü handelt und nicht um einen Menüeintrag), verwenden Sie bitte den speziellen Befehl <command>ignore()</command>.

source: <parameter>path</parameter>:
de: <parameter>Pfad</parameter>:

source: The path within the menu, using a <quote><token>/</token></quote> as separator. The last part of the path can be a <emphasis>sub command</emphasis> which modifies some property of the menu entry (see <link linkend="menu_sub_commands">below</link>). The last portion of the path (that is not a sub command) produces a menu entry, the parts before produce the main menu entry or sub menus that lead to it. Main menu entries or sub menus are automatically created when a menu entry is created, you do not need them manually.
de: Der Pfad innerhalb des Menüs, mit einem <quote><token>/</token></quote> als Trennzeichen. Der letzte Teil des Pfads kann ein <emphasis>Unterbefehl</emphasis> sein, der eine Eigenschaft des Eintrags verändern kann (siehe<link linkend="menu_sub_commands">unten</link>). Der letzte Teil des Pfads (der kein Unterbefehl ist) erzeugt einen Menüeintrag, die Teile davor erzeugen den Eintrag des Hauptmenüs bzw. die Untermenüs die zu dem Menüeintrag führen. Einträge im Hauptmenü und Untermenüs werden automatisch bei Bedarf erzeugt, Sie müssen diese nicht manuell anlegen.

source: <parameter>hotkey</parameter>:
de: <parameter>Tastenkürzel</parameter>:

source: A bitmask that consists of a combination of predefined <emphasis>keys</emphasis> and <emphasis>modifiers</emphasis>, concatenated with a <quote><token>+</token></quote>. The <emphasis>key</emphasis> can be either a digit, an upper case letter, a function key (<quote>F1</quote> ... <quote>F12</quote>) or any other key name understood by the Qt class <quote><literal>QKeySequence</literal></quote>,including key names for predefined actions (like for example <quote><literal>::Copy</literal></quote>). Typical <emphasis>modifiers</emphasis> are <quote><literal>SHIFT</literal></quote>, <quote><literal>ALT</literal></quote> and <quote><literal>CTRL</literal></quote>.
de: Eine Bitmaske die aus einer Kombination vordefinierter <emphasis>Tasten</emphasis> und <emphasis>Modifikatoren</emphasis> besteht, zusammengefügt mit einem <quote><token>+</token></quote>-Zeichen. Die <emphasis>Tasten</emphasis> können entweder eine Ziffer, ein Großbuchstabe, eine Funktionstaste (<quote>F1</quote> ... <quote>F12</quote>) oder ein anderer Tastenname sein der von der Qt-Klasse <quote><literal>QKeySequence</literal></quote> verstanden wird, inklusive Tastenkürzel für vordefinierte Aktionen (wie zum Beispiel <quote><literal>::Copy</literal></quote>). Typische <emphasis>Modifizierer</emphasis> sind <quote><literal>SHIFT</literal></quote>, <quote><literal>ALT</literal></quote> und <quote><literal>CTRL</literal></quote>.

source: A unique id that can be internally used to identify this menu entry or menu / sub menu. Only uppercase letters, digits and <quote><literal>_</literal></quote> should be used and it should start with <quote><literal>ID_</literal></quote>. It is in your own responsibility to make sure that the same id is not used twice.
de: Eine eindeutige ID kann intern verwendet werden um dieses Menü oder diesen Menüeintrag zu identifizieren. Nur Großbuchstaben, Ziffern und <quote><literal>_</literal></quote> sollten verwendet werden und sie sollte mit <quote><literal>ID_</literal></quote> beginnen. Es liegt in Ihrer Verantwortung dafür zu sorgen dass die gleiche ID nicht nochmals verwendet wird.

source: Sub Commands
de: Unterbefehle

source: Makes a menu entry <emphasis>checkable</emphasis>, so that it can be switched on or off.
de: Macht einen Menüeintrag <emphasis>auswählbar</emphasis>, so dass er ein- und ausgeschaltet werden kann.

source: Lets the menu entry or menu/sub menu be <emphasis>disabled</emphasis>.
de: <emphasis>Deaktiviert</emphasis> ein Menü oder einen Menüeintrag.

source: Makes a menu entry or menu/sub menu that has been previously disabled <emphasis>enabled</emphasis> again.
de: <emphasis>Aktiviert</emphasis> ein Menü oder einen Menüeintrag der vorher deaktiviert wurde.

source: <command>#exclusive</command>(<replaceable>group</replaceable>):
de: <command>#exclusive</command>(<replaceable>Gruppe</replaceable>):

source: Makes a menu entry be part of an <emphasis>exclusive</emphasis> <emphasis><replaceable>group</replaceable></emphasis> (one of many selection). The group that is given as parameter should not be used for any other purpose. Only one entry within that group can be selected at a time.
de: Lässt einen Menüeintrag Teil einer <emphasis>exklusiven</emphasis> <emphasis><replaceable>Gruppe</replaceable></emphasis> werden (ein Eintrag aus vielen). Die übergebene Gruppe sollte für keinen anderen Zweck verwendet werden. Nur ein Eintrag in dieser Gruppe kann zu einem Zeitpunkt ausgewählt sein.

source: <command>#group</command>(<replaceable>list</replaceable>):
de: <command>#group</command>(<replaceable>Liste</replaceable>):

source: Adds the menu entry or menu/sub menu to one or more a <emphasis>groups</emphasis>, so that the application can enable/disable a bunch of menu entries without need to know all their unique ids. Multiple groups can be passed as a list with a <quote><literal>,</literal></quote> as separator. Group names have to start with a <quote><literal>@</literal></quote>. The following groups predefined:
de: Fügt einen Menüeintrag oder Menü/Untermenü zu einer oder mehreren <emphasis>Gruppen</emphasis> hinzu, so dass die Applikation einige Menüeinträge auf einmal aktivieren/deaktivieren kann ohne die IDs der einzelnen Einträge wissen zu müssen. Mehrere Gruppen können als eine per <quote><literal>,</literal></quote> getrennte Liste übergeben werden.Gruppen-Namen müssen mit einem <quote><literal>@</literal></quote> beginnen. Die folgenden Gruppen sind vordefiniert:

source: Only enabled when the clipboard is not empty.
de: Nur aktiviert wenn die Zwischenablage nicht leer ist.

source: Only enabled when the current signal contains at least one label.
de: Nur aktiviert wenn das aktuelle Signal mindestens einen Marker enthält.

source: Enabled when the current signal is not closed (the signal might be empty or zero length).
de: Aktiviert wenn das aktuelle Signal nicht geschlossen ist (es darf jedoch leer sein oder die Länge Null haben).

source: Enabled when the selection is not empty (more than one sample is selected).
de: Aktiviert wenn die Auswahl nicht leer ist (mehr als ein Sample ist ausgewählt).

source: Enabled when there is some signal loaded and it is not empty or zero length.
de: Aktiviert wenn ein Signal vorhanden ist und nicht die Länge Null hat.

source: <emphasis>Hides</emphasis> the menu entry or menu/sub menu.
de: <emphasis>Versteckt</emphasis> ein Menü/Untermenü oder einen Menüeintrag.

source: Assigns an <emphasis>icon</emphasis> to a menu entry. The icon <emphasis><replaceable>name</replaceable></emphasis> should correspond to an icon file (without path and file extension) that is installed with KDE or with &kwave;.
de: Weist einem Menüeintrag ein <emphasis>Icon</emphasis> zu. Der <emphasis><replaceable>Name</replaceable></emphasis> des Icons sollte einer Datei (ohne Pfad und ohne Dateierweiterung) entsprechen die mit KDE oder &kwave; installiert wurde.

source: <command>#listmenu</command>(<replaceable>id</replaceable>,<replaceable>command</replaceable>):
de: <command>#listmenu</command>(<replaceable>ID</replaceable>,<replaceable>Befehl</replaceable>):

source: Inserts a placeholder for a list of menu entries into a sub menu. The unique <emphasis><replaceable>id</replaceable></emphasis> specified in this sub command is used to add/remove or clear the list of menu entries. The <emphasis><replaceable>command</replaceable></emphasis> parameter has to contain <quote><literal>%1</literal></quote> as parameter, which will be replaced with the text of the menu entry when it is activated. (This sub command is internally used for the list of recent files, list of tracks and window list).
de: Fügt einen Platzhalter für eine Liste von Menüeinträgen in einem Untermenü hinzu. Die eindeutige <emphasis><replaceable>ID</replaceable></emphasis> die in diesem Unterbefehl angegeben wird, wird verwendet um Menüeinträge zur Liste hinzuzufügen, zu entfernen oder die Liste komplett zu leeren. Der Parameter mit dem <emphasis><replaceable>Befehl</replaceable></emphasis> muss ein <quote><literal>%1</literal></quote> als Parameter enthalten, dieser wird durch den Text des jeweiligen Menüeintrags ersetzt wenn der Eintrag aktiviert wurde. (Dieser Unterbefehl wird intern verwendet für die Liste der zuletzt geöffneten Dateien, Liste der Spuren und die Fensterliste).

source: Inserts a separator into a sub menu.
de: Fügt eine Trennlinie in einem Untermenü hinzu.

source: Shows a message box with some <emphasis><replaceable>text</replaceable></emphasis> and the two buttons <quote><guibutton>OK</guibutton></quote> (returns without error code) and <quote><guibutton>Cancel</guibutton></quote> (returns and error code). You can use this command to give the user a possibility to abort a running script.
de: Zeigt ein Nachrichten-Fenster mit einem <emphasis><replaceable>Text</replaceable></emphasis> und den beiden Schaltflächen <quote><guibutton>OK</guibutton></quote> (kehrt ohne Fehlercode zurück) und <quote><guibutton>Abbrechen</guibutton></quote> (liefert einen Fehlercode).Sie können diesen Befehl verwenden um dem Anwender eine Möglichkeit zu bieten um ein laufendes Skript abzubrechen.

source: A message that will be shown in the message box, should contain a question that can be answered with <quote>OK</quote> or <quote>Cancel</quote>
de: Eine Nachricht die im Nachrichten-Fenster angezeigt wird, sollte eine Frage enthalten die mit <quote>OK</quote> oder <quote>Abbrechen</quote> beantwortet werden kann.

source: &i18n-cmd_syntax;<command>&no-i18n-cmd_newsignal;</command>( <replaceable>samples</replaceable>, <replaceable>rate</replaceable>, <replaceable>bits</replaceable>, <replaceable>tracks</replaceable>)
de: &i18n-cmd_syntax;<command>&no-i18n-cmd_newsignal;</command>( <replaceable>Samples</replaceable>, <replaceable>Abtastrate</replaceable>, <replaceable>Bits</replaceable>, <replaceable>Spuren</replaceable>)

source: Creates a new signal, with a given length in <emphasis><replaceable>samples</replaceable></emphasis>, a <emphasis><replaceable>rate</replaceable></emphasis> in samples per second (floating point number), a number of <emphasis><replaceable>bits</replaceable></emphasis> per sample and number of <emphasis><replaceable>tracks</replaceable></emphasis>. You can calculate the length in samples by multiplying the desired length in seconds with the sample rate.
de: Erzeugt ein neues Signal, mit der angegebenen Länge in <emphasis><replaceable>Samples</replaceable></emphasis>, einer <emphasis><replaceable>Abtastrate</replaceable></emphasis> in Samples pro Sekunde (Fließkommazahl), einer Anzahl von <emphasis><replaceable>Bits</replaceable></emphasis> pro Sample und Anzahl von <emphasis><replaceable>Spuren</replaceable></emphasis>. Sie können die Länge in Samples berechnen indem Sie die gewünschte Länge in Sekunden mit der Abtastrate multiplizieren.

source: Length of the signal in samples.
de: Länge des Signal in Samples.

source: <parameter>rate</parameter>:
de: <parameter>Abtastrate</parameter>:

source: Sample rate in samples per second.
de: Abtastrate in Samples pro Sekunde.

source: Number of bits per sample, must not be zero, should be a number from 8...32.
de: Anzahl der Bits pro Sample, darf nicht Null sein, sollte eine Zahl zwischen 8 und 32 sein.

source: <parameter>tracks</parameter>:
de: <parameter>Spuren</parameter>:

source: Number of tracks.
de: Anzahl der Spuren.

source: Corresponds to to the <guibutton>Next</guibutton> toolbar button. If the playback is currently running, it skips forward to the next label. If the playback is not running, this does the same as the command <command>&no-i18n-cmd_view_scroll_next_label;</command>.
de: Entspricht der Werkzeugleisten-Schaltfläche <guibutton>Nächstes</guibutton>. Wenn die Wiedergabe aktuell läuft, wird bis zum nächsten Marker vorgespult. Wenn die Wiedergabe nicht läuft, entspricht dieser Befehl dem Befehl <command>&no-i18n-cmd_view_scroll_next_label;</command>.

source: &i18n-cmd_syntax;<command>&no-i18n-cmd_open;</command>([<replaceable>filename</replaceable>])
de: &i18n-cmd_syntax;<command>&no-i18n-cmd_open;</command>(<replaceable>Dateiname</replaceable>)

source: Opens a file, which can be either a sound file or a &kwave; script. If no file name is passed, then a dialog window will be opened that allows to select an existing file. Depending on the GUI mode the file will be opened in the context of a new sub window (MDI and tab) or in a new main window (SDI, if there was already something loaded).
de: Öffnet eine &kwave;-Skript- oder Audio-Datei. Wenn kein Dateiname übergeben wurde, so wird ein Dateiauswahl-Dialog geöffnet. Je nach GUI-Modus wird die Datei in einem neuen Unterfenster (MDI oder Tab) oder in einem neuen Hauptfenster geöffnet (SDI, falls bereits eine Datei geladen ist).

source: name of a file including path and extension
de: Dateiname inklusive Pfad und Dateierweiterung

source: &i18n-cmd_syntax;<command>&no-i18n-cmd_openrecent;</command>(<replaceable>filename</replaceable>)
de: &i18n-cmd_syntax;<command>&no-i18n-cmd_openrecent;</command>(<replaceable>Dateiname</replaceable>)

source: Practically the same as the command <command>&no-i18n-cmd_open;</command>, but intended to be used internally for the list of recently opened files in the menu <menuchoice> <guimenu>File</guimenu><guimenu>Open Recent</guimenu> </menuchoice>. In this command the parameter <replaceable>filename</replaceable> is not optional.
de: Entspricht praktisch dem Befehl <command>&no-i18n-cmd_open;</command>, wird jedoch intern für die Liste der zuletzt geöffneten Dateien im Menü <menuchoice> <guimenu>Datei</guimenu><guimenu>Zuletzt geöffnete Dateien</guimenu> </menuchoice>. Der Parameter <replaceable>Dateiname</replaceable> ist in diesem Befehl nicht optional.

source: entry of the list of recently opened files
de: Eintrag der Liste der zuletzt geöffneten Dateien

source: Replaces the current selection with the content of the clipboard. If the clipboard is empty, this command does nothing. The sample rate of the inserted data is adjusted to match the sample rate of the current signal if necessary. Only enabled tracks are affected, disabled tracks remain unchanged. Please be aware that this might produce a time shift between enabled and disabled tracks! If the number of tracks of the clipboard data differs from the number of enabled tracks, then the data is mixed to be spread equally over all selected tracks.
de: Ersetzt die aktuelle Auswahl mit dem Inhalt der Zwischenablage. Wenn die Zwischenablage leer ist bewirkt diese Funktion nichts. Die Abtastrate der eingefügten Daten wird bei bedarf an die Abtastrate des aktuellen Signals angepasst. Nur aktivierte Spuren werden beeinflusst; bitte sein Sie sich bewusst dass dies eine Zeitverschiebung zwischen aktivierten und deaktivierten Spuren bewirken kann! Wenn sich die Anzahl der Spuren zwischen dem aktuellen Signal und dem Inhalt der Zwischenablage unterscheidet, werden die eingefügten Daten gleichmäßig über die aktiven Spuren gemischt.

source: Corresponds to to the <guibutton>Pause</guibutton> toolbar button and lets the playback pause if it is currently running, or continue if it is currently paused.
de: Entspricht der Werkzeugleisten-Schaltfläche <guibutton>Pause</guibutton> und lässt die Wiedergabe anhalten falls sie gerade läuft oder fortsetzen wenn sie angehalten wurde.

source: Corresponds to to the <guibutton>Start</guibutton> toolbar button and lets the playback start if it is currently paused.
de: Entspricht der Werkzeugleisten-Schaltfläche <guibutton>Start</guibutton> und lässt die Wiedergabe starten wenn sie angehalten ist.

source: Executes a plugin, with an optional list of parameters. If no parameter list is given, then the setup function of the plugin will be called, using the parameters of the previous invocation or default parameters as input (normally shows a setup dialog, depending on the plugin). Please refer to the chapter about <link linkend="plugins">plugins</link> for a description of the various plugins.
de: Führt eine Plugin aus, mit einer optionalen Liste von Parametern. Falls keine Parameterliste angegeben wurde, wird die Setup-Funktion des Plugins aufgerufen, unter Verwendung der Parameter des letzten Aufrufs oder der Default-Parameter (normalerweise wird je nach Plugin ein Setup-Dialog angezeigt). Für eine Beschreibung der diversen Plugins sei auf das Kapitel <link linkend="plugins">Plugins</link> verwiesen.

source: the (internal) name of a &kwave; plugin
de: der (interne) Name eines &kwave;-Plugins

source: a list of parameters understood by the plugin (optional)
de: eine Liste der vom Plugin unterstützten Parameter (optional)

source: Similar to the command <quote><command>&no-i18n-cmd_plugin;</command>()</quote>, but without calling the setup function of the plugin if no parameters were passed.
de: Ähnlich wie der Befehl <quote><command>&no-i18n-cmd_plugin;</command>()</quote>, führt jedoch nicht die Setup-Funktion des Plugins aus wenn keine Parameterliste übergeben wurde.

source: a list of parameters understood by the plugin
de: eine Liste von Parametern die vom Plugin unterstützt werden

source: Calls the <emphasis>setup</emphasis> function of a plugin, with an optional list of parameters. If no parameter list is given, the parameters of the previous invocation or default parameters will be used as input. This normally shows a setup dialog, depending on the plugin. Please refer to the chapter about <link linkend="plugins">plugins</link> for a description of the various plugins.
de: Ruft die <emphasis>Setup</emphasis>-Funktion eines Plugins auf, mit einer optionalen Parameterliste. Wenn keine Parameter angegeben wurden werden die Parameter des letzten Aufrufs verwendet. Normalerweise wird je nach Plugin ein Setup-Dialog angezeigt. Für eine Beschreibung der diversen Plugins sei auf das Kapitel <link linkend="plugins">Plugins</link> verwiesen.

source: Corresponds to to the <guibutton>Previous</guibutton> toolbar button. If the playback is currently running, it skips back to the previous label or start of the selection. If the playback is not running, this does the same as the command <command>&no-i18n-cmd_view_scroll_prev_label;</command>.
de: Entspricht der Werkzeugleisten-Schaltfläche <guibutton>Vorheriges</guibutton>. Wenn die Wiedergabe aktuell läuft, wird bis zum vorherigen Marker zurückgespult. Wenn die Wiedergabe nicht läuft, entspricht dieser Befehl dem Befehl <command>&no-i18n-cmd_view_scroll_prev_label;</command>.

source: Closes the current main window, including all sub windows. In SDI mode this is the same as the command <quote><command>&no-i18n-cmd_close;</command>()</quote>.
de: Schließt das aktuelle Hauptfenster, inklusive aller Unterfenster. Im SDI-Modus ist dies identisch mit dem Befehl <quote><command>&no-i18n-cmd_close;</command>()</quote>.

source: Corresponds to to the <guibutton>Redo</guibutton> toolbar button and repeats one operation that has been reverted with <command>&no-i18n-cmd_undo;</command>.
de: Entspricht der Werkzeugleisten-Schaltfläche <guibutton>Wiederherstellen</guibutton> und stellt eine Operation her die zuvor mit <command>&no-i18n-cmd_undo;</command> rückgängig gemacht wurde.

source: Similar to <command>&no-i18n-cmd_redo;</command>, but re-does as many operations as possible.
de: Ähnlich wie der Befehl <command>&no-i18n-cmd_redo;</command>, stellt jedoch so viele Operationen wir möglich wieder her.

source: Some message boxes offer the possibility to prevent them from appearing again (<quote>do not ask again</quote>). This command makes all of them appear again.
de: Einige Nachrichten-Fenster bieten die Möglichkeit zu verhindern dass sie erneut erscheinen (<quote>nicht nochmal fragen</quote>). Mit diesem Befehl kann man sie wieder freischalten.

source: Resets all toolbar settings, like location, icon size and text location back to defaults.
de: Setzt alle Werkzeugleisten-Einstellungen wie Position, Icon-Größe und Position des Beschreibungstexts wieder auf Standardeinstellungen zurück.

source: Reverts the currently loaded file back to the last saved state, discarding all changes that are not saved.
de: Setzt die aktuell geladene Datei auf den letzten gespeicherten Zustand zurück. Alle noch nicht gespeicherten Änderungen gehen verloren.

source: Corresponds to to the <guibutton>Rewind</guibutton> toolbar button. If the playback is currently running, it skips backward by 1/10 of the visible range. If the playback is not running, this does the same as the command <command>&no-i18n-cmd_view_scroll_left;</command>.
de: Entspricht der Werkzeugleisten-Schaltfläche <guibutton>Zurückspulen</guibutton>. Wenn die Wiedergabe aktuell läuft, wird um 1/10 des sichtbaren Bereichs zurückgespult. Wenn die Wiedergabe nicht läuft, entspricht dieser Befehl dem Befehl <command>&no-i18n-cmd_view_scroll_left;</command>.

source: Corresponds to to the <guibutton>Save</guibutton> toolbar button. Saves the current file if it has modifications. If the file does not already have a name (e.g. a file that has just been created and does not yet have a file name), this command does the same as <command>&no-i18n-cmd_saveas;</command>.
de: Entspricht der Werkzeugleisten-Schaltfläche <guibutton>Speichern</guibutton>. Speichert die aktuelle Datei wenn sie Veränderungen enthält. Wenn die Datei noch keinen Namen hat (z.B. wenn die Datei gerade erst erzeugt wurde und noch keinen Dateinamen hat), entspricht dieser Befehl dem Aufruf von<command>&no-i18n-cmd_saveas;</command>.

source: &i18n-cmd_syntax;<command>&no-i18n-cmd_saveas;</command>([<replaceable>filename</replaceable>])
de: &i18n-cmd_syntax;<command>&no-i18n-cmd_saveas;</command>([<replaceable>Dateiname</replaceable>])

source: Saves the currently opened file under a given file name. If no file name is given as parameter, a dialog will be shown to select the directory and to enter a file name.
de: Speichert die aktuell geöffnete Datei unter dem angegebenen Dateinamen. Wenn kein Dateiname als Parameter angegeben wurde, wird ein Dialog angezeigt um ein Verzeichnis auszuwählen und einen Dateinamen einzugeben.

source: file name for saving (optional)
de: Dateiname zum speichern (optional)

source: This command does the same as <command>&no-i18n-cmd_save;</command>, but saves only the currently selected range and the activated tracks instead of the whole file.
de: Dieser Befehl entspricht dem Befehl <command>&no-i18n-cmd_save;</command>, speichert aber nur den ausgewählten Bereich und nur die aktiven Spuren.

source: &i18n-cmd_syntax;<command>&no-i18n-cmd_select_gui_type;</command>(mode)
de: &i18n-cmd_syntax;<command>&no-i18n-cmd_select_gui_type;</command>(Modus)

source: Select a GUI mode, which can be either SDI, MDI or Tab mode. Please be aware that this changes will immediately take effect!
de: Wählt einen neuen GUI-Modus, zur Verfügung stehen SDI-, MDI- und Tab-Modus. Bitte beachten Sie dass eine Änderung sofort in Kraft tritt!
