Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: There <emphasis>must not</emphasis> be a directory named <filename>kwave</filename> under the directory you want to check out. Otherwise the cvs program will complain about already existing files and the checkout will not work.
fr: Il <emphasis>ne doit pas</emphasis> y avoir de dossier nommé <filename>kwave</filename> dans le dossier où vous aller stocker les sources en provenance du CVS. En effet si tel est le cas, le programme cvs enverra un message d'erreur indiquant qu'il existe déjà un dossier de ce nom et le téléchargement des sources sur votre machine échouera.

source: Updating sources from CVS
fr: La mise à jour les sources à partir du CVS

source: The procedure described in the previous section is only necessary once. For further updates it is much easier. Just change into the directory you want to update and do the following: <screen width="75" format="linespecific"> <prompt>% </prompt><command>make distclean</command> <prompt>% </prompt><command>cvs update -dP -C</command> </screen> Then go on to the next section and compile as usual.
fr: La procédure décrite précédemment est seulement nécessaire la première fois. L'opération est plus simple et plus rapide lorsqu'on fait une mise à jour. Mettez vous dans le sous-dossier que vous souhaitez mettre à jour et tapez les commandes suivantes : <screen width="75" format="linespecific"> <prompt>% </prompt><command>make distclean</command> <prompt>% </prompt><command>cvs update -dP -C</command> </screen> Vous pouvez alors passer à la section suivante pour faire une compilation du programme.

source: If you think that you have messed up your local source or if there are conflicts during updating, you can remove all files and directories from your &kapp; source directory, <emphasis>except the <filename>CVS</filename> directory </emphasis>and then try again.
fr: Si vous pensez que vous avez endommagé vos fichiers sources en local ou s'il y a des conflits pendant la mise à jour, vous pouvez enlever tous les fichiers et les sous-dossiers dans votre copie locale de &kapp; <emphasis>à l'exception des dossiers <filename>CVS</filename></emphasis> et recommencer à nouveau.

source: Building rpm package from a CVS snapshot is quite simple. The procedure is nearly the same as described in the last section, so it unhappily also has the same problem with the <command>rpmbuild -ta</command> command our method internally uses. Like in the previous chapter, <replaceable>[arch]</replaceable> stands for the platform you have Built the package and might be something like <literal>i386</literal>, <literal>i586</literal>, <literal>sparc</literal> or whatever, <replaceable>XXX</replaceable> stands for the version number you have checked out.
fr: Construire un paquetage RPM à partir des sources du CVS est une chose assez facile à réaliser. La procédure est presque la même que celle décrite dans la section précédente, et malheureusement on a le même problème avec la commande <command>rpmbuild -ta</command>. Comme dans le chapitre précédent, l'option <replaceable>[arch]</replaceable> permet d'indiquer le type de plate-forme pour laquelle vous allez construire le paquetage. Les valeurs possibles peuvent être <literal>i386</literal>, <literal>i586</literal>, <literal>sparc</literal>, etc., et l'option <replaceable>XXX</replaceable> indiquera le numéro de version de l'application.

source: Assuming that you are in the root of where you checked out from CVS, do the following to create a Makefile, the &kapp; package and install it. If you already have a version of &kapp; installed, please remove it first or use <command>rpm -U</command> instead of <command>rpm -i</command> for updating instead of installing.
fr: Vous devez être le superutilisateur ROOT pour faire la mise à jour à partir du CVS, construire le paquetage de &kapp;, et l'installer. Si vous avez déjà une version de &kapp; installée sur votre système, vous devez désinstaller celle-ci en premier ou utiliser l'option <literal>rpm -U</literal> à la place de <literal>rpm -i</literal> pour faire une mise à jour automatique.

source: If you still have problems with <command>make rpm</command>, you will find the tar.gz archive that was produced in <filename>/tmp</filename>. Please follow the instructions in the <link linkend="manual_rpm_creation">previous</link> chapter.
fr: Si vous avez des problèmes avec la commande <command>make rpm</command>, vous trouverez l'archive au format « .tar.gz » qui a été construite dans le dossier <filename>« /tmp »</filename>. Vous pouvez ensuite suivre les instructions de création d'un paquetage RPM dans le <link linkend="manual_rpm_creation">précédent</link> chapitre.

source: Relocating the binary RPM packages
fr: Indiquer un emplacement d'installation pour les exécutables d'un paquetage RPM

source: The binary rpm package of &kapp; is "<emphasis>relocatable</emphasis>". That means that you can build the package on a system with any KDE3 directory and install it on an other system and/or into a different directory. This feature is very useful to install a package compiled for SuSE under a RedHat system or vice-versa.
fr: Les exécutables d'un paquetage RPM de &kapp; sont « <emphasis>relogeables</emphasis> ». Vous pouvez construire un paquetage RPM sur un système équipé des dossiers de KDE3 et installer les exécutables dans un dossier différent sur un autre système. Cette caractéristique est très pratique pour installer un paquetage compilé sur une distribution SUSE vers une distribution RedHat ou vice-versa.

source: For example: you got the binary rpm from a friend who has a RedHat system (where the KDE3 directory is <filename>/usr</filename>) and want to install it on a SuSE system (where the KDE3 directory is <filename>/opt/kde3</filename>). Then just give a different prefix when installing the rpm. Example:
fr: Par exemple : vous prenez le paquetage RPM des exécutables d'un ami qui a une distribution RedHat (où le dossier de KDE3 est <filename>/usr</filename>) et vous souhaitez l'installer sur une distribution SuSE (où le dossier de KDE3 est <filename>/opt/kde3</filename>). Vous avez juste à passer un paramètre différent quand vous installez le paquetage : Par exemple :

source: This modifies the path where the program is installed and it is strongly recommended that this is a directory that is contained in the <symbol>KDEDIRS</symbol> environment variable, or the directory that the shell command <command>kde-config --prefix</command> returns. Otherwise &kapp; would be unable to find it's menu configuration, plugins, preset files and so on...
fr: Cela modifie le chemin où le programme sera installé. Il est grandement recommandé que ce répertoire ou le dossier renvoyé par la commande <command>kde-config --prefix</command> soit contenu dans la variable d'environnement <symbol>KDEDIRS</symbol>. Dans le cas contraire, &kapp; ne pourra pas trouver la configuration des menus, les modules externes, les valeurs par défaut, etc.

source: If you are owner of a Pentium, an AMD K6, Athlon or Athlon-XP CPU, you might want to use compiler optimizations to compile your version of &kapp; that is running some percents faster. The gain in speed will be up to 30% on some systems, whereas the functions dealing with signal manipulation and all functions that do complex time-frequency operations (like FFT and Sonagram) will profit most from it.
fr: Si vous êtes propriétaire d'un processeur Pentium, ou d'un AMD K6 / Athlon / Athlon-XP, vous désirez peut être utiliser les optimisations de compilation pour gagner de la vitesse pendant l'exécution de &kapp;. Le gain obtenu est d'environ 30% avec ces processeurs, quand les fonctions de manipulation de signaux et les fonctions de calculs complexes sur les tableaux de fréquences (comme les Transformées de Fourrier ou le Sonogramme) sont activées.

source: You do not need to understand much about programming for using an optimized compiler to compile &kapp;, but maybe you will need some time to get the compiler itself working and installed.
fr: Vous ne devez pas connaître les fondements de la programmation pour utiliser et optimiser la compilation de &kapp;, mais peut-être quelques principes vous serons utiles pour installer le compilateur et l'utiliser.

source: You can easily compile the RPM package optimized for Athlon, Athlon-XP, Pentium and Pentium Pro (ond some other CPUs) by using some defines in your rpmrc file. You can either modify your system's <filename>rpmrc</filename> file in <filename>/usr/lib/rpm</filename> or the <filename>.rpmrc</filename> file in your home directory. There you can specify option lines like these: <screen width="40" format="linespecific"> <prompt moreinfo="none">% </prompt><userinput moreinfo="none">optflags: i586 -O2 -march=pentium -DNDEBUG -fomit-frame-pointer</userinput> <prompt moreinfo="none">% </prompt><userinput moreinfo="none">optflags: i686 -O2 -march=pentiumpro -DNDEBUG -fomit-frame-pointer</userinput> <prompt moreinfo="none">% </prompt><userinput moreinfo="none">optflags: athlon -O2 -march=athlon</userinput> <prompt moreinfo="none">% </prompt><userinput moreinfo="none">optflags: k6 -O3 -march=k6 -mcpu=k6 -DNDEBUG -fomit-frame-pointer</userinput> <prompt moreinfo="none">% </prompt><userinput moreinfo="none">optflags: k7 -O3 -march=athlon-xp -mcpu=athlon-xp -DNDEBUG -fomit-frame-pointer</userinput> </screen> (I found those nice tricks at <ulink url="http://www.keywarrior.net/duesti/rpmopt.de.html"> http://www.keywarrior.net/duesti/rpmopt.en.html</ulink>. Thanks to Matthias Düsterhöft!).
fr: Oui, vous pouvez compiler les paquetages RPM avec les optimisations pour un processeur Pentium ou Pentium pro (ou d'autres processeurs) en utilisant quelques définitions dans votre fichier « rpmrc ». Vous pouvez modifier soit votre fichier système « /etc/rpmrc » ou le fichier « .rpmrc » dans votre dossier personnel. Vous allez y spécifier les options en ligne de commande comme suit : <screen width="40" format="linespecific"> <prompt moreinfo="none">% </prompt><userinput moreinfo="none">optflags: i586 -O2 -march=pentium -DNDEBUG -fomit-frame-pointer</userinput> <prompt moreinfo="none">% </prompt><userinput moreinfo="none">optflags: i686 -O2 -march=pentiumpro -DNDEBUG -fomit-frame-pointer</userinput> <prompt moreinfo="none">% </prompt><userinput moreinfo="none">optflags: athlon -O2 -march=athlon</userinput> <prompt moreinfo="none">% </prompt><userinput moreinfo="none">optflags: k6 -O3 -march=k6 -mcpu=k6 -DNDEBUG -fomit-frame-pointer</userinput> <prompt moreinfo="none">% </prompt><userinput moreinfo="none">optflags: k7 -O3 -march=athlon-xp -mcpu=athlon-xp -DNDEBUG -fomit-frame-pointer</userinput> </screen> (J'ai trouvé ces options sur <ulink url="http://www.keywarrior.net/duesti/rpmopt.de.html"> http://www.keywarrior.net/duesti/rpmopt.en.html</ulink>. Remerciements à Matthias Düsterhöft !).

source: This means that on an <literal>k7</literal> architecture the rpm package will be compiled using <literal>-O3 -march=athlon-xp -mcpu=athlon-xp -DNDEBUG -fomit-frame-pointer</literal> as compiler option and so on, you might extend or adapt these to your own needs. The settings apply to all of the sections before in all places where <command>rpmbuild -ta</command> is used or where a binary RPM is to be created out of a source rpm using <command>rpmbuild --rebuild</command>.
fr: Cela permet de compiler les paquetages RPM pour une architecture K7 en utilisant <literal>-O3 -march=athlon-xp -mcpu=athlon-xp -DNDEBUG -fomit-frame-pointer</literal> comme option de compilation. Vous pouvez ajouter ou adapter ces options selon vos besoins. Le paramétrage s'applique à l'ensemble des opérations décrites à la section précédente à chaque fois que l'on utilise la commande « rpm -ta », ou quand un paquetage RPM d'exécutable est construit à partir d'un paquetage source en utilisant la commande « rpmbuild --rebuild ».

source: The options specified here are set into the environment variable RPM_OPT_FLAGS during compilation, so if you don't have an rpm based environment and have to compile like described in the chapter <link linkend="manual_compilation">Manual compilation</link>, you can set this variable manually and get the same effect. For example:
fr: Les options spécifiées ici sont activées dans la variable d'environnement « RPM_OPT_FLAGS » pendant la phase de compilation. Si vous n'avez pas un environnement basé sur le programme « rpm » et que vous avez compilé l'application comme décrit dans le chapitre traitant de la <link linkend="manual_compilation">compilation manuelle</link>, vous pouvez activer cette variable manuellement et obtenir le même effet. Par exemple :

source: How to pass optimizer options to the compiler
fr: Comment passer des options de compilation au compilateur

source: The invocation of the compiler is quite simple. It normally is sufficient to set the environment variable <symbol>RPM_OPT_FLAGS</symbol> in the correct way and then compile as usual. For the best settings please consult the documentation or homepage of the corresponding compiler.
fr: L'invocation des optimisations d'un compilateur sont simples. Normalement, il suffit d'activer correctement la variable d'environnement <symbol>RPM_OPT_FLAGS</symbol> avec les bons paramètres et de lancer la compilation. Cependant, pour un meilleur paramétrage, il est préférable de consulter la documentation ou le site internet de votre compilateur.

source: If you build &kapp; from a source tree (unpacked tar.gz or from CVS) the flags need to be specidied before the call to <command>make -f Makefile.dist</command>. This might look like this:
fr: Si vous construisez &kapp; à partir des sources (tel qu'une archive au format « .tar.gz » ou via le dépot CVS) l'option à activer doit l'être avant l'appel de la commande <command>make -f Makefile.dist</command>. Par exemple :

source: If you re-build &kapp; from a source rpm package, please follow the instruction in the <link linkend="rpm_optimizations">previous section</link>.
fr: Si vous recompilez &kapp; à partir d'un paquetage RPM contenant les fichiers sources, veuillez suivre les instructions dans la <link linkend="rpm_optimizations">section précédente</link>.

source: This chapter should give a short introduction about the basics of digital audio processing, without going too much into details. Of course this might be a bit incomplete, but if you have questions, you can ask at the &kapp; mailing list or consult some further literature.
fr: Ce chapitre présente une courte introduction sur les rudiments des enregistrements audio, sans rentrer trop dans les détails. Bien sûr, cela peut être incomplet, mais si vous avez des questions, vous pouvez les poser dans la liste de diffusion de &kapp; ou consulter diverses autres littératures sur le sujet.

source: The sample rate limts the highest frequency a digitized signal can represent. Due to Shannon's theoreme the highest usable frequency is half of the sample rate, so with 44.1 kHz sample rate you cannot sample signals with more than 22 kHz. To avoid a violation of that half-sample rate rule, your soundcard already has built-in filters that filter away frequencies that are higher than half of the used sample rate.
cs: Vzorkovací kmitočet omezuje nejvyšší kmitočet, který může představovat signál převedený do číslicové podoby (zdigitalizovaný). Podle Shannonovy poučky je nejvyšší použitelný kmitočet polovinou vzorkovacího kmitočtu, takže se vzorkovacím kmitočtem 44.1 kHz nemůžete vzorkovat signály s více než 22 kHz. Aby se předešlo porušení pravidla o polovině vzorkovacího kmitočtu má již vaše zvuková karta zabudovány filtry, které odfiltrují kmitočty, které jsou vyšší než polovina používaného vzorkovacího kmitočtu.
es: La frecuencia de muestreo limita la frecuencia más alta que una señal digitalizada puede representar. Debido al teorema de Shannon la frecuencia más alta que puede utilizarse es la mitad de la frecuencia de muestreo, así que con una frecuencia de muestreo 44,1 KHz no puede muestrear señales de más de 22 kHz. Para evitar una violación de la regla de la mitad de la frecuencia de muestreo su tarjeta de sonido dispone de filtros integrados que filtran las frecuencias que son más altas que la mitad de la frecuencia de muestreo utilizada.
fr: Le taux d'échantillonnage limite les hautes fréquences d'un signal numérisé. Comme le démontre le théorème de Shannon, la fréquence la plus haute utilisable est égale à la moitié de la fréquence d'échantillonnage. Par exemple, pour une fréquence d'échantillonnage de 44.1 kHz, on ne peut pas avoir un signal utile dont la fréquence est supérieure à 22 kHz. Pour éviter tous problèmes avec cette contrainte, votre carte son dispose d'un filtre en interne qui élimine les fréquences correspondantes aux limites définies précédemment.

source: As the quantisation looses some accuracy, it produces noise, the so-called <emphasis>quantisation noise</emphasis>. That kind of noise has more effect on low amplitudes, so this method of storing samples is not optimal, but quite easy and very fast to handle (computers are fast in calculating with fixed point numbers).
fr: En plus que la numérisation du signal fait perdre de la précision, il y a génération d'un bruit parasite, que l'on appel <emphasis>bruit de numérisation</emphasis>. La partie la plus importante de ce bruit a une influence sur les basses amplitudes. Cette méthode de stockage des échantillons n'est pas optimale mais elle est facile et rapide à mettre en oeuvre (un ordinateur est très rapide pour les calculs sur les nombres entiers).

source: The second way of encoding samples is with <emphasis>floating point</emphasis> numbers. With floating point numbers, noise is spread nearly equal over all ranges of amplitudes and has advantages especially on low ampliudes. However, this format is much slower when used for processing (computers are much slower on calculating with floating point values in comparison to fixed point numbers).
cs: Druhým způsobem je zakódování vzorků s čísly v <emphasis>pohyblivé desetinné čárce</emphasis>. S čísly v pohyblivé desetinné čárce je šum rozprostřen téměř rovnoměrně po všech rozsazích rozkmitů a výhodně obzvláště u nízkých rozkmitů. Avšak tento formát je mnohem pomalejší, je-li použit při zpracovávání (počítače jsou mnohem pomalejší při výpočtech s hodnotami s pohyblivou desetinnou čárkou, srovnáme-li je s výpočty s čísly s pevnou desetinnou čárkou).
es: La segunda manera de codificar muestras es con números de <emphasis>coma flotante</emphasis>. Con números de coma flotante el ruido es casi propagado de igual manera en todas los rangos de amplitud y tiene ventajas especialmente en bajas amplitudes. Sin embargo, este formato es mucho más lento de procesar (los ordenadores son mucho más lentos con calculos con valores de coma flotante que con valores de coma fija).
fr: La seconde méthode pour encoder des échantillons est l'utilisation de nombres à <emphasis>virgule flottante</emphasis>. Avec cette méthode, le bruit est moins influent sur les signaux de faibles amplitudes. Cependant, dans ce format les calculs sont plus lents à s'exécuter (les ordinateurs traitent les chiffres à virgule plus lentement que les nombres entiers).

source: &kapp; internally uses <emphasis>signed integer</emphasis> format with 24 bit precision, stored in 32 bit integers. This has the disadvantage of higher memory consumption when processing files with lower precision (e.g. 8 bits), but processing 32 bit numbers is very fast and also leaves some reserves for internal calculations, as only 24 bits are normally used.
fr: &kapp; utilise en interne <emphasis>des entiers signés</emphasis> avec une précision de 24 bits, stockés dans des entiers de 32 bits. Ceci a l'inconvénient d'utiliser plus de mémoire lors du traitement des fichiers ayant une définition plus basse (tel que 8 bits), mais les calculs sur des nombres codés sur 32 bits sont beaucoup plus rapides et prennent moins de ressource système qu'avec des entiers codés directement sur 24 bits.

source: Using &kapp;
fr: Utilisation de &kapp;

source: Here is a little screenshot of the &kapp; main window, so that you get an impression what &kapp; looks like...
fr: Voici une petite capture d'écran de la fenêtre principale de &kapp;, qui vous donnera une première impression sur le programme...

source: Here's a screenshot of &kapp;
fr: Une capture d'écran de &kapp;

source: If you start &kapp; from the command line, you can specify a list of files that should be opened. The first specified file will be opened first, then the other files. Each file will be opened in an own new window of the same &kapp; instance. If you specify wildcards, you can open a large number of files at once.
fr: Si vous lancez &kapp; à partir de la ligne de commande, vous pouvez spécifier une liste de fichiers à ouvrir. Le premier fichier spécifié sera ouvert en premier, puis le second, etc. Chaque fichier sera ouvert dans une fenêtre séparée mais à partir de la même instance de &kapp;. Vous pouvez ainsi ouvrir un nombre important de fichiers sonores en même temps.

source: For example, the following command starts a &kapp; and opens all sounds of the KDE window manager, each in a new window:
fr: Par exemple, la ligne de commande suivante lance une instance de &kapp; et ouvre dans des fenêtres séparées, tous les fichiers sonores utilisés en internes par KDE :

source: In addition to a list of files, you can specify a list of <emphasis>Xt toolkit</emphasis> options like <literal>-geometry</literal> for specifying the size and/or position of the first opened &kapp; window and or <literal>-display</literal> for starting the &kapp; on a different display.
fr: En plus d'une liste de fichiers, vous pouvez spécifier une liste de d'options du <emphasis>serveur X</emphasis> comme <literal>-geometry</literal> pour spécifier la taille et/ou la position de la première fenêtre ouverte de &kapp; ou comme <literal>-display</literal> pour lancer &kapp; sur une instance du serveur X différente.

source: For example, the following command starts a &kapp; window with an initial width of 600 pixels and a height of 400 pixels, with the right border positioned 30 pixels away from the right and 0 pixels away form the top of the screen.
fr: Par exemple, la ligne de commande suivante lance &kapp; avec une fenêtre d'une largeur largeur initiale de 600 pixels et une hauteur de 400 pixels, avec la bordure droite positionnée à 30 pixels du bords droit de la fenêtre et 0 pixels du haut de la fenêtre.

source: Opening files with &kapp; works like in most other applications, you can
fr: L'ouverture des fichiers avec &kapp; fonctionne comme dans toutes les autres applications de KDE. Vous pouvez :

source: specify a list of files on the <link linkend="command_line">command line</link> when starting &kapp;,
fr: Spécifier une liste de fichiers à partir de la <link linkend="command_line">ligne de commande </link> quand vous lancez &kapp;.

source: open an empty &kapp; window (for example with <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>W</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>New...</guimenuitem> </menuchoice> ) and put a file into it via <link linkend="drag_and_drop">drag and drop</link>, or you can
fr: Ouvrir une fenêtre vide de &kapp; (par exemple à partir de <menuchoice><shortcut><keycombo><keycap>Ctrl</keycap><keycap>W</keycap></keycombo> </shortcut><guimenu>Fichier</guimenu><guimenuitem>Nouveau...</guimenuitem> </menuchoice>) et mettre un fichier sonore dans l'espace de travail de cette fenêtre via le <link linkend="drag_and_drop">glisser / déposer</link>.
