Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: <para>Unsigned Format</para>
cs: <para>Formát bez znaménka</para>
de: <para>Vorzeichenloses Format</para>
es: <para>Formato sin signo</para>
fr: <para>Le format non signé</para>

source: As the quantisation loses some accuracy, it produces noise, the so-called <emphasis>quantisation noise</emphasis>. That kind of noise has more effect on low amplitudes, so this method of storing samples is not optimal, but quite easy and very fast to handle (computers are fast in calculating with fixed point numbers).
cs: Protože kvantování ztrácí určitou přesnost, vytváří šum, tzv. <emphasis>šum z kvantování</emphasis>. Tento druh šumu má větší účinek na nízké rozkmity, proto tento způsob ukládání vzorků není nejlepší, ale je docela snadný a velmi rychlý na zvládnutí (počítače jsou rychlé při výpočtech s čísly s pevnou desetinnou čárkou).
de: Da die Quantisierung des Signals einem Verlust an Genauigkeit entspricht, verursacht sie sogenanntes <emphasis>Quantisierungsrauschen</emphasis>. Diese Art des Rauschens wirkt sich besonders auf leise Passagen aus, so dass diese Speicherformat nicht optimal ist, andererseits ist es aber äusserst einfach und schnell zu handhaben (Computer sind schnell bei Berechnungen mit Festkommazahlen).
es: Ya que la cuantificación pierde algo de precisión acaba produciendo ruido, también conocido como <emphasis>ruido de cuantificación</emphasis>. Este tipo de ruido tiene más efecto en bajas frecuencias por lo que este método de almacenamiento de muestras no es optimo aunque si sencillo y muy rápido de procesar ( los ordenadores son rápidos en calculos con números de coma fija).

source: The second way of encoding samples is with <emphasis>floating point</emphasis> numbers. With floating point numbers, noise is spread nearly equal over all ranges of amplitudes and has advantages especially on low amplitudes. However, this format is much slower when used for processing (computers are much slower on calculating with floating point values in comparison to fixed point numbers).
de: Die zweite Möglichkeit besteht in der Verwendung von <emphasis>Fliesskommazahlen</emphasis>. Mit Fliesskommazahlen wird das Rauschen gleichmässig über alle Lautstärken verteilt und hat besonders bei kleinen Lautstärken grosse Vorteile. Leider ist dieses Format um einiges langsamer in der Verarbeitung (Computer sind bei Fliesskomma-Berechnungen im Vergleich zu Festkomma-Berechnungen um einiges langsamer).

source: &kwave; internally uses <emphasis>signed integer</emphasis> format with 24 bit precision, stored in 32 bit integers. This has the disadvantage of higher memory consumption when processing files with lower precision (e.g. 8 bits), but processing 32 bit numbers is very fast and also leaves some reserves for internal calculations, as only 24 bits are normally used.
cs: &kwave; vnitřně používá formát <emphasis>celého čísla se znaménkem</emphasis> s přesností 24 bitů ukládaný v 32 bitových celých číslech. Nevýhodou je větší spotřeba paměti při zpracování souborů s nižší přesností (např. 8 bitových), ale zpracování 32 bitových čísel je velmi rychlé a také ponechává určité zálohy pro vnitřní výpočty, protože obyčejně se používá pouze 24 bitů.
de: &kwave; verwendet intern ein Format mit <emphasis>vorzeichenbehafteten Festkommazahlen</emphasis> (Integer) mit 24 Bit Genauigkeit, gespeichert als 32-Bit Integer. Das hat zwar den Nachteil von hohem Speicherbedarf, besonders bei der Verarbeitung von Dateien mit geringerer Auflösung (z.B. 8 Bit), die Verarbeitung von 32-Bit Integer-Werten ist allerdings äusserst schnell und bietet noch einige Reserven, da nur 24 Bit davon genutzt werden.
es: &kwave; internamente usa <emphasis>enteros con signo</emphasis> con 24 bits de precisión almacenados en enteros de 32 bits. Esto tiene la desventaja de mayor consumo de memoria al procesar archivos de baja precisión ( esto es, 8 bits) pero procesando números de 32 bits es muy rápido, además reserva para cálculos internos por lo que lo usado normalmente suelen ser 24 bits.

source: Using &kwave;
cs: Používání &kwave;
de: &kwave; verwenden
es: Uso de &kwave;

source: Here is a little screenshot of the &kwave; main window, so that you get an impression what &kwave; looks like...
cs: Tady je malý snímek obrazovky &kwave; hlavního okna, takže získáte dojem, jak &kwave; vypadá...
de: Hier ist ein Screenshot vom &kwave; Hauptfenster, um einen Eindruck zu bekommen, wie &kwave; aussieht...
es: Aquí tiene una captura de la pantalla principal de &kwave; que le dará una primera impresión de cómo es &kwave;.

source: Here's a screenshot of &kwave;
cs: Tady je snímek obrazovky &kwave;
de: Das ist ein Screenshot von &kwave;
es: Aquí una captura de pantalla de &kwave;

source: Screenshot of the Main Window
cs: Snímek obrazovky hlavního okna
de: Screenshot des Hauptfensters
es: Captura de pantalla de la ventana principal

source: User Interface Mode
de: Modus der Benutzerschnittstelle

source: Depending on your personal preferences or use cases you can configure how &kwave; handles multiple open files. You can switch this setting on the fly through the menu <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Show Files in...</guimenuitem> </menuchoice>.
de: Sie können je nach Ihren persönlichen Vorlieben oder Anwendungsfällen einstellen wie sich &kwave; beim Öffnen mehrerer Dateien verhält. Sie können diese Einstellung jederzeit über das Untermenü <menuchoice> <guimenu>Einstellungen</guimenu><guimenuitem>Zeige Dateien in...</guimenuitem> </menuchoice> vornehmen.
es: Dependiendo de sus preferencias personales o casos de uso usted puede configurar como &kwave; maneja multiples archivos abiertos. Puede cambiar las opciones al instante a través del menú <menuchoice> <guimenu>Opciones</guimenu><guimenuitem>Mostrar archivos en...</guimenuitem> </menuchoice>.

source: The three possible settings are:
de: Die drei möglichen Einstellungen sind:
es: Las tres opciones disponibles son:

source: <guimenuitem>Separate Windows (SDI)</guimenuitem>: When using the <emphasis>Single Document Interface</emphasis> (SDI), each file will be shown in a separate main window.
de: <guimenuitem>In separaten Fenstern (SDI)</guimenuitem>: Wenn Sie das <emphasis>Single Document Interface</emphasis> (SDI), verwenden, wird jede Datei in einem separaten Fenster angezeigt.
es: <guimenuitem>Ventanas separadas (SDI)</guimenuitem>: Al usar el modo <emphasis>Single Document Interface</emphasis> (SDI), cada archivo será mostrado en una ventana independiente.

source: screenshot of &kwave; in SDI mode
de: Screenshot von &kwave; im SDI-Modus

source: Screenshot of SDI mode
de: Screenshot des SDI-Modus

source: <guimenuitem>Same Window (MDI)</guimenuitem>: When using the <emphasis>Multi Document Interface</emphasis> (MDI), there is only one &kwave; main window, but within this window you have an area which shows sub windows, which can be resized, moved, tiled, cascaded or minimized.
de: <guimenuitem>im gleichen Fenster (MDI)</guimenuitem>: Wenn Sie das <emphasis>Multi Document Interface</emphasis> (MDI), verwenden, dann gibt es nur ein einziges &kwave;-Hauptfenster das jedoch einen Bereich enthält in dem Unterfenster angezeigt werden die Sie vergrößern, verkleinern, verschieben, staffeln oder minimieren können.
es: <guimenuitem>Misma ventana (MDI)</guimenuitem>: Al usar el modo <emphasis>Multi Document Interface</emphasis> (MDI), sólo habrá una única ventana de &kwave; pero dentro de dicha ventana dispondrá de un area que mostrará subventanas, cada una de las cuales podrá ser manipulada en tamaño, posición y organizada en vista en cascada o minimizada.

source: You can select a window from the <guimenu>Windows</guimenu> menu or cycle through the sub windows with <keycombo><keysym>Ctrl</keysym><keysym>Tab</keysym></keycombo>.
de: eine Datei öffnen per Menü mit <menuchoice> <shortcut><keycombo><keycap>Strg</keycap><keycap>O</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>öffnen</guimenuitem> </menuchoice>.
es: Puede seleccionar una ventana desde el menú <guimenu>Ventanas</guimenu> o recorrerlasen ciclo a traves de la combinación de teclas <keycombo><keysym>Ctrl</keysym><keysym>Tab</keysym></keycombo>.

source: screenshot of &kwave; in MDI mode
de: Screenshot von &kwave; im MDI-Modus

source: Screenshot of MDI mode
de: Screenshot des MDI-Modus

source: <guimenuitem>Tabs</guimenuitem>: This is a variant of the MDI interface, where files are shown within separate tabs. You may know this mode from some popular internet browsers.
de: <guimenuitem>Tabs</guimenuitem>: Dies ist eine Variante des MDI-Modus, in dem Dateien in einzelnen Karteireitern dargestellt werden. Sie kennen diesen Modus wahrscheinlich von einigen gängigen Internet-Browsern.
es: <guimenuitem>Pestañas</guimenuitem>: Esta es una variante de la interfaz MDI donde los archivos son mostrados en pestañas independientes. Este modo es utilizado por ciertos navegadores de internet.

source: You can activate a tab via the <guimenu>Windows</guimenu> menu or cycle through the tabs with <keycombo><keysym>Ctrl</keysym><keysym>Tab</keysym></keycombo>.
de: Sie können einen Tab über das <guimenu>Fenster</guimenu>-Menü aktivieren oder mit der Tastenkombination <keycombo><keysym>Strg</keysym><keysym>Tab</keysym></keycombo> zwischen den Tabs wechseln.
es: Puede activar una pestaña a través del menú <guimenu>Ventanas</guimenu> orecorrerlas a traves de la combinación de teclas <keycombo><keysym>Ctrl</keysym><keysym>Tab</keysym></keycombo>.

source: screenshot of &kwave; in TAB mode
de: Screenshot von &kwave; im Tab-Modus

source: Screenshot of TAB mode
de: Screenshot des Tab-Modus

source: Memory Setup
cs: Nastavení paměti
de: Speicher-Einstellungen
es: Opciones de memoria

source: When using &kwave; for the first time, you should go to the memory setup dialog an modify the settings to be suitable for yor needs and the installed memory of your computer. You can reach it under <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Memory...</guimenuitem> </menuchoice>.
de: Wenn Sie &kwave; zum ersten mal benutzen, sollten Sie den Dialog zur Speicher-Einstellungen öffnen und die Einstellungen Ihren Bedürfnissen und dem auf Ihrem PC installierten Speicher anpassen. Sie erreichen die Einstellungen unter <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Speicher</guimenuitem></menuchoice>.

source: Here's a screenshot of &kwave;'s memory setup dialog
cs: Tady je snímek dialogu s nastavením paměti &kwave;
de: Hier ein Screenshot von &kwave;'s Speicher-Einstellungen-Dialog
es: Aquí una captura de pantalla de la ventana de opciones de memoria de &kwave;

source: Screenshot of the Memory Setup Dialog
cs: Snímek dialogu s nastavením paměti
de: Screenshot des Speichereinstellungen-Dialogs
es: Captura de pantalla de la ventana de opciones de memoria

source: &kwave; is able to use two types of memory: <emphasis>physical</emphasis> and <emphasis>virtual</emphasis> memory.
cs: &kwave; může používat dva druhy paměti: <emphasis>fyzickou</emphasis> a <emphasis>virtuální</emphasis> paměť.
de: &kwave; kann zwei verschiedene Arten von Speicher verwenden: <emphasis>physikalischer</emphasis> und <emphasis>virtueller</emphasis> Speicher.
es: &kwave; es capaz de usar dos tipos de memoria: <emphasis>física</emphasis> y <emphasis>virtual</emphasis>.

source: <emphasis>Physical memory</emphasis> is the memory (RAM) that is installed in your computer. You should limit the usage of physical memory to some reasonable size, as a rule of thumb, half of the installed memory should be ok. If you set the limit too high, Linux will take memory from other applications, which means that it swaps out memory of other programs to the harddisk (swap), which is rather slow. If you set the limit too low, you might lose some performance when working with big files, because you use less of the fast physical memory than you could.
cs: <emphasis>Fyzická paměť</emphasis> je pamětí (RAM), která je instalována ve vašem počítači. Měl byste omezit používání fyzické paměti na rozumnou velikost, přičemž podle pravidla palce by měla být polovina z instalované paměti OK. Pokud nastavíte hodnotu paměti příliš vysoko, Linux si vezme paměť od ostatních aplikací, což by znamenalo, že by hodil paměť ostatních aplikací na disk (swap), což je poněkud pomalé. Pokud naopak nastavíte omezení příliš nízko, můžete ztratit něco výkonu při práci s velkými soubory, protože používáte méně z rychlé fyzické paměti, než byste mohl.
de: <emphasis>Physikalischer Speicher</emphasis> ist der Speicher (RAM), der in Ihrem Computer installiert ist. Sie sollten die Verwendung von physikalischem Speicher auf eine sinnvolle Grösse beschränken, als Richtwert fährt man mit der Hälfte des installierten RAMs ganz gut. Wenn Sie das Limit zu hoch einstellen, wird Linux den Speicher von anderen Applikationen wegnehmen, was bedeutet dass Speicher auf die Festplatte ausgelagert (geswappt) wird, was ziemlich langsam ist. Wenn Sie das Limit zu niedrig einstellen, verlieren Sie unter Umständen Performance beim Bearbeiten grosser Dateien, weil Sie weniger physikalischen Speicher verwenden als möglich wäre.
es: <emphasis>Memoria física</emphasis> es la memoria (RAM) que está instalada en su ordenador. Debería limitar el uso de memoria física a un tamaño razonable, como regla general la mitad de la memoria instalada es suficiente. Si fija el limite a un valor muy alto Linux tomará la memoria de otras aplicaciones lo que significa que intercambiará la memoria de otros programas al disco duro (memoria swap), lo que es bastante lento. Si por el contrario fija el limite muy bajo puede perder rendimiento cuando esté trabajando con archivos de gran tamaño, pues estará usando menos memoria física - la cual es más rápida - de la que podría.

source: If you enable <emphasis>virtual memory</emphasis>, &kwave; is able to load and process files that are bigger than the amount of real installed physical memory. &kwave; does this by using temporary files in a configurable directory, which is much faster and more cooperative to other applications than using the operating system's swapping. The directory that you configure should be on your local hard disk.
cs: Pokud povolíte <emphasis>virtuální paměť</emphasis>, &kwave; může nahrávat a zpracovávat soubory, které jsou větší než je množství skutečně instalované fyzické paměti. &kwave; toto může dělat za použití dočasných souborů v nastavitelném adresáři, což je mnohem rychlejší a laskavější k dalším aplikacím, než použití odkládacího prostoru operačním systémem (swap). Adresář, který nastavíte, by se měl nacházet na vašem místním pevném disku.
de: Wenn Sie <emphasis>virtuellen Speicher</emphasis> verwenden, kann &kwave; Dateien laden und bearbeiten, die grösser sind als dies der installierte physikalische Speicher zulassen würde. &kwave; verwendet in diesem Fall temporäre Dateien in einem einstellbaren Verzeichnis, was um einiges schneller und kooperativer zu anderen Programmen ist als das Auslagern des Betriebssystems. Sie sollten für die Auslagerungsdateien ein Verzeichnis auf Ihrer lokalen Festplatte wählen.
es: Si activa la <emphasis>memoria virtual</emphasis>, &kwave; es capaz de cargar y procesar archivos que son más grandes que la cantidad de memoria física instalada. &kwave; logra esto usando archivos temporales en un directorio que puede especificar, lo cual es más rápido y más cooperativo con otras aplicaciones que usar la memoria swap del sistema operativo. El directorio que especifique debe encontrarse en su disco duro local.

source: Command Line
cs: Příkazová řádka
de: Kommandozeile
es: Línea de comandos
fr: Les options en ligne de commande

source: List of Files or Commands
de: Liste von Dateien oder Kommandos

source: If you start &kwave; from the command line, you can specify a list of files that should be opened. The first specified file will be opened first, then the other files. Each file will be opened in an own new window or sub window of the same &kwave; instance. If you specify wildcards, you can open a large number of files at once.
de: Wenn Sie &kwave; von der Kommandozeile aus starten, können Sie eine Liste von Dateien angeben, die geöffnet werden sollen. Die erste angegebene Datei wird dabei zuerst geöffnet und dann die anderen. Jede Datei wird dabei in einem neuen eigenen Fenster oder Unterfenster der selben &kwave; Instanz geöffnet. Wenn Sie Platzhalter-Zeichen verwenden, können Sie eine grosse Anzahl von Dateien auf einmal öffnen.

source: For example, the following command starts a &kwave; and opens all sounds of the KDE window manager, each in a new window or sub window:
de: So startet zum Beispiel der folgende Befehl &kwave; und öffnet alle Klangdateien des KDE-Fenstermanagers in jeweils einem eigenen Fenster oder Unterfenster:

source: It is also possible to pass &kwave; text commands, encoded as a special <abbrev>URI</abbrev><footnote><para>universal resource identifier</para></footnote>, this will be described in a <link linkend="kwave_uri">later section</link>.
de: Man kann auch Text-Befehle an &kwave; übergeben, die als spezielle Adresse (<abbrev>URI</abbrev><footnote><para>universal resource identifier</para></footnote>) kodiert sind. Diese wird in einem <link linkend="kwave_uri">folgendenAbschnitt</link> beschrieben.

source: GUI Type
de: GUI Modus

source: The parameter <literal>--gui-type=<replaceable>SDI</replaceable>|<replaceable>MDI</replaceable>|<replaceable>TAB</replaceable></literal> lets &kwave; start in one of the three possible <abbrev>GUI</abbrev> modes: <link linkend="gui_sdi"><abbrev>SDI</abbrev></link>, <link linkend="gui_mdi"><abbrev>MDI</abbrev></link> or <link linkend="gui_tab"><abbrev>TAB</abbrev></link>.
de: Der parameter <literal>--gui-type=<replaceable>SDI</replaceable>|<replaceable>MDI</replaceable>|<replaceable>TAB</replaceable></literal> lässt &kwave; in einem der drei möglichen <abbrev>GUI</abbrev>-Modi starten: <link linkend="gui_sdi"><abbrev>SDI</abbrev></link>, <link linkend="gui_mdi"><abbrev>MDI</abbrev></link> or <link linkend="gui_tab"><abbrev>TAB</abbrev></link>.

source: Xt Toolkit options
de: Xt Toolkit-Optionen

source: In addition to a list of files, you can specify a list of <emphasis>Xt toolkit</emphasis> options like <literal>-geometry</literal> for specifying the size and/or position of the first opened &kwave; window and or <literal>-display</literal> for starting the &kwave; on a different display.
cs: Dále ještě k seznamu se soubory můžete stanovit seznam <emphasis>Xt sady softwarových nástrojů</emphasis> voleb jako <literal>-uspořádání</literal> pro určení velikosti a/nebo polohy prvního otevřeného &kwave; okna a nebo <literal>-zobrazení</literal> pro spuštění &kwave; na jiné obrazovce.
de: Zusätzlich zu einer Dateiliste können Sie noch eine Liste von <emphasis>Xt toolkit</emphasis> Optionen wie <literal>-geometry</literal> angeben, um die Grösse und/oder die Position des ersten geöffneten &kwave; Fenster zu spezifizieren. Eine weitere Option ist <literal>-display</literal>, die &kwave; auf einem anderen Bildschirm startet.
es: Además de una lista de archivos, puede especificar una lista de opciones del <emphasis>toolkit Xt</emphasis> como <literal>-geometry</literal> para especificar el tamaño y/o posición de la primera ventana abierta por &kwave; o <literal>-display</literal> para arrancar &kwave; en otra pantalla.

source: For example, the following command starts a &kwave; window with an initial width of 600 pixels and a height of 400 pixels, with the right border positioned 30 pixels away from the right and 0 pixels away from the top of the screen.
de: Der folgende Befehl startet zum Beispiel ein &kwave;-Fenster mit einer Startbreite von 600 Pixeln und einer Höhe von 400 Pixeln, mit der rechten Seite 30 Pixel vom rechten Rand und 0 Pixel vom oberen Rand des Bildschirms entfernt.

source: Startup Options
de: Einstellungen zum Programmstart

source: With the option <literal>--disable-splashscreen</literal> you can disable the splash screen that comes up when starting &kwave;. This might be useful when you start &kwave; from a script.
de: Mit dem Kommandozeilen-Parameter <literal>--disable-splashscreen</literal> können Sie das Startbild das beim Starten von &kwave; erscheint deaktivieren. Dies kann nützlich sein wenn Sie &kwave; von einem Shell-Skript aus starten wollen.
es: Con la opción <literal>--disable-splashscreen</literal> puede desactivar la pantalla de inicio que aparece al iniciar &kwave;. Esto podría ser útil si inicia &kwave; desde un script.

source: The command line option <literal>--iconic</literal> lets &kwave; start up minimized (iconified). This might be useful when you want to start &kwave; without GUI interaction, e.g. when running from a script. This option also implicitly disables the splash screen!
de: Der Kommandozeilen-Parameter <literal>--iconic</literal> lässt &kwave; minimiert starten. Dies mag nützlich sein wenn Sie &kwave; ohne sichtbare Benutzeroberfläche starten wollen, beispielsweise wenn Sie &kwave; von einem Shell-Skript aus starten. Dieser Parameter deaktiviert implizit auch das Startbild!
es: La opción de línea de comandos <literal>--iconic</literal> permite a &kwave; iniciar minimizado. Esto podría ser útil cuando quiere iniciar &kwave; sin interacción gráfica, por ejemplo cuando se inicia desde un script. Esta opción también implica desactivar la pantalla de inicio.

source: By using the command line option <literal>--logfile=<replaceable>kwave.log</replaceable></literal> you can log the sequence of actions of a &kwave; session into a file. This is useful for debugging, you might be asked for such a logfile when reporting an error.
de: Mit dem Kommandozeilen-Parameter <literal>--logfile=<replaceable>kwave.log</replaceable></literal> können Sie die Abfolge der Aktionen einer &kwave;-Sessionin eine Datei speichern. Dies ist nützlich zur Fehlersuche, Sie werden möglicherweise nach einer solchen Log-Datei gefragt wenn Sie einen Fehlerbericht abgegeben haben.
es: Usando la opción de línea de comandos <literal>--logfile=<replaceable>kwave.log</replaceable></literal> puede registrar la secuencia de acciones de una sesión de &kwave; en un archivo. Esto es útil para testeo, pues se le podría pedir dicho archivo cuando reporte un error.

source: Opening and Saving files
cs: Otevírání a ukládání souborů
de: Öffnen und Speichern von Dateien
es: Abriendo y guardando archivos
fr: Ouverture et sauvegarde de fichiers

source: Opening files with &kwave; works like in most other applications, you can
cs: Otevírání souborů s &kwave; pracuje stejně jako ve většině dalších programů. Můžete
de: Das Öffnen von Dateien mit &kwave; funktioniert genauso wie in den meisten anderen Anwendungen auch, Sie können
es: Abrir archivos con &kwave; funciona como en la mayoría de aplicaciones. Usted puede

source: specify a list of files on the <link linkend="command_line">command line</link> when starting &kwave;,
cs: stanovit seznam souborů pomocí <link linkend="command_line">příkazové řádky</link>, když spouštíte program &kwave;,
de: eine Liste von Dateien auf der <link linkend="command_line">Kommandozeile</link> beim Start von &kwave; eingeben
es: especificar una lista de archivos en la <link linkend="command_line">línea de comandos</link> al iniciar &kwave;
