Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: open an empty &kwave; window (for example with <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>W</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>New...</guimenuitem> </menuchoice> ) and put a file into it via <link linkend="drag_and_drop">drag and drop</link>, or you can
cs: otevřít prázdné &kwave; okno (například s <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>W</keycap></keycombo></shortcut> <guimenu>Soubor</guimenu><guimenuitem>Nový...</guimenuitem> </menuchoice> ) a dát do toho soubor prostřednictvím akce<link linkend="drag_and_drop">"táhni a pusť"</link>, nebo můžete
de: ein leeres &kwave;-Fenster öffnen (zum Beispiel mit <menuchoice> <shortcut><keycombo><keycap>Strg</keycap><keycap>W</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Neu...</guimenuitem> </menuchoice> ) und fügen eine Datei mittels <link linkend="drag_and_drop">Drag and Drop</link> ein, oder Sie können
es: abrir una ventana vacia de &kwave; (por ejemplo con <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>N</keycap></keycombo></shortcut> <guimenu>Archivo</guimenu><guimenuitem>Nuevo...</guimenuitem> </menuchoice> ) y cargar un archivo mediante <link linkend="drag_and_drop">arrastrar y soltar</link>, o puede

source: open a file through the menu with <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>O</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Open</guimenuitem> </menuchoice>
cs: otevřít soubor přes menu s <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>O</keycap></keycombo></shortcut> <guimenu>Soubor</guimenu><guimenuitem>Otevřít</guimenuitem> </menuchoice>
de: eine Datei öffnen per Menü mit <menuchoice> <shortcut><keycombo><keycap>Strg</keycap><keycap>O</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>öffnen</guimenuitem> </menuchoice>
es: abrir un archivo a través del menu con <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>O</keycap></keycombo></shortcut> <guimenu>Archivo</guimenu><guimenuitem>Abrir</guimenuitem> </menuchoice>
fr: Ouvrir un fichier à partir du menu <menuchoice><shortcut><keycombo><keycap>Ctrl</keycap><keycap>O</keycap></keycombo></shortcut><guimenu>Fichier</guimenu><guimenuitem>Ouvrir</guimenuitem></menuchoice>.

source: or one of the last recently opened files under <menuchoice> <guimenu>File</guimenu><guimenuitem>Open Recent</guimenuitem> </menuchoice>
cs: nebo jeden z naposledy otevřených souborů přes <menuchoice> <guimenu>Soubor</guimenu><guimenuitem>Otevřít nedávný</guimenuitem> </menuchoice>
de: oder eine der zuletzt bearbeiteten Dateien auswählen unter <menuchoice> <guimenu>Datei</guimenu><guimenuitem>Zuletzt geöffnete Dateien</guimenuitem> </menuchoice>
es: o uno de los últimos archivos abiertos en <menuchoice> <guimenu>Archivo</guimenu><guimenuitem>Abrir reciente</guimenuitem> </menuchoice>
fr: Ouvrir un des fichiers récemment ouvert via le menu <menuchoice><guimenu>Fichier</guimenu><guimenuitem>Récemment ouvert(s)</guimenuitem></menuchoice>.

source: save the current file with <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>S</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Save</guimenuitem> </menuchoice>,
cs: uložit nynější soubor s <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>S</keycap></keycombo></shortcut> <guimenu>Soubor</guimenu><guimenuitem>Uložit</guimenuitem> </menuchoice>,
de: eine aktuelle Datei speichern mittels <menuchoice> <shortcut><keycombo><keycap>Strg</keycap><keycap>S</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Speichern</guimenuitem> </menuchoice>,
es: guardar su archivo actual con <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>S</keycap></keycombo></shortcut> <guimenu>Archivo</guimenu><guimenuitem>Guardar</guimenuitem> </menuchoice>,
fr: Sauvegarder le fichier courant via le menu <menuchoice><shortcut><keycombo><keycap>Ctrl</keycap><keycap>S</keycap></keycombo></shortcut><guimenu>Fichier</guimenu><guimenuitem>Enregistrer</guimenuitem></menuchoice>.

source: save under a different name with <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>Ctrl</keycap><keycap>S</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Save</guimenuitem><guimenuitem>As...</guimenuitem> </menuchoice>
cs: uložit pod jiným názvem s <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>Ctrl</keycap><keycap>S</keycap></keycombo></shortcut> <guimenu>Soubor</guimenu><guimenuitem>Uložit</guimenuitem><guimenuitem>Jako...</guimenuitem> </menuchoice>
de: unter einem anderen Namen speichern mit <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>Strg</keycap><keycap>S</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Speichern</guimenuitem><guimenuitem>Als...</guimenuitem> </menuchoice>
es: guardar con un nombre distinto con <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>Mayúsculas</keycap><keycap>S</keycap></keycombo></shortcut> <guimenu>Archivo</guimenu><guimenuitem>Guardar</guimenuitem><guimenuitem>Como...</guimenuitem> </menuchoice>

source: save all areas that are separated by markers, each one to an own file, with <menuchoice> <guimenu>File</guimenu><guimenuitem>Save</guimenuitem><guimenuitem>Blocks...</guimenuitem> </menuchoice>
cs: uložit všechny oblasti, které jsou oděleny ukazovateli, každou do jejího vlastního souboru, s <menuchoice> <guimenu>Soubor</guimenu><guimenuitem>Uložit</guimenuitem><guimenuitem>Bloky...</guimenuitem> </menuchoice>
de: alle Bereiche die durch Marker begrenzt sind in jeweils eine eigene Datei speichern, mit <menuchoice> <guimenu>Datei</guimenu><guimenuitem>Speichern</guimenuitem><guimenuitem>Blöcke...</guimenuitem> </menuchoice>
es: guardar todas las selecciones que están separadas por etiquetas, cada una en su propio archivo, con <menuchoice> <guimenu>Archivo</guimenu><guimenuitem>Guardar</guimenuitem><guimenuitem>Bloques...</guimenuitem> </menuchoice>

source: or only the current selection with <menuchoice> <guimenu>File</guimenu><guimenuitem>Save</guimenuitem><guimenuitem>Selection...</guimenuitem> </menuchoice>
cs: nebo jenom současný výběr s <menuchoice> <guimenu>Soubor</guimenu><guimenuitem>Uložit</guimenuitem><guimenuitem>Výběr...</guimenuitem> </menuchoice>
de: oder nur die aktuelle Auswahl mit <menuchoice> <guimenu>Datei</guimenu><guimenuitem>Speichern</guimenuitem><guimenuitem>Auswahl...</guimenuitem> </menuchoice>
es: o solo la selección actual con <menuchoice> <guimenu>Archivo</guimenu><guimenuitem>Guardar</guimenuitem><guimenuitem>Selección...</guimenuitem> </menuchoice>

source: Supported File formats
cs: Podporované souborové formáty
de: Unterstützte Dateiformate
es: Formatos de archivo soportados
fr: Formats de fichiers supportés

source: &kwave; supports the following file formats:
cs: &kwave; podporuje následující formáty souborů:
de: &kwave; unterstützt folgende Dateiformate:
es: &kwave; soporta los siguientes formatos:

source: The favourite file format of &kwave; is (like you can guess from the name) <filename>.wav</filename>. This format is very common to other "operating systems" and also is commonly used within the KDE environment.
cs: Oblíbeným souborovým formátem &kwave; je (jak můžete hádat z názvu KWave) <filename>.wav</filename>. Tento formát je velmi běžný u dalších "operačních systémů" a je rovněž obyčejně používán v rámci prostředí KDE.
de: Das favorisierte Dateiformat von &kwave; ist (wie man vom Namen her bereits vermuten könnte) <filename>*.wav</filename>. Dieses Format ist weit verbreitet auf anderen "Betriebssystemen", sowie auch innerhalb der KDE-Umgebung.
es: El formato preferido por &kwave; es (como puede adivinar por el nombre) <filename>.wav</filename>. Este formato es muy común en otros "sistemas operativos" y también es usado habitualmente en el entorno KDE.

source: The second format that &kwave; supports is "ASCII". You can export to and also import from ASCII. Please be aware that storing in this format might produce very large files! The file format will be described <link linkend="ascii_format">below</link>.
de: Das zweite Format das &kwave; unterstützt ist "ASCII". Sie können in ASCII sowohl exportieren als auch importieren. Bitte beachten Sie dass beim Speichern in diesem Format sehr große Dateien entstehen können! Das Dateiformat wird <link linkend="ascii_format">im folgenden</link> beschrieben.
es: El segundo formato que &kwave; soporta es "ASCII". Puede tanto exportar a ASCII como importar desde ASCII. Por favor, dese cuenta que guardar en este formato puede producir archivos de gran tamaño! El formato de archivo será descrito <link linkend="ascii_format"> abajo</link>.

source: <filename>.mp3</filename> and <filename>.mp2</filename> import is available through <ulink url="&url_libmad;">libmad</ulink> for the MP3 decoding in combination with <ulink url="&url_id3lib;">id3lib</ulink> for decoding ID3 tags and <ulink url="&url_lame;">lame</ulink> for encoding.
de: <filename>.mp3</filename> und <filename>.mp2</filename> Import mit Hilfe der <ulink url="&url_libmad;">libmad-Bibliothek</ulink> zum Importieren von MP3 in Kombination mit <ulink url="&url_id3lib;">id3lib</ulink> zur Decodierung von ID3-Tags und <ulink url="&url_lame;">lame</ulink> zum Exportieren.
es: La importación <filename>.mp3</filename> y <filename>.mp2</filename> está disponible a través de <ulink url="&url_libmad;">libmad</ulink> para la decodificación MP3 en combinación con <ulink url="&url_id3lib;">id3lib</ulink> para decodificar metadatos ID3 y <ulink url="&url_lame;">lame</ulink> para la codificación.

source: Ogg/Vorbis (<filename>*.ogg</filename>) import and export. See <ulink url="&url_ogg_vorbis;">&url_ogg_vorbis;</ulink> for details.
cs: Ogg/Vorbis (<filename>*.ogg</filename>) zavedení souboru a vyvedení do souboru. Viz <ulink url= "&url_ogg_vorbis;">&url_ogg_vorbis;</ulink> pro podrobnosti.
de: Ogg/Vorbis (<filename>*.ogg</filename>) Import und Export. Für Details besuchen Sie bitte <ulink url="&url_ogg_vorbis;">&url_ogg_vorbis;</ulink>.
es: Importación y exportación de Ogg/Vorbis (<filename>*.ogg</filename>). Ver <ulink url="&url_ogg_vorbis;">&url_ogg_vorbis;</ulink> para más detalles.

source: FLAC (<filename>*.flac</filename>) import and export. See <ulink url="&url_flac;">&url_flac;</ulink> for details.
cs: FLAC (<filename>*.flac</filename>) zavedení souboru a vyvedení do souboru. Viz <ulink url="&url_flac;">&url_flac;</ulink> pro podrobnosti.
de: FLAC (<filename>*.flac</filename>) Import und Export. Siehe <ulink url="&url_flac;">&url_flac;</ulink> für weitere Details.
es: Importación y exportación de FLAC (<filename>*.flac</filename>). Ver <ulink url="&url_flac;">&url_flac;</ulink> para más detalles.

source: Additionally &kwave; supports many other common formats through the <ulink url="&url_libaudiofile;">audiofile</ulink> plugin. You can import files like <filename>*.au</filename> and <filename>*.snd</filename> (NeXT,Sun Audio), <filename>*.aiff</filename> (Audio Interchange Format) and <filename>*.sf</filename> (Berkeley,IRCAM,Carl Sound Format).
cs: Dále &kwave; podporuje mnoho jiných běžných formátů prostřednictvím <ulink url="&url_libaudiofile;">audiofile</ulink> přídavného modulu. Můžete zavést soubory jako <filename>*.au</filename> a <filename>*.snd</filename> (NeXT, Sun Audio), <filename>*.aiff</filename> (Audio Interchange Format) a <filename>*.sf</filename> (Berkeley, IRCAM,Carl Sound Format).
de: Zusätzlich unterstützt &kwave; viele andere Formate durch das <ulink url="&url_libaudiofile;">audiofile</ulink>-Plugin. Sie können Dateien wie <filename>*.au</filename>, <filename>*.snd</filename> (NeXT,Sun Audio), <filename>*.aiff</filename> (Audio Interchange Format) und <filename>*.sf</filename> (Berkeley,IRCAM,Carl Sound Format) importieren.
es: Adicionalmente &kwave; soporta muchos más formatos a través del complemento <ulink url="&url_libaudiofile;">audiofile</ulink>. Puede importar archivos como <filename>*.au</filename> y <filename>*.snd</filename> (NeXT,Sun Audio), <filename>*.aiff</filename> (Audio Interchange Format) y <filename>*.sf</filename> (Berkeley,IRCAM,Carl Sound Format).

source: Converting to and from .wav
cs: Převádění do a z .wav
de: Konvertierung zu und von .wav
es: Convertir a y desde .wav
fr: Convertir vers ou à partir d'un fichier « .wav »

source: The best way to work with formats other than those supported by &kwave; is to use an external converter program. A good set of tools for this is in the <ulink url="&url_sox;">SoX</ulink> package, they have also some nice documentation!
cs: Nejlepším způsobem pro práci s jinými formáty než podporovanými &kwave; je použití vnějšího převodního programu. Dobrá sada nástrojů pro toto použití se nachází v balíčku <ulink url="&url_sox;">SoX</ulink>, pro který rovněž existuje hezká dokumentace!
de: Im Moment ist es am besten, zum Bearbeiten von Formaten die nicht von &kwave; unterstützt werden, ein externes Konverter-Programm zu benutzen. Eine gute Auswahl von Werkzeugen dafür finden Sie im <ulink url="&url_sox;">SoX</ulink> Paket, dort finden Sie auch gute Dokumentation!
es: La mejor manera de trabajar con otros formatos que los soportados por &kwave; es mediante el uso de un convertidor externo. Un buen conjunto de herramientas para esta tarea se encuentran en el paquete <ulink url="&url_sox;">SoX</ulink>, el cual tienen una buena documentación.

source: The plans for future include support for import and also export filters for more formats and maybe some filter that uses a user-defineable script with a call to an external filter, so that even formats not supported by <literal>SoX</literal> (like MP3) can be read and/or written.
cs: Plány na budoucí zahrnutí zaváděcích a také vyváděcích filtrů pro více formátů a možná i nějakých filtrů, které by používaly uživatelsky stanovený skript s voláním vnějšího filtru, takže by mohly být čteny a/nebo zapisovány i formáty nepodporované <literal>SoX</literal> (jako je MP3).
de: Die Pläne für die Zukunft beinhalten Unterstützung für Importfilter für andere Formate und vielleicht einige Filter, die ein benutzerdefiniertes Skript mit einem Aufruf an externe Filter integriert, so dass sogar Formate gelesen und/oder geschrieben werden können, die nicht von <literal>SoX</literal> (wie MP3) unterstützt werden.
es: Los planes para el futuro incluyen soporte para filtros de importación y exportación para más formatos y, quizá, algún filtro que permita usar un script definido por el usuario con llamada a un filtro externo para que incluso formatos no soportados por <literal>SoX</literal> (como MP3) puedan ser leidos y/o escritos.
fr: Les prochaines versions incluront des filtres d'importation pour d'autres formats et peut être quelques filtres qui utiliseront des scripts définissables par les utilisateurs avec des appels à des outils de convertion externes pour le traitement en écriture ou en lecture des formats de fichiers non supportés par <literal>SoX</literal> (comme le MP3).

source: Format of ASCII files
cs: Formát ASCII souborů
de: Format von ASCII-Dateien
es: Formato de archivos ASCII

source: The ASCII format is quite useful for scientific and educational purposes. Due to it's simple format, you can either write simple files on your own with a text editor or you can use the output of some other application and convert it into ASCII. As the format is <emphasis>really</emphasis> simple, you should not have big problems in writing a converter and most scientific applications use to have some kind of their own ASCII format for export.
cs: Formát ASCII je docela užitečný pro vědecké a vzdělávací účely. Díky jeho jednoduchému formátu, můžete buď vlastnoručně zapisovat jednoduché soubory v textovém editoru, nebo můžete použít výstup jiné aplikace a převést jej do ASCII. Jelikož je formát <emphasis>skutečně</emphasis>jednoduchý, neměl byste mít velké problémy s psaním převodníku a většina vědeckých programů obvykle má nějaký druh svého vlastního ASCII formátu určeného pro export.
de: Das ASCII-Format ist recht nützlich für wissenschaftliche Zwecke und zu Ausbildungs-Zwecken. Aufgrund seines einfachen Aufbaus können Sie entweder eigene Dateien mit einem Texteditor schreiben oder auch die Ausgabe einer anderen Applikation verwenden und in ASCII konvertieren. Nachdem das Format <emphasis>sehr</emphasis> simpel ist sollten Sie keine grösseren Probleme haben falls notwendig einen Konverter zu schreiben; die meisten wissenschaftlichen Anwendungen haben eine Art eigenes ASCII-Format für den Export von Daten.
es: El formato ASCII es bastante útil para ámbitos científicos y educativos. Debido a su simple formato puede escribir archivos sencillos usted mismo con un editor de texto o puede usar la salida de otra aplicación y convertirla en ASCII. Ya que el formato es <emphasis>realmente</emphasis> simple no debería tener grandes problemas en escribir un convertidor, además, la mayoría de las aplicaciones científicas suelen tener alguno para exportar en formato ASCII.

source: The format of an ASCII file is quite simple and has the following rules:
cs: Formát ASCII je docela jednoduchý a řídí se následujícími pravidly:
de: ASCII-Dateien haben einen relativ unkomplizierten Aufbau, nach folgenden Regeln:
es: El formato de un archivo ASCII es bastante simple y tiene las siguientes reglas:

source: At the start of the file comes a block of properties, with one property per line.
cs: Na začátku souboru se nachází blok s vlastnostmi; jedna vlastnost na řádek.
de: Am Anfang der Datei kommt ein Block mit Datei-Eigenschaften, mit einer Eigenschaft pro Zeile.
es: Al comienzo del archivo se encuentran un bloque de propiedades, con una propiedad por línea.

source: Each property line starts with <literal>##</literal>.
cs: Každý řádek s vlastností začíná s <literal>##</literal>.
de: Jede Eigenschaften-Zeile beginnt mit <literal>##</literal>.
es: Cada línea de una propiedad comienza con <literal>##</literal>

source: After the properties comes a list of samples, with one sample per line. When using multiple channels, the samples are separated by commas.
cs: Po vlastnostech přichází seznam se vzorky - jeden vzorek na řádek. Při použití více kanálů jsou vzorky odděleny čárkami.
de: Nach den Datei-Eigenschaften kommt eine Liste von Samples, mit einem Sample pro Zeile. Bei Verwendung von mehreren Spuren werden die Samples durch Komma getrennt.
es: Después de las propiedades le sigue una lista de muestras, con una muestra por línea. Cuando se utilizan varios canales las muestras son separadas por comas.

source: Lines might end with a carriage return and/or a line feed character (so DOS files are supported too). But when saving, files will always be saved with line feed character as the end of the line.
cs: Řádky mohou končit znakem operace, která připravuje další znak, aby byl tištěn nebo zobrazen jako první znak na řádku a/nebo znakem pro posun (takže DOSové soubory jsou podporovány také). Ale při ukládání budou soubory vždy uloženy se znakem pro posun řádku jako konce řádku.
de: Zeilen dürfen mit einem Zeilenvorschub und/oder einem Wagenrücklauf enden (so dass DOS-Dateien ebenfalls unterstützt werden). Beim Speichern von Dateien wird als Zeilenende immer das Zeilenvorschub-Zeichen verwendet.
es: Las líneas pueden terminar con un retorno de carro y/o un carácter de nueva línea (por lo que los archivos de DOS también están soportados). Pero alguardar, los archivos siempre serán guardados con un carácter de nueva línea al final de la línea.

source: Empty lines and characters after a <literal>#</literal> are treated as comments and are ignored.
cs: S prázdnými řádky a znaky po <literal>#</literal> je zacházeno jako s poznámkami a jsou přehlíženy.
de: Leere Zeilen und Zeichen nach einem <literal>#</literal> gelten als Kommentare und werden ignoriert.
es: Las líneas vacías y los caracteres después de <literal>#</literal> son tratados como comentarios y por tanto ignorados.

source: Values have to be given in signed integer format with a 24 bit range, which is the internal storage format of &kwave;.
de: Werte müssen als vorzeichenbehafteten Integer-Format mit einem 24-Bit Wertebereich angegeben werden, dem internen Speicherformat von &kwave;.
es: Los valores debe ser suministrados como enteros con signo con rango de 24 bits, el cual es el formato de almacenamiento interno de &kwave;.

source: Everything after a <literal>#</literal> (except property lines, see above) will be treated as comment and will be ignored. Empty lines will also be ignored.
de: Alles nach einem <literal>#</literal> (mit Ausnahme der oben beschriebenen Dateieigenschaften) wird als Kommentar behandelt und wird ignoriert. Leere Zeilen werden ebenfalls ignoriert.
es: Todo lo que siga a <literal>#</literal> (excepto las líneas de propiedades, ver más arriba) será tratado como un comentario y por tanto será ignorado. Las líneas vacias también serán ignoradas.

source: Here is an example of a simple ASCII file that represents a sine wave with eleven samples:
cs: Zde je příklad jednoduchého ASCII souboru, který představuje sinusovou vlnu s jedenácti vzorky:
de: Hier ein Beispiel für eine einfache ASCII-Datei die einen Sinus mit elf Samples enthält:
es: Aquí tiene un ejemplo de un sencillo archivo ASCII que representa una onda sinusoidal con once muestras:

source: content of an ASCII file with a single sine wave
cs: obsah ASCII souboru s jednoduchou sinusovou vlnou
de: Inhalt einer ASCII-Datei mit elf Samples
es: contenido de un archivo ASCII con una sola onda sinusoidal

source: ## 'rate'=44100 ## 'tracks'=2 ## 'bits'=16 ## 'length'=11 ## 'Date'='2013-11-09' ## 'Software'='Kwave-0.8.11 for KDE 4.11.3' 5930496, 5930496 # 0 0, 8388352 # 1 -5930752, 5930496 # 2 -8388608, 0 # 3 -5930752, -5930752 # 4 0, -8388608 # 5 5930496, -5930752 # 6 8388352, 0 # 7 5930496, 5930496 # 8 0, 8388352 # 9 -5930752, 5930496 # 10 # EOF
de: ## 'rate'=44100 ## 'tracks'=2 ## 'bits'=16 ## 'length'=11 ## 'Date'='2013-11-09' ## 'Software'='Kwave-0.8.11 für KDE 4.11.3' 5930496, 5930496 # 0 0, 8388352 # 1 -5930752, 5930496 # 2 -8388608, 0 # 3 -5930752, -5930752 # 4 0, -8388608 # 5 5930496, -5930752 # 6 8388352, 0 # 7 5930496, 5930496 # 8 0, 8388352 # 9 -5930752, 5930496 # 10 # EOF

source: Creating a New File
cs: Vytvoření nového souboru
de: Erstellen einer neuen Datei
es: Crear un nuevo archivo

source: You can create a new and empty file menu under <menuchoice> <guimenu>File</guimenu><guimenuitem>New...</guimenuitem> </menuchoice>.
cs: Můžete vytvořit nový a prázdný soubor v nabídce hlavní lišty <menuchoice> <guimenu>Soubor</guimenu><guimenuitem>Nový...</guimenuitem> </menuchoice>.
de: Sie können eine neue leere Datei erstellen unter <menuchoice> <guimenu>Datei</guimenu><guimenuitem>Neu...</guimenuitem> </menuchoice>.
es: Puede crear un nuevo y vacio archivo desdel el menu <menuchoice> <guimenu>Archivo</guimenu><guimenuitem>Nuevo...</guimenuitem> </menuchoice>.

source: Here's a screenshot of &kwave;'s new file dialog
cs: Tady je snímek obrazovky &kwave; s dialogem pro vytvoření nového souboru
de: Hier ein Screenshot von &kwave;'s Dialog zum Anlegen neuer Dateien
es: Aquí una captura de pantalla de la ventana nuevo archivo de &kwave;

source: Screenshot of the File New Dialog
cs: Snímek obrazovky s dialogem pro vytvoření nového souboru
de: Screenshot des Dialogs zum Anlegen neuer Dateien
es: Captura de pantalla de la ventana nuevo archivo
