Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: You can select the sample rate, resolution in bits per sample and the number of tracks. Per default the file format will be ".wav", but it can still be changed at the time when the file is saved.
cs: Můžete zvolit vzorkovací kmitočet, rozlišení v bitech na vzorek a počet stop. Výchozím souborovým formátem je ".wav", ale ten může být ještě změněn v době, kdy je soubor ukládán.
de: Sie können eine Abtastrate, Auflösung in Bits pro Sample und die Anzahl der Spuren einstellen. Standardmässig wird als Dateiformat ".wav" angenommen, was aber später beim Speichern der Datei geändert werden kann.
es: Puede seleccionar la frecuencia de muestreo, la resolución en bits por muestra y el número de pistas. Por defecto el formato de archivo será ".wav", pero puede ser cambiado en el instante de guardar el archivo.

source: The length of the new signal can be set by time (hours, minutes, seconds) or by the number of samples. Additionally you can select it relative to the highest possible length, which is limited by the available memory and &kwave;'s internal limit (2 GB).
cs: Délka nového signálu může být stanovena podle času (hodiny, minuty, sekundy) nebo podle počtu vzorků. Vedle toho ji můžete zvolit poměrně k nějvětší možné délce, která omezena dostupnou pamětí a vnitřním omezením &kwave; (2 GB).
de: Die Länge einer neuen Datei kann über die Zeit (Stunden, Minuten, Sekunden) oder über die Anzahl der Samples eingestellt werden. Zusätzlich kann man sie relativ zur grössten möglichen Länge einstellen, die durch den vorhandenen Speicher und durch &kwave; selbst (auf 2GB) begrenzt wird.
es: La longitud de la nueva señal puede ser fijada por tiempo (horas, minutos, segundos) o por número de muestras. Adicionalmente puede seleccionarla relativa a la máxima longitud posible, la cual es limitada por la cantidad de memoria disponible y por el límite interno de &kwave; (2 GB).

source: Recording
cs: Nahrávání
de: Aufnahme
es: Grabación

source: &kwave; is able to record audio data from various sources, with all sample rates, sample formats and other modes that your sound hardware supports. Currently &kwave; records through the old OSS sound interface, and since v0.7.4 also the newer and more powerful ALSA interface that is the preferred choice for linux kernel 2.6.
cs: &kwave; může nahrávat zvuková data z různých zdrojů, se všemi vzorkovacími kmitočty, vzorkovacími formáty a jinými způsoby, jež podporuje vyše zvuková karta. Nyní &kwave; nahrává přes staré OSS zvukové rozhraní, a od v0.7.4 také přes novější a mocnější rozhraní ALSA, jež je upřednostňovanou volbou pro linuxové jádro 2.6.
de: &kwave; ist in der Lage, von verschieden Quellen aufnehmen, mit allen Abtastraten, Sample-Formaten und Einstellungen die Ihre Soundkarte unterstützt. Derzeit verwendet &kwave; für die Aufnahme das alte OSS-Interface, und seit v0.7.4 auch das neuere und leistungsfähigere ALSA-System, dem System der Wahl für den Linux-Kernel 2.6.
es: &kwave; es capaz de grabar audio desde varias fuentes con todas las frecuencias de muestreo, todos los formatos y otros modos que soporte su dispositivo de audio. Actualmente &kwave; graba a través de la antigua interfaz OSS y desde la versión 0.7.4 también desde la más nueva y potente interfaz ALSA que es la elección preferida por linux desde el kernel 2.6.

source: The recording can be reached from the menu under <menuchoice> <guimenu>File</guimenu><guimenuitem>Record</guimenuitem> </menuchoice>.
cs: K nahrávání lze dospět z menu pod<menuchoice> <guimenu>Soubor</guimenu><guimenuitem>Nahrát</guimenuitem> </menuchoice>.
de: Die Aufnahme kann im Menü unter <menuchoice> <guimenu>Datei</guimenu><guimenuitem>Aufnehmen</guimenuitem></menuchoice> erreicht werden.
es: La ventana de grabación puede abrirse desde el menú <menuchoice> <guimenu>Archivo</guimenu><guimenuitem>Grabar</guimenuitem> </menuchoice>.

source: Here is a screenshot of the &kwave; record dialog, showing the first page with the recording controls during a running recording session. Like in most dialogs of &kwave; you can get some help or see tooltips on the controls.
cs: Tady je snímek obrazovky &kwave; s nahrávacím dialogem, na němž je vidět první stránka s ovládáním nahrávání během spuštěného nahrávacího sezení. Tak jako je tomu ve většině dialogů &kwave;, můžete obdržet určitou nápovědu nebo si prohlédnout rady k nástrojům u ovládacích prvků.
de: Hier ist ein Screenshot der ersten Seite des &kwave;'s Aufnahme-Dialogs mit den Aufnahmekontrollen, während einer laufenden Aufnahme. Wie in den meisten Dialogen von &kwave; erhalten Sie einige Hilfestellungen und Tooltips von den Kontrollelementen.
es: Aquí tiene una captura de pantalla de la ventana de grabación de &kwave; mostrando la primera pestaña con los controles de grabación durante una sesión. Como en la mayoría de ventanas de &kwave;, puede obtener ayuda o ver la descripción emergente de los controles.

source: Here's a screenshot of &kwave;'s record dialog
cs: Tady je snímek obrazovky &kwave; s nahrávacím dialogem
de: Das ist ein Screenshot von &kwave;'s Aufnahme-Dialog
es: Aquí una captura de pantalla de la ventana de grabación de &kwave;

source: Screenshot of the Record Dialog
cs: Snímek obrazovky s nahrávacím dialogem
de: Screenshot des Aufnahme-Dialogs
es: Captura de pantalla de la ventana de grabación

source: Here you have the following controls:
cs: Tady jsou následující ovládací prvky:
de: Hier haben Sie folgende Einstellmöglichkeiten:
es: Aquí tiene los siguientes controles:

source: <guilabel>Pre-Record:</guilabel> If the pre-recording feature of &kwave; is enabled and the recording is startet, &kwave; records into an internal buffer which is some seconds long. If you press the <guibutton>Record</guibutton> ( <inlinemediaobject> <imageobject> <imagedata fileref="krec_record.png" format="PNG"/> </imageobject> <textobject> <phrase>record button</phrase> </textobject> </inlinemediaobject> ) button again, then the recording really starts, and also keeps the already pre-recorded data. This is useful for example if you want to record your favorite song from radio, but you recognize too late that the song has started. In this case you can still press the record button and get the start of the song from what &kwave; has already pre-recorded before, so that you will no longer miss a start.
cs: <guilabel>Nahrát předem:</guilabel> Pokud je funkce nahrávání předem &kwave; povolena a nahrávání je spuštěno, &kwave; nahrává do vnitřní vyrovnávací paměti, která je dlouhá několik sekund. Jestliže stisknete <guibutton>Nahrávací</guibutton> ( <inlinemediaobject> <imageobject> <imagedata fileref="krec_record.png" format="PNG"/> </imageobject> <textobject> <phrase>tlačítko pro nahrávání</phrase> </textobject> </inlinemediaobject> ) tlačítko znovu, pak nahrávání opravdu začne, a rovněž budou zachována data, která byla nahrána předem. Toto je například užitečné, pokud chcete nahrávat svou oblíbenou skladbu z rádia, ale poznáte příliš pozdě, že písnička už začala. V tom případě můžete stále ještě stisknout nahrávací tlačítko a získat začátek skladby, který byl již předtím nahrán &kwave;, čímž již vícekrát nezmeškáte žádný začátek.
de: <guilabel>Vorab-Aufnahme:</guilabel> Wenn Sie die Vorab-Aufnahme aktivieren, und die Aufnahme gestartet wird, nimmt &kwave; in einen internen Ringpuffer auf, der einige Sekunden lang ist. Wenn Sie den <guibutton>Aufnahme</guibutton> ( <inlinemediaobject> <imageobject> <imagedata fileref="krec_record.png" format="PNG"/> </imageobject> <textobject> <phrase>Aufnahme-Knopf</phrase> </textobject> </inlinemediaobject> )-Knopf nochmals drücken, startet die Aufnahme wirklich, wobei die bereits im Ringpuffer aufgenommenen Daten erhalten bleiben. Dies ist beispielsweise nützlich, wenn Sie Ihr Lieblingslied vom Radio aufnehmen wollen, aber zu spät mitkriegen dass das Stück bereits gestartet ist. In diesem Fall können Sie immer noch den Aufnahme-Knopf drücken und den Start des Stücks aus dem beziehen was &kwave; bereits aufgenommen hat. Somit verpassen Sie nie mehr einen Anfang.
es: <guilabel>Pre-grabación:</guilabel> Si la característica de pre-grabación de &kwave; está activada y la grabación comienza, &kwave; graba en un buffer interno de algunos segundos de duración. Si pulsa el botón <guibutton>Grabar</guibutton> ( <inlinemediaobject> <imageobject> <imagedata fileref="krec_record.png" format="PNG"/> </imageobject> <textobject> <phrase>botón grabar</phrase> </textobject> </inlinemediaobject> ) otra vez, entonces la grabación comenzará mateniendo la información pre-grabada. Esto es útil por ejemplo si quiere grabar su canción favorita desde la radio pero reconoce demasiado tarde que la canción ya había comenzado. En este caso puede pulsar el botón de grabar y obtener el comienzo de la canción de lo que &kwave; ya había pre-grabado antes, por lo que ya no perderá un comienzo nunca más.

source: <guilabel>Record Time:</guilabel> If the length of the recording should be limited to some time, you can activate this setting and select a time in hours, minutes, seconds for your recording. If this option is not enabled, the recording runns until you press the <guibutton>Stop</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="record_stop.png" format="PNG"/> </imageobject><textobject><phrase>stop button</phrase></textobject> </inlinemediaobject>) button.
cs: <guilabel>Čas nahrávání:</guilabel> Pokud by měla být délka nahrávání omezena na určitý čas, můžete zapnout toto nastavení a pro své nahrávání vybrat čas v hodinách, minutách, sekundách. Jestliže tato volba povolena není, poběží nahrávání, dokud nestisknete tlačítko <guibutton>Zastavit</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="record_stop.png" format="PNG"/> </imageobject><textobject><phrase>Tlačítko zastavení nahrávání</phrase></textobject> </inlinemediaobject>).
de: <guilabel>Aufnahmedauer:</guilabel> Wenn die Länge der Aufnahme auf eine bestimmte Zeit begrenzt werden soll, können Sie diese Einstellung aktivieren und eine Zeit in Stunden, Minuten, Sekunden einstellen. Wenn Sie diese Einstellung nicht aktivieren, läuft die Aufnahme so lange bis Sie den <guibutton>Stop</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="record_stop.png" format="PNG"/> </imageobject><textobject><phrase>Stop-Knopf</phrase></textobject> </inlinemediaobject>)-Knopf drücken.
es: <guilabel>Tiempo de grabación:</guilabel> Si la longitud de la grabación debe ser limitada a cierto tiempo puede activar esta característica y seleccionar un tiempo en horas, minutos y segundos para su grabación. Si esta característica no está activada la grabación continuará hasta que pulse el botón de <guibutton> Detener grabación</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="record_stop.png" format="PNG"/> </imageobject><textobject><phrase>botón detener</phrase></textobject> </inlinemediaobject>)

source: <guilabel>Start At:</guilabel> If this setting is activated, you can set a date and time when the recording will be started. Please keep in mind that if the configured time is in the past, the recording will start immediately.
cs: <guilabel>Začít na:</guilabel> Pokud je zapnuta tato volba, můžete nastavit datum a čas, kdy bude nahrávání spuštěno. Zapamatujte si, prosím, že pokud je nastavený čas v minulosti, nahrávání bude spuštěno okamžitě.
de: <guilabel>Startzeit:</guilabel> Wenn diese Einstellung aktiviert ist, können Sie ein Datum und eine Uhrzeit angeben zu der die Aufnahme gestartet wird. Bitte beachten Sie dass die Aufnahme sofort beginnt wenn die eingestellte Zeit in der Vergangenheit liegt.
es: <guilabel>Comenzar en:</guilabel> Si esta característica está activada puede fijar la fecha y hora en que la grabación comenzará. Tenga en cuenta que si la hora configurada es pasada la grabación comenzará inmediatamente.

source: <guilabel>Record Trigger:</guilabel> If enabled, the recording starts only if the volume of the input goes over a certain limit, which can be defined from 0 to 100% of the highest possible input volume. This is useful if you do not want to record leading silence. (Hint: combine this with the prerecording feature mentioned above to catch also some seconds before reaching the trigger, so that you don't miss any silent fade-ins.)
cs: <guilabel>Spoušť nahrávání:</guilabel> Pokud je povolena, nahrávání začne pouze tehdy, když hlasitost vstupu překročí určitou hranici, jež může být stanovena od 0 do 100 % nejvyšší možné hlasitosti na vstupu. Toto je užitečné, pokud nehodláte nahrávat počáteční ticho. (Rada: spojte to s funkcí nahrávání předem, jež byla zmíněna výše, abyste rovněž získal několik sekund před dosažením úrovně spouště, takže nezmeškáte žádné tiché postupné zesílení zvuku.)
de: <guilabel>Trigger-Pegel:</guilabel> Wenn aktiviert, startet die Aufnahme erst wenn die Lautstärke des Eingangssignals einen bestimmten Pegel überschreitet, der zwischen 0 und 100% der höchsten möglichen Eingangs-Lautstärke. Dies ist nützlich wenn Sie nicht die Stille am Anfang aufgenommen haben wollen.
es: <guilabel>Grabación tras detección:</guilabel> Si se encuentra activada la grabación comienza solo si el volumen de entrada supera cierto límite, el cual puede ser definido de 0 a 100% del volumen de entrada más alto posible. Esto es útil si no quiere grabar silencio al comienzo. (Pista: combine esto con la característica de pre-grabación mencionada arriba para capturar también algunos segundos antes de alcanzar el disparador, de esta manera no perderá ningún fade-in silencioso.)

source: The <guibutton>New</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="record_new.png" format="PNG"/> </imageobject><textobject><phrase>new button</phrase></textobject> </inlinemediaobject>) button is active when the recording is not running or is finished, to discard the current file content and start again.
cs: Tlačítko <guibutton>Nový soubor</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="record_new.png" format="PNG"/> </imageobject><textobject><phrase>tlačítko pro nový soubor</phrase></textobject> </inlinemediaobject>) je činné, když není nahrávání spuštěno nebo je skončeno, aby byl vyhozen obsah současného souboru a začalo se znovu.
de: Der <guibutton>Neu</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="record_new.png" format="PNG"/> </imageobject><textobject><phrase>Neu-Knopf</phrase></textobject> </inlinemediaobject>)-Knopf ist aktiv wenn keine Aufnahme läuft oder die Aufnahme beendet ist. Der Inhalt der aktuellen Datei wird verworfen.
es: El botón de <guibutton>Nuevo archivo</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="record_new.png" format="PNG"/> </imageobject><textobject><phrase>botón nuevo archivo</phrase></textobject> </inlinemediaobject>) está activo cuando la grabación no está en marcha o cuando ya ha finalizado. Permite descartar el archivo actual y comenzar uno nuevo.

source: The <guibutton>Stop</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="record_stop.png" format="PNG"/> </imageobject><textobject><phrase>stop button</phrase></textobject> </inlinemediaobject>) button is active when the recording or pre-recording is running or &kwave; is waiting for the trigger. If pressed, the current progress will be stopped.
cs: Tlačítko <guibutton>Zastavit nahrávání</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="record_stop.png" format="PNG"/> </imageobject><textobject><phrase>tlačítko pro zastavení nahrávání</phrase></textobject> </inlinemediaobject>) je činné, když je spuštěno nahrávání, nebo když je spuštěno nahrávání předem, nebo když &kwave; čeká na spoušť. Když je stisknuto, postup současného nahrávání je zastaven.
de: Der <guibutton>Stop</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="record_stop.png" format="PNG"/> </imageobject><textobject><phrase>stop button</phrase></textobject> </inlinemediaobject>)-Knopf ist aktiv während die Aufnahme oder Vorab-Aufnahme läuft oder während &kwave; auf das Erreichen eines Triggerpegels wartet. Beim Klicken wird der aktuelle Vorgang angehalten.
es: El botón de <guibutton>Detener grabación</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="record_stop.png" format="PNG"/> </imageobject><textobject><phrase>boton detener grabación</phrase></textobject> </inlinemediaobject>) está activo cuando la grabación o la pre-grabación está en marcha o cuando &kwave; está esperando el disparador. Si es pulsado el progreso actual se detendrá.

source: The <guibutton>Pause</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="record_pause.png" format="PNG"/> </imageobject><textobject><phrase>pause button</phrase></textobject> </inlinemediaobject>) button is active when the recording or pre-recording is running. The first time you press it, the rcording will be halted and the button starts blinking. When you press it again the button will stop blinking and recording will continue immediately, without waiting for a trigger.
cs: Tlačítko<guibutton>Pozastavit/Pokračovat</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="record_pause.png" format="PNG"/> </imageobject><textobject><phrase>tlačítko pro pozastavenít</phrase></textobject> </inlinemediaobject>) je činné, když je spuštěno nahrávání nebo nahrávání předem. Když jej stisknete poprvé, nahrávání je pozastaveno a tlačítko začne poblikávat. Když jej stisknete znovu, tlačítko přestane poblikávat a nahrávání pokračuje okamžitě, bez čekání na spoušť.
de: Der <guibutton>Pause</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="record_pause.png" format="PNG"/> </imageobject><textobject><phrase>Pause-Knopf</phrase></textobject> </inlinemediaobject>)-Knopf ist aktiv während die Aufnahme oder Vorab-Aufnahme läuft. Beim ersten Klicken wird die Aufnahme angehalten und der Knopf fängt an zu blinken. Beim zweiten Klicken hört der Knopf auf zu blinken und die Aufnahme geht sofort weiter, ohne auf das Erreichen eines Triggerpegels zu warten.
es: El botón de <guibutton>Pausar/Continuar</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="record_pause.png" format="PNG"/> </imageobject><textobject><phrase>botón pausa/continuar</phrase></textobject> </inlinemediaobject>) está activo cuando la grabación o la pre-grabación está en marcha. La primera vez que lo pulse la grabación será pausada y el botón parpadeará. Si lo pulsa de nuevo el botón dejará de parpadear y la grabación continuará inmediatamente sin esperar a ningún disparador.

source: The <guibutton>Record</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="krec_record.png" format="PNG"/> </imageobject><textobject><phrase>record button</phrase></textobject> </inlinemediaobject>) button starts the recording and/or prerecording, depending on the features enabled above:
cs: Tlačítkem <guibutton>Nahrát</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="krec_record.png" format="PNG"/> </imageobject><textobject><phrase>tlačítko pro nahrávání</phrase></textobject> </inlinemediaobject>) se spouští nahrávání a/nebo nahrávání předem v závislosti na funkcích povolených výše:
de: The <guibutton>Aufnahme</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="krec_record.png" format="PNG"/> </imageobject><textobject><phrase>Aufnahme-Knopf</phrase></textobject> </inlinemediaobject>) startet die Aufnahme und Vorab-Aufnahme, abhängig von den oben aktivierten Einstellungen.
es: El botón de <guibutton>Grabar</guibutton> (<inlinemediaobject><imageobject> <imagedata fileref="krec_record.png" format="PNG"/> </imageobject><textobject><phrase>botón grabar</phrase></textobject> </inlinemediaobject>) comienza la grabación y/o la pre-grabación dependiendo de las características de arriba activadas:

source: If neither prerecording nor trigger level are used, the recording starts as soon as you press the record button.
cs: Pokud není používáno buď nahrávání předem nebo úroveň spouště, je nahrávání spuštěno, jakmile stisknete tlačítko pro nahrávání.
de: Wenn weder Vorab-Aufnahme noch Triggerpegel aktiviert wurden, startet die Aufnahme sofort beim Klicken des Aufnahmebuttons.
es: Si ni pre-grabación ni grabación tras detección son usadas, la grabación comenzará tan pronto pulse el botón de grabar.

source: If prerecording is not used and a trigger level is set, the first press will let &kwave; wait for the trigger level to be reached. While waiting for a trigger, you can force the recording to start immediately by pressing the record button again, otherwise the recording will start automatically when the trigger level has been reached.
cs: Pokud nahrávání předem není používáno a je nastavena úroveň spouště, první stisknutí nechá &kwave; čekat na úroveň spouště, dokud není dosažena. Při čekání na spoušť můžete urychlit nahrávání tak, aby začalo okamžitě, opětovným stisknutím tlačítka pro nahrávání. Jinak bude nahrávání spuštěno samočinně po dosažení úrovně spouště.
de: Wenn die Vorab-Aufnahme aktiviert wurde und ein Triggerpegel gesetzt wurde, wartet &kwave; nach dem ersten Klicken auf das Erreichen des Triggerpegels. Während dem Warten können Sie den Start der Aufnahme erzwingen indem Sie den Aufnahmebutton nochmals klicken, ansonsten startet die Aufnahme sobald der Triggerpegel erreicht wurde.
es: Si pre-grabación no es usada y grabación tras detección está activada, la primera vez que pulse el boton permitirá a &kwave; esperar por el nivel de detección fijado. Mientras espera el nivel de detección puede forzar la grabación inmediatamente pulsando el botón de grabación otra vez, de otro modo la grabación comenzará automáticamente cuando el nivel de detección sea alcanzado.

source: If prerecording is enabled, the first press starts only the prerecording and the second press really starts the recording.
cs: Pokud je povoleno nahrávání předem, první stisknutí spustí pouze nahrávání předem a až druhý stisk skutečně spustí vlastní nahrávání.
de: Wenn die Vorab-Aufnahme aktiviert wird, startet das erste Klicken nur die Vorab-Aufnahme, erst beim zweiten Klick wird die Aufnahme wirklich gestartet.
es: Si pre-grabación está activada, la primera pulsación sólo inicia la pre-grabación y la segunda pulsación inicia la grabación.

source: Playback
cs: Přehrávání
de: Wiedergabe
es: Reproducción

source: Depending on the compilation options &kwave; is able to play sounds trough one of the following playback methods:
cs: V závislostí na volbách sestavení může &kwave; přehrát zvuky prostřednictvím jednoho z následujících způsobů pro přehrání:
de: Je nachdem welche Optionen zur Kompilierzeit gesetzt waren, kann &kwave; mit Hilfe folgender Wiedergabe-Methoden abspielen:
es: Dependiendo de las opciones de compilación, &kwave; es capaz de reproducir sonidos a través de los siguientes modos de reproducción:
