Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: added classes Mutex and MutexGuard
fr: Ajout des classes « Mutex » et « MutexGuard ».

source: sonagram: set a transparent background for the image
fr: Sonogramme : ajout d'une image de fond transparente.

source: added sizeHint() and minimumSize() to ScaleWidget and OverViewWidget
fr: Ajout des fonctions « sizeHint() » et « minimumSize() » pour « ScaleWidget » et « OverViewWidget »

source: sonagram: removed (need for) SonagramContainer, using QGridLayout instead
fr: Sonogramme : suppression de « SonagramContainer », utilisé dans « QGridLayout ».

source: moved SignalProxy to the mt subdirectory
fr: Déplacement de « SignalProxy » dans le sous-dossier « mt ».

source: fixed X11 synchronzation problem with SignalProxy
fr: Correction de problèmes de synchronisation avec X11 concernant « SignalProxy ».

source: added TSS (thread-specific-storage) support to the mt classes
fr: Ajout du support de TSS (Thread-Specific-Storage) dans les classes « mt ».

source: added some multithreading support classes: Thread, AsynchObject, ...
fr: Ajout de quelques classes pour le multithreading : « Thread », « AsynchObject », ...

source: removed the "get" prefix from all member functions. This is the new KDE/QT coding style.
fr: Suppression du préfixe « get » de toutes les fonctions membres. Ceci est le nouveau style de codage pour KDE/QT.

source: updated the online documentation to point to the new Kwave homepage on http://kwave.sourceforge.net/
fr: Mise à jour de la documentation en ligne qui référence la nouvelle page WEB de Kwave sur http://kwave.sourceforge.net/.

source: class ImageView: always repaints (maybe image data has changed)
fr: Classe « ImageView » : toujours redessiner (les images et les données peuvent changer).

source: bugfix: selection and playpointer will not be drawn if no signal is loaded
fr: Correction de bogue : La sélection et le curseur de lecture ne seront pas dessinés si aucun fichier n'est chargé.

source: the sonagram window updates it's title if the signal's name changed
fr: Le titre de la fenêtre du sonogramme est mise à jour si le nom du fichier a changé.

source: found a solution for the problem of synchronizing X11 and QT in a multithreaded environment
fr: Mise en place d'une solution au problème de synchronisation entre X11 et Qt dans l'environnement multithread.

source: fixed bug in the "Halt" function (playback)
fr: Correction de bogue dans la fonction « Halt » (lecture audio).

source: geometry/layout management for the MainWidget
fr: Management de la géométrie et des positions des « Widgets » de la fenêtre principale.

source: limited the displayed height of a signal. If not all signals fit onto the screen, a scrollbar appears on the right side of the signal.
fr: Limitation de l'affichage de la largeur d'un fichier sonore. Si toutes les pistes sonores sortent en dehors de l'écran, une barre de défilement horizontale apparaît sur le coté droit du fichier.

source: limited the size of the TopWidget to a reasonable minimum size
fr: Limitation à une taille raisonnable du « TopWidget ».

source: automatic dependencies for the plugins work again
fr: Dépendances automatiques pour le fonctionnement des modules externes.

source: fixed layout of playback dialog
fr: Correction de la présentation de la boîte de dialogue des options de lecture.

source: started to implement a new plugin interface
fr: Commencement de l'implémentation d'une nouvelle interface pour les modules externes.

source: geometry/layout management for the sonagram settings dialog
fr: Géométrie et présentation de la boîte de dialogues pour le paramétrage du sonogramme.

source: formatting of selection and file time (KwavePlugin::ms2string)
fr: Mise en forme de la sélection et du temps dans un fichier sonore (KwavePlugin::ms2string).

source: plugins can now consist of multiple source files
fr: Les modules externes peuvent maintenant être constitués de plusieurs fichiers sources.

source: some more minor changes to the Makefiles
fr: Quelques petites corrections dans les fichiers « Makefiles ».

source: split the documentation output into "de" and "en" part
fr: Séparation de la documentation en deux parties distinctes : « de » et « en ».

source: made symbolic links to the english help directory from the "de" and "default" directory during make install and uninstall and also in the post and postun scripts of the specfile The user should at least get the english help...
fr: Création d'un lien symbolique des dossiers « de » et « default » vers le dossier d'aide en anglais durant l'installation et la désinstallation, ainsi que avant et après l'exécution des scripts du fichier « .spec ». L'utilisateur doit au moins avoir l'aide en anglais...

source: alpha version of english documentation done
fr: Version alpha de la documentation en anglais.

source: automatic update of the revision history in the docbook file if this file is modified (only english version)
fr: Mise à jour automatique de l'historique de révision dans le fichier au format « Docbook » si le fichier est modifié (version anglaise seulement).

source: CVS is up on sourceforge.net
fr: Le CVS est mis en service sur sourceforge.net.

source: changed some header lines in this file
fr: Changement de quelques lignes d'en-tête dans ce fichier.

source: started on writing a new documentation / online help using docbook
fr: Commencement de l'écriture d'une nouvelle documentation d'aide en ligne avec l'utilisation du format « Docbook ».

source: if a file with invalid size (e.g. recorded by "arecord") is loaded, shows a message and truncates the input at the end of the file
fr: Si un fichier avec une taille invalide (tel que enregistré par « arecord ») est chargé, on affiche un message et on ne tient pas compte des données lues à la fin du fichier sonore.

source: found out that we need ALSA support for 24 and 32 bits/sample
fr: Trouver quel sortie sonore le programme a besoin avec le démon ALSA pour un échantillonnage de 24 et 32 bits.

source: playback in stereo
fr: Lecture d'un fichier sonore en stéréo.

source: selected channels (x) are mixed to the output device's channels (y) at playback using a x:y translation matrix with linear scaling, all values for x and y except zero are allowed
fr: Les sélections des canaux audio (x) sont mixés vers les canaux du périphérique de sortie (y) à la lecture d'un fichier sonore en utilisant une matrice de translation x:y avec une échelle linéaire. Toutes les valeurs pour x et y excepté 0 sont admises.

source: playback only for selected channels
fr: Lecture audio pour seulement les canaux sélectionnés.

source: rework of the settings/playback dialog (plugin)
fr: Restructuration de la boîte de dialogue des paramètres de lecture (module externe).

source: heavy reword on the playback code
fr: Long travail de restructuration du code correspondant à la lecture audio.

source: fixed severe bug in SignalManager::readWavChunk(), chrashed if there was data after the wav chunk
fr: Correction d'un bogue grave dans « SignalManager::readWavChunk() », qui rendait instable l'application.

source: copied the AsyncSync class into libgui, should be used for threadsafe usage of the qt library
fr: Copie de la classe « AsyncSync » dans « libgui », qui doit être utilisée pour un usage des « theadsafe » de la librairie Qt.

source: moved handling of the "selected" flag from class SignalManager to class Signal
fr: Déplacement du drapeau « selected » de la classe « SignalManager » vers la classe « Signal ».

source: fixed selection of channels if appended or deleted
fr: Correction de bogues sur la sélection d'un canal si on ajoute ou on supprime des données.

source: included config.h in each source file (except the plugins)
fr: Ajout du fichier d'en-tête config.h dans chaque fichier source (exceptés les modules externes).

source: export to ASCII for multi-channel signal (multi-channel import has still to be done, currently only mono)
fr: Exportation vers de l'ASCII pour un fichier sonore de plusieurs canaux. (l'importation ne fonctionne qu'avec des données en mono).

source: fixed many memory leaks and inconsistent delete operations (e.g. used "delete" instead of "delete[]")
fr: Correction de plusieurs pertes de mémoire et suppression d'opérations contradictoires (tel que l'utilisation de « delete » à la place de « delete[ ] »).

source: included support for (and tested with) the error detection and memory debugging tool "Insure++ Lite 4.1" (./configure --enable-insure=yes ...) -> thanks to ParaSoft Corporation for making this limited version of the tool available (http://www.parasoft.com)
fr: Ajout (et test) du support pour la détection d'erreurs avec les outils de déboguage « Insure++ Lite 4.1 » (./configure --enable-insure=yes ...) -> remerciements à ParaSoft Corporation pour la mise à disposition d'une version limitée disponible sur http://www.parasoft.com.

source: SignalWidget uses three layers for drawing, speeds up the redraws after mouse selection by about factor 14(!!!) on my system :-))
fr: « SignalWidget » utilise une arborescence en couche pour l'affichage. Cela améliore le réaffichage après une sélection avec la souris d'un facteur 14 (!!!) sur mon système.

source: some minor bugfixes in the Makefiles
fr: Quelques corrections de bogues mineurs dans les fichiers « Makefiles ».

source: save the kwave.spec and include it into the source archive, this lets "rpmbuild -ta kwave-x.x.x-x.tar.gz" work
fr: Sauvegarde et ajout du fichier « .spec » de Kwave dans l'archive des sources. Cela permet à la commande « rpmbuild -ta kwave-x.x.x-x.tar.gz » de fonctionner.

source: wrote a new README file, moved Martin's version to README.OLD
fr: Écriture d'un nouveau fichier README. Déplacement de l'ancienne version écrite par Martin dans README.OLD.

source: RPM_OPT_FLAGS are appended to the compiler options, this lets pentium optimizations work :-)
fr: L'option RPM_OPT_FLAGS a été ajoutée dans la liste des options de compilation, pour permettre aux optimisations du Pentium de fonctionner.

source: shows a message box if loading of a file failed
fr: Afficher une boîte de dialogue d'erreur sur le chargement d'un fichier a échoué.

source: list of recent files is synchronized across all toplevel windows
fr: La liste des fichiers récemment ouverts est synchronisée avec entre toutes les instances du programme.

source: fixed dozens of memory leaks, missing ASSERT constructions, missing variable initializations and possible divisions through zero
fr: Correction de pertes de mémoires, d'oublis de constructions du type ASSERT, d'oublis d'initialisations de variable et de possibles divisions par zéro.

source: Help menu aligned to the right side (MenuRoot now is able to process the special command "#separator")
fr: Le menu d'aide a été aligné sur le coté droit (Le menu principal est capable de gérer la commande spéciale « #separator »).

source: replaced all occurances of sprintf with snprintf, strcpy with strncpy (in 92 places) !
fr: Remplacement de toutes les occurrences de « sprintf » par « snprintf », et de « strcpy » par « strncpy » (92 fois).

source: doesn't show any zoom factor if no signal is loaded
fr: Pas d'affichage du facteur de zoom si aucun fichier sonore n'est chargé.

source: handling of channel add/delete: selection/speakers are shifted
fr: Dans le cas de l'ajout ou la suppression d'un canal, une sélection est décalée.

source: changed some variables/parameters to "unsigned" (simplifies range checks)
fr: Changement de quelques variables et paramètres en « unsigned » (pour simplifier la vérification des étendues de valeurs).

source: beautified this file
fr: Ajout de ce fichier d'aide.

source: beautified the whole source code according to my favorite coding style. -> thanks to the developers of the "Artistic Style" package, astyle-1.11.4-1 made good work :-)
fr: Mise en valeur de quelques portions de code en concordance avec mon style de programmation. -> Remerciements aux développeurs de « Artistic Style ». Le programme astyle-1.11.4-1 fonctionne correctement.

source: fixed that annoying flicker in the help/about dialog
fr: Correction de quelques annotations incohérentes dans l'aide et dans la boîte de dialogue « A propos de... »

source: checking for sizes of char, short and int at configure time
fr: Vérification du format des types « char », « short », et « int » lors de la phase de configuration avant la compilation.

source: globals.app will not be used (obsolete, should be removed from libkwave)
fr: « globals.app » n'est maintenant plus utilisée (obsolète, sera retirée de la bibliothèque « libkwave »).

source: MessagePort will not be used (obsolete, should be removed from libkwave)
fr: « MessagePort » n'est maintenant plus utilisée (obsolète, sera retirée de la bibliothèque « libkwave »).

source: multiple toplevel windows are possible
fr: L'ouverture de plusieurs instances de l'application est maintenant possible.

source: made X toolkit parameters work (especially "-geometry")
fr: Construction des options spécifiques au serveur X (spécialement « -geometry »).

source: bugfix concerning loading/saving 8 bit .wav-files (always unsigned !)
fr: Corrections de bogues concernant le chargement et l'enregistrement de fichiers au format WAVE avec des données sous 8 bits (toujours non-signées).

source: COMPLETE REWORK OF THE INTERNAL COMMAND STRUCTURE
fr: RESTRUCTURATION COMPLÈTE DES COMMANDES ET DES STRUCTURES INTERNES DU PROGRAMME

source: made use of a combination of signals/slots and string messages
fr: Mise en place de combinaisons de signaux et de slots pour l'utilisation de chaînes de messages.

source: hierarchical processing: commands are are forwarded "upwards" until they reach a TopWidget
fr: Hierarchie des processus : les commandes sont déplacées vers le haut jusqu'à atteindre un « TopWidget ».

source: the TopWidget (highest level) dispatches the comands and forwards them to the lower levels
fr: Les « TopWidget » (de niveau haut) diffusent les commandes vers les niveaux les plus bas.

source: rpm package should now be installable without conflicts and compile without any previous installation of kwave
fr: Le paquetage RPM peut être maintenant installé sans conflits et compilé sans une installation préalable de Kwave.

source: removed the "${KDEDIR}/share/doc/HTML/default" directory from the rpm so that it doesn't conflict with the already existing one
fr: Suppression du dossier « ${KDEDIR}/share/doc/HTML/default » du RPM pour qu'il n'y ai pas de conflit avec une version de ce dossier déjà existante.

source: shift+Home/shift+End selects from the current left/right position up to the start/end of the signal
fr: « Shift+Home / Shift+End » permettent la sélection de la position courante jusqu'au début / fin du fichier sonore.

source: bugfix in display of signal: signal is no longer inverted
fr: Correction de bogues dans l'affichage du fichier sonore : il n'est plus inversé dans sa longueur.

source: selectrange() works now
fr: La fonction « Selectrange() » fonctionne correctement maintenant.

source: the zoom factor combo box reflects the current "real" zoom factor
fr: Le champs de sélection du facteur de zoom donne une valeur « réelle » du facteur zoom.

source: some bugfixes in menu handling / cleanups
fr: Quelques corrections de bogues dans le menu de sélection / désélection.

source: complete rework of zoom and offset handling:
fr: Restructuration complète des fonctions de zoom et de sélection :

source: simple poly-lines instead of lowpass interpolation if zoom factor has less than 10 pixels per sample
fr: Polynôme simple au lieu de d'une interpolation passe-bas si le facteur de zoom est moins de 10 pixels par échantillons.

source: lowpass interpolation if more than 10 pixels per sample
fr: Interpolation passe-bas si on a plus de 10 pixels par échantillons.

source: bugfix in KWaveApp: now sets globals.app to this if it was null before, now doesn't crash if it loads a file specified at cmdline
fr: Correction de bogues dans « KWaveApp » : maintenant les paramètres généraux (globals.app) sont sauvegardés s'il n'existait pas avant. Il n'y a plus d'arrêt anormal si on charge un fichier spécifié dans la ligne de commande.

source: now compiles and runns under RedHat 6.1 / Halloween IV as well as under SuSE 6.2
fr: La compilation fonctionne maintenant sous RedHat 6.1 / Halloween IV comme pour SuSE 6.2.

source: version info of libkwavegui.so is set to the package's version
fr: L'information de version de « libkwavegui.so » est maintenant renseignée à partir de la version du paquetage.

source: bugfix in plugins/template/Makefile.am: will not create .moc files on make distclean and other targets
fr: Correction de bogues dans « plugins/template/Makefile.am » : on ne créé pas de fichiers « .moc » lorsqu'il y a une exécution d'un nettoyage des compilations ou d'une nouvelle construction.

source: compiler flags are passed through to plugin compilation
fr: Les drapeaux de compilation sont passés comme paramètres lors de la compilation d'un module externe.

source: compiling with --no-rtti. This was necessary to compile against the kde libraries of RedHat that seem to contain no rtti. As a side effect all warnings on linking programs/libs disappeared :-)
fr: La compilation s'effectue avec l'option « --no-rtti ». Ceci est nécessaire pour compiler l'application pour tenir compte des librairies KDE fournies avec une RedHat car celles ci n'ont pas été compilées avec cette option. Cela a un effet important lors de la compilation : tous les avertissements lors de l'édition des liens du programme et des bibliothèques ont disparu.

source: configure-parameter --enable-debug has effect again
fr: Le script .configure positionne l'option « --enable-debug ».

source: ASCII import and export works now (mono only)
fr: L'importation et l'exportation de l'ASCII fonctionne correctement maintenant (en mono seulement).

source: bugfixes in some plugins, all compile now without warnings/errors
fr: Corrections de bogues dans quelques modules externes. Toutes les compilations sont sans avertissement et sans erreur.

source: plugins are processed in alphabetical order
fr: Les modules externes sont maintenant compilés dans un ordre alphabétique.

source: all plugins are automatically found and compiled
fr: Tous les modules externes sont automatiquement trouvés et compilés.

source: new target "make src.rpm" makes only the source rpm
fr: Une nouvelle construction est disponible par la commande « make src.rpm ». Elle permet la fabrication d'un RPM de source.

source: display will be scrolled left or zoomed if something from the end of the signal is deleted
fr: L'affichage est déplacé à gauche où il est zoomé si on supprime des données à la fin du fichier sonore.

source: curve parameters of fade in / fade out work again
fr: Le paramétrage des courbes pour une amplification croissante ou décroissante fonctionne maintenant.

source: converted many "klocale->translate(...)"s into "i18n(...)"
fr: Convertion de plusieurs « klocale->translate(...) » en « i18n(...) »

source: target "make messages" works again
fr: La cible « make messages » fonctionne maintenant.

source: converter for menus.config, creates a dummy .cpp-file that is handled by i18n
fr: Convertion de menus.config pour la création d'une maquette d'un fichier « .ccp » qui sera utilisé pour l'internationalisation.

source: new target "make rpm" creates binary and source RPM packages
fr: Nouvelle cible « make rpm » pour la création d'un exécutable et d'un paquetage RPM.

source: fixed the shared-library-problem in the build system
fr: Correction de problèmes concernant le partage de bibliothèques dans la construction du programme.

source: menu items can belong to groups
fr: Les éléments des menus peuvent appartenir à des sous-groupes.

source: renamed SignalWidget::info to "refresh"
fr: Renomage de « SignalWidget::info »en « refresh ».

source: many cleanups in the header-Files in src and libgui
fr: Plusieurs suppressions dans les fichiers d'en-tête dans les dossiers « src » et « libgui ».

source: the menu management has completely been rewritten:
fr: Le contrôle des menus a été complètement ré-écrit :

source: Menu, NumberedMenu and MenuCommand classes are deleted
fr: Les menus « NumberedMenu » et « MenuCommand » ont été supprimé.

source: new classes: MenuNode, MenuItem, MenuSub, MenuToplevel and MenuRoot
fr: Nouvelles classes : « MenuNode », « MenuItem », « MenuSub », « MenuToplevel » et « MenuRoot ».

source: menu items can have icons
fr: Les items des menus peuvent avoir des icônes.

source: menu nodes can have unique string ids
fr: Les liens des menus n'ont qu'un seul identifiant de chaîne de caractères.

source: special menu commands start with a "#"
fr: Les commandes spéciales des menus commencent par un « # ».

source: first attempts for internationalization
fr: Première introduction de l'internationalisation.

source: list of recent files is sorted by time of last usage
fr: La liste des fichiers récemment ouverts est triée par la date de leur dernière utilisation.

source: moved my modifications from the Makefiles to Makefile.am
fr: Déplacement de mes modifications du fichier Makefiles dans le fichier Makefile.am.

source: included targets "make release", "make patchlevel" and some scripts
fr: Ajout des cibles « make release », « make patchlevel », et quelques autres scripts.

source: 1999-12-19 (by Thomas.Eschenbacher@gmx.de)
fr: 1999-12-19 (par Thomas.Eschenbacher@gmx.de)

source: remade my modifications of some Makefiles and of the configure script that were lost during Martin's changes
fr: Reconstruction de mes modifications pour quelques Makefiles et pour le script .configure qui ont été perdues lors des changements réalisées par Martin.

source: changed shortcut for mixpaste from CTRL-SHIFT-X to CTRL-SHIFT-C
fr: Changement des raccourcis clavier CTRL-SHIFT-X en CTRL-SHIFT-C pour les opérations de mixages.

source: added the "crop" command to the edit menu
fr: Ajout de la fonction de « couper à la sélection » dans le menu édition.

source: made the "mixpaste" command work
fr: Construction de la fonction de « mixage par copier / coller ».

source: corrected the call of "delete", now really deletes instead of cutting and copying the selection to the clipboard (saves clipboard content)
fr: Correction de l'appel « supprimer », qui maintenant supprime réellement des données au lieu de couper et copier la sélection dans le presse-papiers (sauvegarde du contenu du presse-papiers).

source: 1999-12-18 (by mwilz@ernie.mi.uni-koeln.de)
fr: 1999-12-18 (par mwilz@ernie.mi.uni-koeln.de)

source: changed filenames to reflect class names
fr: Changement des noms de fichiers en correspondance avec les noms des classes.

source: one class per file is now the standard
fr: Une classe par fichier est maintenant le standard.

source: stripped leading "Kwave" in Classnames for most Classes
fr: Ajout à plusieurs noms de classes du suffixe « Kwave ».

source: 1999-12-10 (by Thomas.Eschenbacher@gmx.de)
fr: 1999-12-10 (par Thomas.Eschenbacher@gmx.de)

source: removed -Werror compiler option (caused trouble with configure script)
fr: Suppression de l'option de compilation « -Werror » (problème avec le script de configuration).

source: fixed a nasty bug in SignalManager::save that caused crashes on several positions in the program and libstdc++
fr: Correction d'un bogue complexe dans « SignalManager::save » qui arrête anormalement l'application et la libstdc++.

source: 1999-12-09 (by Thomas.Eschenbacher@gmx.de)
fr: 1999-12-09 (par Thomas.Eschenbacher@gmx.de)

source: gave the destructor of SignalManager some code, this fixes a huge memory leak !
fr: Correction d'un bogue de perte de mémoire concernant le destructeur de la classe « SignalManager ».

source: added a TODO file
fr: Ajout d'un fichier TODO.
