Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: save under a different name with <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>Ctrl</keycap><keycap>S</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Save</guimenuitem><guimenuitem>As</guimenuitem> </menuchoice>
fr: Sauvegarder le fichier courant avec un nom différent via le menu <menuchoice><shortcut><keycombo><keycap>Shift</keycap><keycap>Ctrl</keycap><keycap>S</keycap></keycombo></shortcut><guimenu>Fichier</guimenu><guimenuitem>Sauvegarder</guimenuitem><guimenuitem>Dans...</guimenuitem></menuchoice>.

source: or only the current selection with <menuchoice> <guimenu>File</guimenu><guimenuitem>Save</guimenuitem><guimenuitem>Selection</guimenuitem> </menuchoice>
fr: Sauvegarder la sélection courante d'un fichier sonore via le menu <menuchoice><guimenu>Fichier</guimenu><guimenuitem>Sauvegarder</guimenuitem><guimenuitem> Sélection...</guimenuitem></menuchoice>.

source: &kapp; supports the following file formats:
fr: &kapp; supporte les formats de fichiers suivants :

source: The favourite file format of &kapp; is (like you can guess from the name) <filename>.wav</filename>. This format is very common to other "operating systems" and also is commonly used within the KDE environment.
fr: Le meilleur format de fichier pour &kapp; est (comme l'indique le nom de l'application) « .wav ». Ce format est très commun vis-à-vis d'autre « systèmes d'exploitation » mais aussi pour l'environnement de bureau KDE.

source: <filename>.mp3</filename> and <filename>.mp2</filename> import is available through <ulink url="http://www.mars.org/home/rob/proj/mpeg/">libmad</ulink> for the MP3 decoding in combination with <ulink url="http://www.id3lib.org/">id3lib</ulink> for decoding ID3 tags.
fr: <filename>.mp3</filename> et <filename>.mp2</filename> pour l'importation est disponible grâce à la bibliothèque <ulink url="http://www.mars.org/home/rob/proj/mpeg/">libmad</ulink> pour le décodage des fichiers MP3 en combinaison avec la bibliothèque <ulink url="http://www.id3lib.org/">id3lib</ulink> pour le décodage des marquages ID3.

source: Ogg/Vorbis (<filename>*.ogg</filename>) import and export. See <ulink url="http://www.xiph.org">http://www.xiph.org</ulink> for details.
fr: Ogg / Vorbis (<filename>*.ogg</filename>) pour l'importation et l'exportation. Voir l'URL <ulink url="http://www.xiph.org">http://www.xiph.org</ulink> pour plus de détails.

source: Additionally &kapp; supports many other common formats through the <ulink url="http://freeware.sgi.com/Installable/audiofile-0.2.3.html">audiofile</ulink> plugin. You can import files like <filename>*.au</filename> and <filename>*.snd</filename> (NeXT,Sun Audio), <filename>*.aiff</filename> (Audio Interchange Format) and <filename>*.sf</filename> (Berkeley,IRCAM,Carl Sound Format).
fr: En plus, &kapp; supporte plusieurs autres formats audio très communs via la bibliothèque <ulink url="http://freeware.sgi.com/Installable/audiofile-0.2.3.html">audiofile</ulink>. Vous pouvez importer les fichiers du type <filename>*.au</filename> et <filename>*.snd</filename> (NeXT, Sun Audio), <filename>*.aiff</filename> (Audio Interchange Format) et <filename>*.sf</filename> (Berkeley, IRCAM,Carl Sound Format).

source: &kapp; allows you to select a continuous range of samples as well as any combination of channels (if you edit a multi-channel file). By selecting a range of samples (time scope) all following commands will be limited to that range and by de-selecting a channel it's content will not be changed.
fr: &kapp; permet de sélectionner une plage sonore continue sur plusieurs combinaisons de canaux sonores (si vous éditez un fichier constitué de canaux multiples). Toutes les actions futures qui suivront la sélection d'une plage d'échantillons (suivant l'axe du temps) opéreront uniquement sur la sélection. Si un canal n'est pas activé avant la sélection, son contenu ne sera pas modifié.

source: green lamb
fr: Lumière verte

source: a green lamb means "enabled", whereas
fr: Un témoin vert indique que le canal est « actif ».

source: red lamb
fr: Lumière rouge

source: a red lamb means "disabled".
fr: Un témoin rouge indique que le canal est « inactif ».

source: If you select a range of samples in &kapp;, that range will be <emphasis>inclusive</emphasis>. That means that the first and the last selected sample both belong to the selection and will be used for the following actions. So even if you not selected a <emphasis>range</emphasis> but only a single sample, the selection will never be really "empty". So for example if you see no selected range, the "delete" function applies to that single sample.
fr: Si vous sélectionnez une plage d'échantillons dans &kapp;, cette plage sera <emphasis>prioritaire</emphasis>. En effet, tous les échantillons de la sélection seront utilisés en priorité pour les actions futures de l'utilisateur. D'autre part, si vous n'avez pas sélectionné une <emphasis>plage</emphasis> mais seulement un échantillon unique, celui-ci représentera la sélection (celle-ci n'étant pas considérée comme étant « vide »). Par exemple, si vous n'avez pas sélectionné une plage mais juste un échantillon, la fonction « Supprimer » appliquera les modifications uniquement sur ce dernier.

source: &kapp; unfortunately has to implement and use it's own clipboard. This is due to the lack of support for formats other than text and bitmaps in the KDE environment and might be solved in some future release.
fr: Malheureusement, &kapp; ne dispose pas encore d'une implémentation évoluée du presse papier. Ceci est dû à un manque de support des formats différents au texte et aux bitmaps dans KDE. Cette situation changera probablement dans un futur proche.

source: However, this has some disadvantages. So if you want to exchange data between two &kapp; instances through the clipboard, you will find out that this is simply not possible. Each instance of &kapp; uses it's own clipboard and so that can't work.
fr: Cependant, ceci présente quelques désavantages. Il est impossible d'échanger des données entre deux instances de &kapp; via le presse papier. En effet, chaque instance de &kapp; dispose de sa propre instance du presse papier pour travailler.

source: So if you want to make use of the clipboard in &kapp;, you should only start <emphasis>one</emphasis> &kapp; instance and use multiple &kapp; windows. That's the way it works!
fr: Si vous voulez utiliser le presse papier dans &kapp;, vous devez seulement lancer <emphasis>une</emphasis> seule instance de &kapp; et utiliser plusieurs fenêtres de &kapp; à partir de cette même instance. Normalement cela fonctionne !

source: Drag and Drop
cs: Táhnout a pustit
es: Arrastrar y soltar
fr: Le glisser / déposer

source: &kapp; supports the KDE Drag and Drop protocol. This enables you to open files just by picking them up in a <command>konqueror</command> window or the Desktop and let them drop into a window of &kapp;.
fr: &kapp; supporte les fonctionnalités de glisser / déposer de l'environnement de bureau KDE. Cela doit vous permettre d'ouvrir par exemple un fichier audio en le sélectionnant à partir de <command>konqueror</command> et en le déposant dans l'espace de travail de &kapp;.

source: Please note that if you drop a file into a &kapp; window that already contains an opened file, the currently opened file will be closed first and then the file you dropped will be opened in it. If you don't want that, you should open a new empty &kapp; window first.
fr: Veuillez noter que si vous déposez un fichier audio dans l'espace de travail de &kapp; alors qu'un fichier audio est déjà ouvert, ce dernier sera fermé en premier avant l'ouverture du fichier à déposer. Si vous vous ne voulez pas que le fichier précédemment ouvert soit fermé, vous devez ouvrir une autre fenêtre de &kapp; afin d'y recevoir le fichier à ouvrir.

source: You can also select a range of samples and drag or drop them into a &kapp; window. Per default the drag operation is done in <emphasis>move</emphasis> mode where the selected range is deleted from the original place and inserted at the drop position. By pressing the <keycap moreinfo="none">Ctrl</keycap> key you can modify this and drag in <emphasis>copy</emphasis> mode instead.
fr: Vous pouvez aussi faire une sélection dans un fichier sonore et faire un glisser / déposer à un autre endroit dans l'espace de travail de &kapp;. Par défaut, la sélection est <emphasis>déplacée</emphasis> de son emplacement d'origine et elle est insérée à l'emplacement ou on la dépose. En appuyant sur la touche <keycap moreinfo="none">Ctrl</keycap> vous pouvez modifier ce comportement pour <emphasis>copier</emphasis> la sélection.

source: Developer's Guide to &kapp;
fr: Le guide du développeur de &kapp;

source: Sorry, this chapter is still to be written... At the moment the source code is nearly completely documented with tags suitable with the KDE documentation tools. We currently prefer using <ulink url="http://www.stack.nl/~dimitri/doxygen">doxygen</ulink>. Maybe some day we will spend some time for writing a tool that converts the doxygen output into something we can include into the docbook source (the source this page has been built of).
fr: Désolé, mais ce chapitre n'est pas encore écrit... Pour le moment, le code source n'est pas encore documenté avec les outils de rédaction de documentation fournis avec KDE. Nous préférons utiliser le logiciel <ulink url="http://www.stack.nl/~dimitri/doxygen">doxygen</ulink>. Peut être que dans quelques temps un utilitaire pourra convertir les annotations faites avec le programme « doxygen » vers un document au format « Docbook » (Le source de cette aide a été faite de cette manière).

source: If you want to write a plugin, contribute something to this project (or maybe write the converter mentioned above), please feel free to contact one of the authors directly and / or subscribe to the &kapp; <link linkend="mailing-list">mailing list</link>. Help is always welcome!
fr: Si vous voulez écrire un module externe, contribuer au projet (ou peut être écrire un outil de conversion mentionné précédemment), veuillez prendre contact directement avec un des auteurs et / ou vous enregistrer sur la <link linkend="mailing-list">liste de diffusion</link> de &kapp;. De l'aide est toujours la bienvenue !

source: What do I need to compile &kapp;?
fr: De quoi ai je besoin pour compiler &kapp; ?

source: Read in the <link linkend="requirements">chapter</link> mentioned before. It compiles with gcc-2.95 and gcc-3.3 as well.
fr: Lisez les informations à ce <link linkend="requirements">chapitre</link>. Il peut être compilé avec les compilateurs « gcc-2.95 » ou « gcc-3.3 ».

source: Which sound cards does &kapp; support?
fr: Qu'elles sont les cartes sons supportées par &kapp; ?

source: &kapp; does not need support for any special sound card. The sound card only has to be supported by your operating system and &kapp; uses it's interface to the operating system's sound driver through a standard interface. So &kapp; can play on any sound card that KDE is able to play on.
fr: &kapp; ne supporte pas une carte sonore en particulier. La carte sonore est supportée par le système d'exploitation et &kapp; est une interface graphique pour le driver de la carte qui l'utilise de manière standard. Bien sur, &kapp; peut lire des pistes sonores sur toutes les cartes sonores reconnues par KDE.

source: Why are some menu entries / features always disabled?
fr: Pourquoi certaines entrées des menus ou certaines fonctionnalités sont désactivées ?

source: This is just because we decided that those actions are not working stable enough to present them to the normal user and therefore disabled them to avoid trouble. You will get access to them if they are tested and stable enough.
fr: Toutes les actions qui nécessitent des fonctionnalités en cours de développement ont été désactivées car elles sont encore considérées comme instables. Elles seront progressivement activées au fur et à mesure de l'avancement des développements.

source: Why does &kapp; consume more memory than it can be expected from the size of the opened file?
fr: Pourquoi &kapp; utilise plus de mémoire système que celle nécessaire pour stocker un fichier sonore ?

source: The reason for this is that &kapp; internally stores all samples in 32-bit integers. This was easy to program, made the application faster and a bit more reliable. So if you load an 8-bit file with about one megabyte it will consume about four megabytes. Maybe we will change this somewhere in the future...
fr: &kapp; stocke tous les échantillons en interne avec des entiers codés sur 32 bits. Cela facilite la programmation, et génère une application plus rapide et plus stable. Si vous chargez un fichier sonore codé sur 8 bits d'une taille de 1 Mo, il représentera environ 4 Mo en mémoire. Cette caractéristique évoluera peut être dans le futur...

source: Which sound formats does &kapp; support?
fr: Quels sont les formats de fichiers sonores supportés par &kapp; ?

source: What if I have files with a format not supported by &kapp;?
fr: Quels sont les formats de fichiers qui ne sont pas supportés par &kapp; ?

source: If you have to work on an other format, you can convert it into .wav format. A good set of tools for this is in the <ulink url="http://home.sprynet.com/~cbagwell/sox.html">SoX</ulink> package, they have also some nice documentation!
fr: Si vous désirez travailler sur d'autres formats de fichiers sonores, vous pouvez les convertir au format WAVE. Un bon jeu d'utilitaires pour la manipulation des fichiers sonores est le paquetage <ulink url="http://home.sprynet.com/~cbagwell/sox.html">SoX</ulink>. Il est accompagné d'une très bonne documentation !

source: Maybe you have choosen a combination of playback rate and sample size that is not supported by your sound driver and / or sound hardware. Try playback with 8 bits per sample and mono first, this should always work. Then try to increase the bits per sample and stereo playback step by step. Note that some playback rates are not at all supported by some sound hardware.
fr: Peut être avez vous choisi une combinaison entre le taux d'échantillonnage et la taille des échantillons qui n'est pas supportée par le pilote de la carte sonore ou par le materiel. Essayez une lecture avec des échantillons sur 8 bits et en mono, cela devrait normalement fonctionner. Si c'est le cas, essayez d'augmenter le nombre de bits par échantillon et de passer en stéréo. Noter que certaine carte sonore ne supporte pas certaine résolution d'échantillonnage.

source: Maybe you have forgotten to increase the volume of the playback channel. &kapp; is not responsible for changing the playback volume.
fr: Peut être avez vous oubliez d'augmenter le volume de votre carte sonore. &kapp; ne contrôle pas directement le niveau du volume sonore.

source: The reason for this is that the sound driver already has received some playback data from &kapp; at the moment when you press the stop button. Decrease the size of the playback buffer and it should react faster (but makes interruptions more probable).
fr: La raison est que le périphérique de la carte sonore reçoit encore des données à jouer en provenance de &kapp; au moment où vous appuyez sur STOP. Diminuer la taille du buffer de lecture pour avoir une réaction plus rapide du programme (des problèmes de lecture sont cependant à envisager).

source: Sorry, currently we don't have direct support for ALSA, but since version 0.6 &kapp; has support for <ulink url="http://www.arts-project.org/">aRts</ulink>, which can use ALSA.
fr: Désolé, mais actuellement il n'y a pas de support direct des drivers ALSA, mais depuis la version 0.6 de &kapp; le programme supporte l'interface <ulink url="http://www.arts-project.org/">aRts</ulink>, qui peut utiliser les drivers ALSA.

source: What about playback with 24 and 32 bits per sample or more than two channels?
fr: Qu'en est-il de la lecture de fichiers sonores sur 24 et 32 bits par échantillons ou avec plus de 2 pistes sonores ?

source: This is another feature that might get implemented in <ulink url="http://www.arts-project.org/">aRts</ulink>, so we wait for aRts to support it.
fr: Ceci est une autre caractéristique qui doit être implémentée dans l'interface <ulink url="http://www.arts-project.org/">aRts</ulink>. Il faut attendre que cette fonctionnalité soit opérationnelle.

source: Not for the moment, but maybe MP3 import / export already is on the TODO list at a very high position.
fr: Pas pour le moment, mais peut être que l'importation / exportation est déjà dans la liste TODO à un niveau de priorité important.

source: Program copyright from 1998-2000 Martin Wilz <email>mwilz@ernie.mi.uni-koeln.de</email>
fr: Programme sous copyright de 1998 à 2000 Martin Wilz <email>mwilz@ernie.mi.uni-koeln.de</email>

source: Contributors / Authors:
fr: Contributions / Auteurs :

source: Sven-Steffen Arndt <email>ssa29@gmx.de</email> (homepage, german translation)
fr: Sven-Steffen Arndt <email>ssa29@gmx.de</email> (page web, traductions en Allemand)

source: Ralf Waspe <email>rwaspe@web.de</email> (Help/About plugin)
fr: Ralf Waspe <email>rwaspe@web.de</email> (Boîte de dialogue « A propos de »)

source: Dave Flogeras <email>dflogera@nbnet.nb.ca</email> (Notch Filter plugin)
fr: Dave Flogeras <email>dflogera@nbnet.nb.ca</email> (module externe « notch_filter »)

source: Martin Kuball <email>makube@user.sourceforge.net</email> (beta tester)
fr: Martin Kuball <email>makube@user.sourceforge.net</email> (bêta testeur)

source: Aurelien Jarno <email>aurel32@debian.org</email> (<ulink url="http://www.debian.org">debian</ulink> packager)
fr: Aurelien Jarno <email>aurel32@debian.org</email> (Paquetage pour la distribution <ulink url="http://www.debian.org">debian</ulink>)

source: Thanks to (in alphabetical order):
fr: Remerciements (par ordre alphabétique) :

source: Matthias Düsterhöft <email>duesti@gmx.de</email> <emphasis> (for information about RPM optimization) </emphasis>
fr: Matthias Düsterhöft <email>duesti@gmx.de</email> <emphasis> (pour toutes les informations concernant les optimisations sur les RPM) </emphasis>

source: my wife Ximena González<emphasis> (for her patience)</emphasis>
fr: Ma femme Ximena González<emphasis> (pour toute sa patience)</emphasis>

source: T.H.F. Klok and Cedric Tefft (maintainers of the <ulink url="http://www.id3lib.org/"> id3lib</ulink> library)
fr: T.H.F. Klok et Cedric Tefft (mainteneurs de la bibliothèque <ulink url="http://www.id3lib.org/"> id3lib</ulink>)

source: Erik de Castro Lopo <email>erikd@zip.com.au</email> (author of the <ulink url="http://www.mega-nerd.com/libsndfile/">sndfile</ulink> library)
fr: Erik de Castro Lopo <email>erikd@zip.com.au</email> (auteur de la bibliothèque <ulink url="http://www.mega-nerd.com/libsndfile/">« sndfile » </ulink>)

source: Michael Pruett <email>mpruett@sgi.com</email> (author of the <ulink url="http://freeware.sgi.com/Installable/audiofile-0.2.3.html">audiofile</ulink> library)
fr: Michael Pruett <email>mpruett@sgi.com</email> (auteur de la bibliothèque <ulink url="http://freeware.sgi.com/Installable/audiofile-0.2.3.html"> « audiofile »</ulink>)

source: The current code contains some FFT routines and code fragments from the GNU Scientific Library project <ulink url="http://sources.redhat.com/gsl/">http://sources.redhat.com/gsl/</ulink>.
fr: Le code courant du logiciel contient des routines de Transformées de Fourrier et des morceaux de programme issus du projet « GNU Scientific Library » que l'on peut consulter à l'adresse <ulink url="http://sources.redhat.com/gsl/">http://sources.redhat.com/gsl/</ulink>.

source: record
cs: Nahrávat
es: grabación

source: playback
cs: Přehrávání
es: reproducción

source: GIT Repository<anchor id="git-repository"/>
cs: Skladiště Git<anchor id="git-repository"/>
es: Repositorio GIT<anchor id="git-repository"/>

source: Installation
cs: Instalace
es: Instalación

source: For example, assuming that your sources are already unpacked in <filename><replaceable>$HOME/src/kwave-&version;</replaceable></filename>, you can do the following: <screen width="50" format="linespecific"> <prompt>% </prompt><command>mkdir /tmp/kwave-build</command> <prompt>% </prompt><command>cd /tmp/kwave-build</command> <prompt>% </prompt><command>cmake <replaceable>$HOME/src/kwave-&version;</replaceable> <replaceable>[build options]</replaceable></command> <prompt>% </prompt><command>make</command> <prompt>% </prompt><command>su root -c "make install"</command> </screen> (Specifying build options is a way to enable or disable specific features. See the following section for descriptions)
cs: Například v případě, že vaše zdrojové soubory jsou již rozbaleny v <filename><replaceable>$HOME/src/kwave-&version;</replaceable></filename>, můžete udělat následující: <screen width="40" format="linespecific"> <prompt>% </prompt><command>mkdir /tmp/kwave-build</command> <prompt>% </prompt><command>cd /tmp/kwave-build</command> <prompt>% </prompt><command>cmake <replaceable>$HOME/src/kwave-&version;</replaceable> <replaceable>[build options]</replaceable></command> <prompt>% </prompt><command>make</command> <prompt>% </prompt><command>su root -c "make install"</command> </screen> (Určení voleb pro sestavení programu je způsobem, jak umožnit, nebo znemožnit zvláštní funkce. Kvůli jejich popisu si prohlédněte následující sekci.)
es: Por ejemplo, asumiendo que las fuentes han sido desempaquetadas en <filename><replaceable>$HOME/src/kwave-&version;</replaceable></filename>, puede hacer lo siguiente: <screen width="50" format="linespecific"> <prompt>% </prompt><command>mkdir /tmp/kwave-build</command> <prompt>% </prompt><command>cd /tmp/kwave-build</command> <prompt>% </prompt><command>cmake <replaceable>$HOME/src/kwave-&version;</replaceable> <replaceable>[opciones de compilación]</replaceable></command> <prompt>% </prompt><command>make</command> <prompt>% </prompt><command>su root -c "make install"</command> </screen> (Especificar opciones de compilación es una manera de activar o desactivar ciertas características. Vea la siguiente sección para una descripción detallada)

source: <prompt>% </prompt><command>cmake <replaceable>[source directory]</replaceable> -DWITH_MP3=ON <replaceable>[other options...]</replaceable></command>
cs: <prompt>% </prompt><command>cmake <replaceable>[zdrojový adresář]</replaceable> -DWITH_MP3=ON <replaceable>[další volby...]</replaceable></command>
es: <prompt>% </prompt><command>cmake <replaceable>[directorio fuente]</replaceable> -DWITH_MP3=ON <replaceable>[otras opciones...]</replaceable></command>
