Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: Go to your RPM "topdir". This normally is <filename>/usr/src/redhat</filename> for the redhat distribution or <filename>/usr/src/packages</filename> if you have the SuSE distribution.
cs: Jděte do svého RPM "topdir". Obvykle se nachází v <filename>/usr/src/redhat</filename> v případě distribuce redhat nebo <filename>/usr/src/packages</filename> jestliže máte distribuci SuSE.
de: Gehen Sie zu ihrem RPM "Hauptverzeichnis", welches normalerweise <filename>/usr/src/redhat</filename> für die Redhat Distribution oder <filename>/usr/src/packages</filename> für die SuSE Distribution ist.
es: Dirígase al directorio donde se almacen los RPM. Normalmente es <filename>/usr/src/redhat</filename> para distribuciones redhat o <filename>/usr/src/packages</filename> para SUSE.
fr: Aller dans le dossier « principal » de stockage des RPM de votre système. Normalement, celui-ci est <filename>/usr/src/redhat</filename> pour une distribution du type RedHat ou <filename>/usr/src/packages</filename> pour la distribution SuSE.

source: Put the tar.bz2 archive into the SOURCES subdirectory (you have to replace "somewhere" with the real directory where the files are, of course).
cs: Zkopírujte tar.bz2 archiv do SOURCES podadresáře (samozřejmě musíte nahradit "kdekoli" skutečným adresářem, v němž jsou soubory).
de: Kopieren Sie das tar.bz2 Archiv in das SOURCES Unterverzeichnis (ersetzen Sie "somewhere" durch das reale Verzeichnis, in dem die Dateien enthalten sind).
es: Coloque el archivo tar.bz2 en el subdirectorio SOURCES (tiene que remplazar "somewhere" con el nombre real del directorio donde está los archivos).

source: Extract the spec file from the archives and put it into the SPEC subdirectory.
cs: Získejte z archivu soubor spec a vložte jej do podadresáře SPEC
de: Extrahieren Sie die spec-Datei aus dem Archiven und fügen Sie diese dem SPEC-Unterverzeichnis hinzu.
es: Extraiga el archivo spec del archivo tar.bz2 y coloquelo dentro del subdirectorio SPEC.
fr: Extraire le fichier de spécification (.spec) de l'archive au format « .tar.gz » et copier le dans le sous-dossier SPEC.

source: Let rpm do the compile job and generate the rpm of &kwave;. If you only want to make a binary package, you can specify <literal>-bb</literal> instead of <literal>-ba</literal>, or just <literal>-bs</literal> to build only a source package.
cs: Nechte rpm provést kompilaci a vytvořte rpm z &kwave;. Pokud chcete pouze udělat binární balíček, můžete přesně určit <literal>-bb</literal> namísto <literal>-ba</literal>, nebo jen <literal>-bs</literal>
de: Lassen Sie rpm den Kompiliervorgang und die Generierung des &kwave; RPMs ausführen. Wenn Sie nur ein binary Paket erstellen wollen, dann können Sie <literal>-bb</literal> anstelle von <literal>-ba</literal> angeben, oder einfach <literal>-bs</literal> um nur ein Quell-Paket zu erstellen.
es: Permita a rpm realizar la compilación y generación del rpm de &kwave;. Si sólo desea crear un paquete binario puede especificar <literal>-bb</literal> en vez de <literal>-ba</literal>, o simplemente <literal>-bs</literal> para crear un paquete fuente.

source: If everything was ok, you can install the binary rpm of &kwave;, it will be in the BUILD directory. If you already have a version of &kwave; installed, please remove it first or use the parameter <literal>-U</literal> instead of <literal>-i</literal> for upgrading instead of installing.
cs: Pokud vše proběhlo dobře, můžete nainstalovat binární rpm z &kwave;, bude v adresáři BUILD. Pokud již máte nainstalovánu verzi &kwave; odstraňte,prosím, nejprve ji, nebo použijte pomocnou proměnnou <literal>-U</literal> namísto <literal>-i</literal> kvůli aktualizaci místo instalace.
de: Wenn alles fehlerfrei verlief, können Sie das binär-rpm von &kwave; installieren, welches sich dann im BUILD Verzeichnis befindet. Wenn Sie bereits eine Version von &kwave; installiert haben, dann entfernen Sie diese zuerst oder verwenden den Parameter <literal>-U</literal> anstelle von <literal>-i</literal> für eine Aktualisierung anstelle einer Installation.
es: Si todo ha salido correctamente puede instalar el binario rpm de &kwave;, se encontrará en el directorio BUILD. Si ya dispone de una versión de &kwave; instalada, por favor, elimínela primero o use el parámetro <literal>-U</literal> en vez de <literal>-i</literal> para actualizar en vez de instalar.

source: Building RPM packages from GIT
cs: Tvoření RPM balíčků z Git
de: Erstellung eines RPM Paketes aus GIT
es: Creando paquetes RPM a partir de GIT

source: Checking out the sources
cs: Stažení zdrojů
de: Abrufen der Quellen
es: Obteniendo las fuentes
fr: La vérification des mises à jour des sources

source: For initially checking out the sources you will need some disk space (about 25 megabytes) in a directory of your choice, the git package of your favorite distribution and full access to the internet. If you get error messages about rejected connections you either have typed something wrong or your provider doesn't give you full access. A good place for the source files will be <filename>"$HOME/src"</filename>.
cs: Pro počáteční stažení zdrojů budete potřebovat prostor na disku (asi 25 MB) v adresáři dle vašeho výběru, git balíček vaší oblíbené distribuce a plný přístup na internet.Pokud obdržíte hlášení chyb o odmítnutém spojení, buď jste něco zadal nesprávně, nebo vám váš poskytovatel nedal plný přístup. Dobrým místem pro zdrojové soubory bude <filename>"$HOME/src"</filename>.
de: Beim erstmaligen Abrufen der Quellen brauchen Sie etwas Festplattenspeicher (etwa 25 Megabytes) in einem Verzeichnis Ihrer Wahl, das git-Paket ihrer bevorzugten Distribution und vollen Zugang zum Internet. Wenn Sie Fehlermeldungen über abgelehnte Verbindungen erhalten, haben Sie entweder etwas falsches eingegeben oder Ihr Provider gestattet ihnen nicht den vollen Zugriff. Ein guter Platz für die Quelldateien ist <filename>"$HOME/src"</filename>.
es: Para obtener las fuentes necesitará un espacio libre (sobre unos 25 megabytes) en un directorio de su elección, el paquete git de su distribución y acceso a internet. Si obtiene mensajes de error sobre conexiones rechazadas entonces ha escrito algo mal o su proveedor no le proporciona acceso completo. Un buen lugar para las archivos de las fuentes puede ser <filename>"$HOME/src"</filename>.

source: First create the directory that will receive the subdirectoy with &kwave; sources and change into it:
cs: Nejprve vytvořte adresář, který přijme podadresář s &kwave; zdroji, a přemístěte se do něj:
de: Als erstes erstellen Sie ein Verzeichnis, welches das Unterverzeichnis der &kwave;-Quellen erhalten wird und wechseln Sie in dieses:
es: Primero cree un directorio que contendrá el subdirectorio de las fuentes de &kwave; y cambiese a él:

source: Then check out the latest sources from the GIT server:
cs: Potom stáhněte poslední zdroje z Git serveru:
de: Danach rufen Sie die aktuellen Quellen von einem GIT-Server ab:
es: Obtenga las últimas fuentes desde el servidor GIT:

source: There <emphasis>must not</emphasis> be a directory named <filename>kwave</filename> under the directory you want to check out. Otherwise the git program will complain about already existing files and the checkout will not work.
cs: Nesmí tu být <emphasis>žádný</emphasis> nazvaný <filename>kwave</filename> v adresáři, který chcete stahovat. Jinak si bude program Git stěžovat na již existující soubory a načtení nebude pracovat.
de: Es darf <emphasis>kein</emphasis> Verzeichnis mit dem Namen <filename>kwave</filename> unter des Verzeichnisses existieren in dem Sie abrufen wollen. Ansonsten würde sich das git-Programm über bereits existierende Dateien beschweren und das Abrufen wird nicht funktionieren.
es: <emphasis>No debe</emphasis> existir un directorio denominado <filename>kwave</filename> en el directorio en el cual quiere descargar las fuentes. Si existe tal directorio el programa git se quejará de la existencia de archivos y la descarga de las fuentes no tendrá lugar.

source: Updating fresh sources from GIT
cs: Aktualizace zdrojů z Git
de: Aktualisierung der Quellen mittels GIT
es: Actualizando fuentes desde GIT

source: If you think that you have messed up your local source tree or if there are conflicts during updating and you want to start through from a clean state, you can do the following to discard all local changes and switch back to the latest version from the master branch:
cs: Pokud máte dojem, že jste zmrvil obsah svých místní zdrojových adresářů kwave, nebo když jste během aktualizace zaznamenal konflikty, nebo chcete začít s čistým stavem, můžete pro zahození všech místních změn udělat následující a přepnout se zpět do poslední verze z hlavní větve:
de: Wenn Sie der Meinung sind dass der Inhalt Ihres lokalen &kwave;-Quellenverzeichnisses durcheinander geraten ist, oder wenn es beim Aktualisieren Konflikte gegeben hat, so können Sie mit den folgenden Befehlen alle lokalen Änderungen verwerfen und auf die letzte Version des Hauptzweiges zurückgehen:
es: Si piensa que ha estropeado la estructura local de las fuentes o si hay conflictos durante la actualización o desea comenzar desde un estado limpio, puede escribir los siguientes comandos para descartar todos los cambios locales y regresar a la última versión de la rama maestra:

source: Compiling
cs: Kompilace
de: Kompilieren
es: Compilando
fr: La compilation

source: Building rpm package from a GIT snapshot is quite simple. The procedure is nearly the same as described in the last section, so it unhappily also has the same problem with the <command>rpmbuild -ta</command> command our method internally uses. Like in the previous chapter, <replaceable>[arch]</replaceable> stands for the platform you have Built the package and might be something like <literal>i386</literal>, <literal>i586</literal>, <literal>sparc</literal> or whatever, <replaceable>XXX</replaceable> stands for the version number you have checked out.
cs: Sestavení rpm balíčku ze snímku Git je docela jednoduché. Postup je téměř totožný s tím, který byl popsán v posledním oddíle, takže má naneštěstí také ten samý problém s příkazem <command>rpmbuild -ta</command>, který naše metoda uvnitř používá. Tak jako v předchozí kapitole, <replaceable>[arch]</replaceable> stojí na platformě, pro kterou jste balíček sestavil, a která může být např. <literal>i386</literal>, <literal>i586</literal>, <literal>sparc</literal> či jakákoli jiná, <replaceable>XXX</replaceable> zastupuje číslo verze, kterou jste stáhl.
de: Das Erstellen eines rpm-Pakets aus einem GIT-Abbild ist recht einfach. Das Vorgehen ist fast die gleiche wie im letzten Abschnitt beschrieben. Deshalb existiert unglücklicherweise auch das gleiche Problem mit dem <command>rpmbuild -ta</command> Befehl, den unsere Methode intern benutzt. Wie im vorhergehenden Kapitel steht <replaceable>[arch]</replaceable> für die Plattform des zu erstellenden Paketes und sollte <literal>i386</literal>, <literal>i586</literal>, <literal>sparc</literal> oder ähnliches sein. <replaceable>XXX</replaceable> steht für die Versionsnummer, die Sie heruntergeladen haben.
es: Crear un paquete rpm desde una instantánea GIT es bastante sencillo. El procedimiento es casi el mismo que se describió en la última sección, por lo que desafortunadamente tiene el mismo problema con el comando <command>rpmbuild -ta</command> que usa nuestro método internamente. Como en el anterior capítulo, <replaceable>[arch]</replaceable> hace referencia a la plataforma para la que está creando el paquete y podría ser algo como <literal>i386</literal>, <literal>i586</literal>,<literal>sparc</literal> o cualquier otra, <replaceable>XXX</replaceable> hace referencia a la versión que ha obtenido.

source: <emphasis>Note for SuSE users: </emphasis> here you have to specify the directory <filename>/usr/src/packages</filename> instead of <filename>/usr/src/redhat</filename> too!
cs: <emphasis>Poznámka pro uživatele SuSE: </emphasis> Zde musíte rovněž určit adresář <filename>/usr/src/packages</filename> namísto <filename>/usr/src/redhat</filename>!
de: <emphasis>Hinweis für SuSE Benutzer: </emphasis> hier müssen Sie auch das Verzeichnis <filename>/usr/src/packages</filename> anstelle von <filename>/usr/src/redhat</filename> angeben!
es: <emphasis>Nota para usuarios de SUSE: </emphasis> aqui también tiene que especificar el directorio <filename>/usr/src/packages</filename> en vez de <filename>/usr/src/redhat</filename>
fr: <emphasis>Pour les utilisateurs de la distribution SuSE LINUX : </emphasis> vous devez également indiquer le nom du dossier de stockage des paquetages en remplaçant <filename>/usr/src/packages</filename> par <filename>/usr/src/redhat</filename> !

source: Assuming that you are in the root of where you checked out from GIT, do the following to create a Makefile, the &kwave; package and install it. If you already have a version of &kwave; installed, please remove it first or use <command>rpm -U</command> instead of <command>rpm -i</command> for updating instead of installing.
cs: Za předpokladu, že jste v kořenovém adresáři, kam jste se přepnul z Git, udělejte pro vytvoření Makefile následující, &kwave; balíček a nainstalujte jej. Jestliže již máte verzi &kwave; nainstalovánu, nejprve ji, prosím, odstraňte, nebo použijte <command>rpm -U</command> namísto <command>rpm -i</command> kvůli aktualizaci místo instalace.
de: Vorausgesetzt Sie befinden sich im Wurzelverzeichnis der GIT-Quellen, tun Sie folgendes um ein Makefile und das &kwave;-Paket zu erstellen und zu installieren. Wenn Sie bereits eine Version von &kwave; installiert haben, entfernen Sie diese bitte zuerst oder benutzen Sie <command>rpm -U</command> anstelle von <command>rpm -i</command> für die Aktualisierung anstelle einer Installation.
es: Suponiendo que se encuentra en la raíz desde donde obtuvo las fuentes desde GIT, escriba lo siguiente para crear un archivo Makefile, el paquete &kwave; e instalarlo. Si ya tiene una versión de &kwave; instalada, por favor, elimínela primero o use <command>rpm -U</command> en vez de <command>rpm -i</command> para actualizar en vez de instalar.

source: If you still have problems with <command>make rpm</command>, you will find the tar.bz2 archive that was produced in <filename>/tmp</filename>. Please follow the instructions in the <link linkend="manual_rpm_creation">previous</link> chapter.
cs: Pokud máte stále problémy s <command>make rpm</command>, naleznete tar.bz2 archiv, který byl vytvořen v <filename>/tmp</filename>. Následujte, prosím, instrukce v <link linkend="manual_rpm_creation">předchozí</link> kapitole.
de: Wenn Sie noch Probleme mit <command>make rpm</command> haben, nehmen Sie das tar.bz2-Archiv, das in <filename>/tmp</filename> erzeugt wurde. Bitte folgen Sie den Anweisungen im <link linkend="manual_rpm_creation">vorherigen</link> Kapitel.
es: Si todavía tiene problemas con <command>make rpm</command>, encontrará el archivo tar.bz2 que fue producido en <filename>/tmp</filename>. Por favor, siga las instrucciones en el capítulo <link linkend="manual_rpm_creation">anterior</link>.

source: Building a DEB package for testing and personal use
de: Erstellen eines DEB-Pakets zu Testzwecken und für private Verwendung
es: Construyendo un paquete DEB para uso de pruebas y personal

source: If you want to create a deb package of &kwave;, e.g. for testing a version that is not yet available via official package repositories, then you can create your own package quite easily. First of all, you need to install some required tools:
de: Wenn Sie ein deb-Paket von &kwave; erstellen möchten, beispielsweise um eine Version zu testen die noch nicht in den offiziellen Paketquellen verfügbar ist, dann können Sie mit einfachen Schritten selbst ein Paket erstellen. Als erstes müssen Sie ein paar erforderliche Hilfsprogramme installieren:
es: Si quiere crear un paquete deb de &kwave; por ejemplo para probar una versión que no está todavía disponible a través de los repositorios oficiales, puede hacerlo usted mismo de una manera bastante sencilla. Primeramente necesita instalar algunas herramientas:

source: Then you can install the required build dependencies by pretending to install the dependencies of the official &kwave; version:
de: Dann können Sie die notwendigen Generier-Abhängigkeiten installieren indem Sie vorgeben die Abhängigkeiten der offiziellen &kwave;-Version zu installieren:
es: Entonces puede instalar las dependencias requeridas para compilar simulando instalar las dependencias de la versión oficial de &kwave;:

source: After installing the required packages, you can build &kwave; as described in the chapters before. After building you can type this to get a .deb file in your current build directory:
de: Nach dem Installieren der erforderlichen Pakete können Sie &kwave; wie in den vorhergehenden Kapiteln generieren. Nach dem Generieren können Sie dies eingeben um eine .deb-Datei in Ihrem aktuellen Generierverzeichnis zu erhalten:
es: Después de instalar los paquetes necesarios puede compilar &kwave; como se describió en los capítulos anteriores. Después de compilar puede teclear lo siguiente para obtener el archivo .deb en su directorio de compilación:

source: The .deb file you get from this step will not have the quality that a package from your official distribution has - it is just good enough for installing and safely uninstalling &kwave; for testing purposes and for personal use.
de: Das .deb-Paket das Sie durch diesen Schritt erhalten wird nicht die selbe Qualität haben wie ein Paket das von Ihrer offiziellen Distribution kommt - es ist gerade gut genug für Testzwecke und persönliche Verwendung.
es: El archivo .deb que obtendrá en este paso no tendrá la calidad de un paquete oficial de su distribución. Simplemente le permitirá instalar y desinstalar &kwave; con propositos de prueba y uso personal.

source: Building CPU optimized packages
cs: Sestavení balíčků optimalizovaných pro CPU
de: Erstellen von CPU-optimierten Paketen
es: Creando paquetes optimizados para ciertos procesadores
fr: La construction de paquetages optimisés pour certains CPU

source: If you are owner of a Pentium, an AMD K6, Athlon or Athlon-XP CPU, you might want to use compiler optimizations to compile your version of &kwave; that is running some percents faster. The gain in speed will be up to 30% on some systems, whereas the functions dealing with signal manipulation and all functions that do complex time-frequency operations (like FFT and Sonagram) will profit most from it.
cs: Pokud jste vlastníkem procesoru Pentium, AMD K6, Athlonu nebo Athlonu XP, je možné, že budete chtít použít optimalizace kompilátoru pro zkompilování své verze &kwave;, která poběží o několik procent rychleji. Nárůst rychlosti bude u některých systémů až o 30 % , u nichž budou z toho mít zisk funkce, které mají co dělat s manipulací se signálem a se všemi funkcemi, které provádějí složité operace spojené s časem a kmitočtem (jako FFT a Sonagram).
de: Wenn Sie eine Pentium, eine AMD K6, Athlon oder Athlon-XP CPU besitzen, wollen Sie vielleicht einen optimierten Compiler für die Übersetzung Ihrer eigenen Version von &kwave; verwenden, die einige Prozente schneller läuft. Der Geschwindigkeitsgewinn beträgt bei einigen Systemen bis zu 30%, wobei die Signalbearbeitungs-Funktionen sowie alle Funktionen die komplexe Zeit-Frequenz-Operationen (wie FFT und Sonagramm) behandeln, am meisten davon profitieren.
es: Si es el propietario de un procesador Pentium, un AMD K6, Athlon o Athlon-XP podría querer usar ciertas optimizaciones para compilar su versión de &kwave; y así obtener un aumento en la velocidad. La ganancia puede ser de hasta un 30% en algunos sistemas, las funciones tratando con manipulación de señal y todas las funciones que realizan operaciones complejas de tiempo y frecuencias (como FFT y Sonogram) serán las mayores beneficiadas.

source: You do not need to understand much about programming for using an optimized compiler to compile &kwave;, but maybe you will need some time to get the compiler itself working and installed.
cs: Nemusíte toho o programování vědět mnoho, abyste mohli použít vyladěný kompilér pro sestavení &kwave;, ale je možné, že budete potřebovat čas na uvedení kompiléru do provozu a předtím také na jeho nainstalování.
de: Sie brauchen nicht viel über Programmierung zu wissen um einen optimierten Compiler für die Übersetzung von &kwave; zu benutzen. Aber vielleicht werden Sie einige Zeit brauchen um den Compiler selbst zu installieren und zum laufen zu bringen.
es: No es necesario conocer mucho sobre programación para usar un compilador optimizado para compilar &kwave;pero quiza necesite algún tiempo para conseguir hacer funcionar e instalar el compilador.

source: RPM optimizations
cs: Vyladění RPM
de: RPM-Optimierungen
es: Optimizaciones RPM
fr: Les optimisations pour la construction d'un paquetage RPM
