Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: added -Werror to the c++ compiler options when debuging enabled
fr: Ajout de l'option de compilation « -Werror » pour le compilateur c++ lorsque les options de débogage sont activées.

source: some include file cleanups in libgui
fr: Nettoyage de quelques fichiers d'en-tête dans « libgui ».

source: 1999-12-07 (by Thomas.Eschenbacher@gmx.de)
fr: 1999-12-07 (par Thomas.Eschenbacher@gmx.de)

source: SignalManager::writeWavChunk uses buffers for writing (much faster!)
fr: La fonction « SignalManager::writeWavChunk » utilise maintenant une mémoire tampon pour l'écriture (plus rapide !).

source: bugfix: caption of main window changes after "SaveAs"
fr: Correction de bogue : le titre de la fenêtre principal change après un « Sauvegarder dans ».

source: bugfix: selected resolution takes effect
fr: Correction de bogue : la sélection d'une résolution fonctionne maintenant.

source: bugfix: SignalManager::writeWavChunk now doesn't destroy the signal's data while saving
fr: Correction de bogue : la fonction « SignalManager::writeWavChunk » ne détruit plus les données du fichier sonore avant de l'avoir enregistrer.

source: make distclean in the projekt root directory also removes zero-length files, *.orig, *.rej and *~ (just makes cleaner than before)
fr: Un « make distclean » dans la racine du projet supprime aussi les fichiers vide, « *.orig », « *.rej » et « *~ ».

source: symbolic links to Makefile, Makefile.in and Makefile.am in the plugins directory are deleted with "make distclean" and rebuilt on "make" (changes in the referenced Makefiles in the template directory will not be reflected thousand times when creating a patch with diff)
fr: Les liens symboliques vers les fichiers Makefiles, Makefile.in et Makefile.am dans les dossiers des modules externes sont supprimés avec « make distclean » et reconstruit par « make ».

source: cleanups, removed some old backup files
fr: Nettoyage : suppression de quelques anciens fichiers de sauvegarde.

source: improved support for debugging accessible through
fr: Le support du débogage est maintenant facile à utiliser.

source: "configure --enable-debug=yes" (-g and -DDEBUG compiler flags)
fr: « configure --enable-debug=yes » (options de compilation « -g » et « -DDEBUG »).

source: rewritten big parts of Makefile.in for the plugins
fr: Réécriture d'une grande partie de Makefile.in pour les modules externes.

source: added -O2 compiler optimization
fr: Ajout de l'option de compilation « -O2 ».

source: 1999-12-03 (by Thomas.Eschenbacher@gmx.de)
fr: 1999-12-03 (par Thomas.Eschenbacher@gmx.de)

source: merged with Martin Wilz's version
fr: Fusion avec la version de Martin Wilz's.

source: version numbering script donated by Thomas Eschenbacher
fr: Script de Thomas Eschenbacher pour la numérotation des versions.

source: now using KTMainwindow for top level widgets
fr: « KTMainwindow » est maintenant utilisée pour les « Widgets » de haut niveau.

source: using timer to check message port -> alternative (threadsafe) message passing instead of signal/slot
fr: Utilisation d'un « timer » pour vérifier les messages systèmes -> le message alternatif (threadsafe) passe à la place d'un signal ou d'un slot.

source: labelling code rewritten, now incompatible with old releases
fr: Les sources pour les fonctions de marquage ont été réécrites et sont maintenant incompatibles avec les anciennes versions.

source: batch loading routines
fr: Regroupement des routines de chargement.

source: deleting channels works again
fr: La suppression des canaux fonctionne.

source: fixed savelabel dialog
fr: Correction de la boîte de dialogue pour la sauvegarde du marquage.

source: corrected envelope dialog, string handling
fr: Correction de la boîte de dialogue pour la modification de l'enveloppe d'un signal.

source: connected many functions via the new string-based way of invocation
fr: Raccordement de plusieurs fonctions par une chaîne de caractères commune.

source: fixed some dependencies between old code and new classes (there's still more to do !)
fr: Correction de quelques dépendances entre l'ancien code et les nouvelles classes (il reste encore des choses à faire !).

source: saving should now work again
fr: La sauvegarde d'un fichier sonore fonctionne.

source: trimmed down Clipboard class
fr: Correction de la classe « Clipboard ».

source: Color class as wrapper to QColor (may become independent later)
fr: La classe « Color » a été changée en « QColor » (elle pourra devenir indépendante plus tard).

source: reworking Curve Class for creation via string, interpolation now uses curve objects
fr: Restructuration de la classe « Curve » pour la création de chaîne. L'interpolation est maintenant utilisée par les objets de cette classe.

source: moved gui functions into a new library (libkwavegui)
fr: Déplacement des fonctions graphiques dans une nouvelle bibliothèque (libkwavegui).

source: new Classes: Parser DynamicLoader Filter (prevously was a struct)
fr: Nouvelles classes : « Parser », « DynamicLoader », et « Filter » (elles étaient précédemment des structures).

source: moved gui-independent functions into a library (libkwave)
fr: Déplacement des fonctions graphiques indépendantes dans une nouvelle librairie (libkwave).

source: rework of dialogs into single files and single plugins
fr: Regroupement des boîtes de dialogue dans des fichiers uniques et dans des simples modules externes.

source: new calling scheme via string commands. This will allow scripting and macro definitions. Threading is made a whole lot easier, because a only a string has to be passed and gets expanded into the needed set of parameters in each thread
fr: Nouveau schéma d'appel via des lignes de commandes. Cela permettra des appels par des scripts et la définition de macros. Les enchaînements sont construis plus facilement, car par une seule chaîne de caractères sont passés tous les paramètres.

source: io functions and playback adapted to SignalManager
fr: Les fonctions d'entrées / sorties et de lecture sont adaptées à « SignalManager ».

source: Introduction of SignalManager class for multiple channel management
fr: Ajout de la classe « SignalManager » pour la gestion de plusieurs canaux.

source: Just a fix for an annoying bug while zooming out
fr: Juste la correction d'un bogue concernant le zoom arrière.

source: removed a memory leak in playback
fr: Suppression d'une perte de mémoire dans la lecture audio.

source: triple-checked the missing Accelerators in the Menumanager. It seems to be a bug in qpopmenu, I'll wait for qt to be fixed, or until a workaround is known
fr: Triple vérification de l'oubli des raccourcis clavier dans « Menumanager ». Cela semble être un bogue dans « qpopmenu », j'attendrai que la librairie Qt soit corrigée, ou qu'une solution palliative soit trouvée.

source: recent Files are updated again, while the program is running
fr: La liste des fichiers récemment ouverts est constamment mise à jour pendant l'exécution du programme.

source: kwave now keeps track of last directory saved to; for user convenience
fr: Pour une plus grande facilité, Kwave utilise le dossier récemment utilisé pour l'ouverture un fichier.

source: reestablished selection mechanism to match versions before 0.29.3 and corrected some otherwise screwed-up behaviour
fr: Rétablissement des mécanismes de sélection pour rassembler les versions antérieures à la 0.29.3 et quelques corrections récentes.

source: _now_ all parameters to destructors should have vanished
fr: Maintenant tous les paramètres des destructeurs doivent avoir disparu.

source: developement has slowed down a bit, this release is not as complete as I wished but since 0.29.2 has a destructor with parameters accidently left in, and so does not compile on all systems -> here we go again...
fr: Le développement a ralenti, et cette version n'est pas complète comme je le souhaitais depuis la 0.29.2. La modification de tous les destructeurs de classes a été mis de coté, et le programme ne se compile pas sur tous les systèmes -> On y reviendra plus tard...

source: reworked selection routines into a new class, code is still rather confusing, but seems to work
fr: Restructuration des routines de sélection dans les nouvelles classes. Le code est plus confus, mais il fonctionne.

source: added checkmark functionality again
fr: Ajout de marques de vérifications.

source: converted file-menus to new menu-scheme
fr: Conversion du menu Fichier dans la nouvelle arborescence des menus.

source: added gui to mix channels together, the needed functions for mixing are still missing
fr: Ajout d'une interface graphique pour mixer 2 canaux ensemble. Le besoin de fonctions pour le mixage sont toujours d'actualité.

source: Halt button by Gerhard Zintel
fr: Bouton d'arrêt par Gerhard Zintel.

source: moved clipboard functionality to its own class
fr: Déplacement des fonctionnalités du presse-papiers dans une classe dédiée.

source: dynamic allocation of menu entries used by all classes but TopWidget
fr: L'allocation dynamique des entrées des menus est utilisée par toutes les classes sauf « TopWidget ».

source: import of ascii data files
fr: Importation de fichier ASCII.

source: Bugfix for multichannel save. Now the saved files should work with other prgs
fr: Correction de bogues pour la sauvegarde de canaux multiples. Maintenant, la sauvegarde de fichiers doit fonctionner avec d'autres programmes.

source: local snap to peak by Gerhard Zintel
fr: Fonctionnalité d'écrétage de pics par Gerhard Zintel.

source: changed version numbering and filename as suggested by Version 1.1 of "How To Name Things" from sunsite. The last digit will always mark be 0 for releases uploaded to ftp.kde.org.
fr: Changement du numéro de version et de nom de fichiers comme suggéré par la version 1.1 du document « How To Name Things » sur le site WEB « sunsite ». Le dernier nombre sera toujours marqué d'un 0 pour une version qui sera chargée sur « ftp.kde.org ».

source: added windowing (Hamming Hanning, Blackmann) functions
fr: Ajout des boîtes de dialogues pour les fonctionnalités de fenêtrages (Hamming Hanning, Blackmann).

source: contribution from Gerhard Zintel displaying notes in fftview
fr: Contribution de la part de Gerhard Zintel pour l'affichage d'information concernant « fftview ».

source: Added pitch display window
fr: Ajout d'une fenêtre pour la gestion des « pitchs ».

source: implemented cursor and db scale for fft-view
fr: Implantation du curseur et de l'échelle en décibel pour la vue sur les transformées de Fourrier.

source: added reselection and cursor change
fr: Ajout d'une fonctionnalité sur la re-sélection et le changement de place du curseur.

source: added possibility of different display modes in Frequency representation
fr: Ajout de différentes possibilités d'affichage en fonction de la représentation des fréquences.

source: fixed severe quantisation bug in saving 16Bit routine, reported by ?
fr: Correction d'un gros bogue concernant la sauvegarde en 16 bits.

source: mmaping support contributed by Juhana Kouhia
fr: Support du « mmaping » par Juhana Kouhia.

source: added as new Possibility to generate Signals: pulse trains
fr: Ajout de nouvelles possibilités pour la génération de signaux : trains d'impulsions.

source: added wrapper for systems with no posixthreads -> still needs handling by configure script (change Makefile for not linking libpthread and doing a define)
fr: Ajout d'un modèle pour les systèmes qui ne gèrent pas les threads Posix -> il sera nécessaire de le déclarer dans le script de configuration (changement du fichier « Makefile » pour ne pas avoir d'édition des liens avec la bibliothèque « libpthread »).

source: First use of multiple threads (pthreads) in some functions
fr: Première utilisation du multithreading (pthreads) dans quelques fonctions.

source: Pitch generation now independent of additive synthesis
fr: La génération de « pitchs » est maintenant indépendante de la synthèse additionnelle.

source: added import function for ascii files
fr: Ajout des fonctions d'importations via des fichiers ASCII.

source: Ascii label saving now also by frequency
fr: Les labels ASCII sont également sauvegardés via la fréquence.

source: Label generation according to Period Detection (autocorellation)
fr: La génération de labels est accordée avec la détection de périodes (auto-correllation).

source: Sonagram, FFTView and Distortion-Dialog now use ScaleWidgets
fr: Les classes « Sonagram », « FFTView » et « Distortion-Dialog » utilise maintenant la classe « ScaleWidgets ».

source: New ScaleWidget gives the user more information
fr: Nouvelle classe « ScaleWidget » qui donne plus d'informations à l'utilisateur.

source: Improved ProgressDialog and Interpolation class to allow multiple threads
fr: Ajout des classes « ProgressDialog » et « Interpolation » pour permettre le multithreading.

source: fixed some minor bugs
fr: Correction de quelques bogues mineurs.

source: changes in curvewidget (recent point has another pixmap).
fr: Changement dans la classe « curvewidget ».

source: sorting of labels now works without overwriting of QGList::compareItems.
fr: Le tri des labels fonctionne maintenant sans écraser les opérations de « QGList::compareItems ».

source: bug fix for saving selection.
fr: Correction de bogues dans la sauvegarde d'une sélection.

source: save Block function added.
fr: Ajout d'une fonction de sauvegarde d'une sélection.

source: signal finding function in markers.cpp: gui improved.
fr: Fonction de recherche de signaux dans markers.cpp : interface graphique.

source: some smaller bug fixes.
fr: Quelques petites corrections de bogues.

source: first release, but never uploaded, because ftp.kde.org was down.
fr: Première version, qui n'a jamais été chargé sur « ftp.kde.org » (serveur FTP non opérationnel).

source: How to obtain &kapp;
fr: Comment obtenir &kapp;

source: &kapp; has an own homepage under <ulink url="http://kwave.sourceforge.net/"> http://kwave.sourceforge.net/</ulink>. Here you can find further informations about the project, as well as informations about current stable and up-to-date development versions.
fr: &kapp; a sa propre page WEB à l'adresse <ulink url="http://kwave.sourceforge.net/"> http://kwave.sourceforge.net/</ulink>. Vous pouvez y trouver plus d'informations sur le projet, ainsi que les versions stables et en cours de développement du programme.

source: In order to successfully use &kapp;, you need:
fr: Dans l'ordre, pour pouvoir utiliser &kapp;, vous avez besoin :

source: a computer running Linux (&kapp; might also run under some other operating system, but we have never tested this, please let us know if you get it working under some other platform / operating system)
fr: D'un ordinateur sous LINUX (&kapp; peut théoriquement fonctionner sous d'autre système d'exploitation, mais nous n'avons jamais testé cette possibilité. nous vous remercions de nous avertir si vous avez réussi à faire fonctionner le logiciel sur une autre plate-forme).

source: KDE-3.1 or higher (at least the libraries, if you are a gnome fan, you can also run &kapp; if the proper libs are installed).
fr: De KDE-3.1 ou supérieur (ou au moins les bibliothèques appropriées. Si vous êtes un fan de l'environnement de bureau Gnome, vous pouvez également utilisé &kapp; à partir du moment que les librairies de KDE sont installées.).

source: qt-3.1 or higher (normally comes with KDE3)
fr: De Qt-3.1 ou supérieure (normalement associée avec KDE3).

source: about 32 MB memory for starting &kapp; (but this may vary depending on your platform and configuration)
fr: D'environ 32 Mo de mémoire pour lancer &kapp; (mais cela peut varier en fonction de votre plate-forme et de votre configuration).

source: If you intend to compile &kapp; from the sources, you will need at least:
fr: Si vous désirez compiler &kapp; à partir des sources, vous avez besoin:

source: The KDE3 development environment: "kdelibs3-devel", "kdemultimedia3-devel", "kdesdk3".
fr: De l'environnement de développement de KDE3 : « kdelibs3-devel », « kdemultimedia3-devel », et « kdesdk3 ».

source: The Qt development environment, the package is normally called "qt3-devel" or similar.
fr: De l'environnement de développement Qt. Le paquetage se nomme normalement « qt3-devel » ou quelque chose de similaire.

source: id3lib-devel-3.8.1 or higher
fr: la bibliothèque « id3lib-3.8.1 » ou supérieure

source: If you intend to use CVS, you will also need a current cvs package.
fr: Si vous désirez utiliser CVS, il vous faut aussi la version actuelle du paquetage correspondant à CVS.

source: ...many other packages, please take a look at the <ulink url="http://cvs.sourceforge.net/cgi-bin/viewcvs.cgi/kwave/kwave/README?rev=HEAD&amp;content-type=text/vnd.viewcvs-markup"> "README"</ulink> file included in the source package.
fr: ...d'autres paquetages logiciels. Pour plus d'informations, veuillez consultez le fichier <ulink url="http://cvs.sourceforge.net/cgi-bin/viewcvs.cgi/kwave/kwave/README?rev=HEAD&amp;content-type=text/vnd.viewcvs-markup"> "README"</ulink> qui est inclut dans les sources du programme.

source: In order to compile and install &kapp; on your system, type the following in the base directory of the source distribution:
fr: Dans l'ordre, pour compiler et installer &kapp; sur votre système, vous devez saisir les lignes de commande qui suivent dans le dossier de base où vous avez copié les sources du programme :

source: Since &kapp; uses autoconf and automake you should have no trouble compiling it. Should you run into problems please report them to the &kapp; <link linkend="mailing-list">mailing list</link>.
fr: Depuis que &kapp; utilise autoconf et automake vous ne devez pas avoir de problèmes particuliers lors de la compilation. Envoyez nous la liste de vos problèmes sur la compilation de &kapp; en nous contactant sur la <link linkend="mailing-list">liste de diffusion</link>.

source: Building RPM packages from tar.gz archives
fr: La construction du paquetage RPM à partir de l'archive au format « .tar.gz ».

source: If you are runnig a system with RPM support, the preferred way to install &kapp; on your system will be the creation of a nice RPM package. First you should get the current source of &kapp;, either as a tar.gz archive from the &kapp; download page or check out an up-to-date copy via <link linkend="cvs-repository">anonymous CVS</link> (like described in the <link linkend="cvs_checkout">chapter about CVS</link>) and read the <link linkend="building_rpm_from_cvs">next</link> chapter.
fr: Si vous utilisez un système qui supporte les RPM, la solution la plus simple pour installer &kapp; sur votre système sera la création d'un paquetage RPM. Premièrement, vous devez récupérer les sources de &kapp;, tel que l'archive au format « .tar.gz » disponible sur la page WEB de téléchargement de &kapp; ou une copie de la dernière version des sources via le <link linkend="cvs-repository">serveur CVS</link> (comme cela est décrit dans le chapitre concernant le <link linkend="cvs_checkout">CVS</link>), et lisez le chapitre concernant la <link linkend="building_rpm_from_cvs">compilation d'un RPM à partir du CVS</link>.

source: To build the &kapp; package and install it do:
fr: Pour construire et installer le paquetage de &kapp; vous devez saisir les lignes de commande suivantes :

source: Put the tar.gz archive into the SOURCES subdirectory (you have to replace "somewhere" with the real directory where the files are, of course).
fr: Mettre l'archive au format « .tar.gz » dans le sous-dossier SOURCES (vous devez remplacer « NomDossier » avec le nom du dossier qui contient votre archive au format « .tar.gz »).

source: <prompt>% </prompt><command>cp <replaceable>/somewhere/kwave-XXX.tar.gz</replaceable> SOURCES</command>
fr: <prompt>% </prompt><command>cp <replaceable>/NomDossier/kwave-XXX.tar.gz</replaceable> SOURCES</command>

source: Let rpm do the compile job and generate the rpm of &kapp;. If you only want to make a binary package, you can specify <literal>-bb</literal> instead of <literal>-ba</literal>, or just <literal>-bs</literal> to build only a source package.
fr: Le programme « rpm » compilera et construira le paquetage RPM de &kapp;. Si vous voulez seulement construire un paquetage contenant les exécutables, vous pouvez spécifier le paramètre <literal>-bb</literal> à la place de <literal>-ba</literal>, ou juste <literal>-bs</literal> pour construire un paquetage contenant les sources.

source: If everything was ok, you can install the binary rpm of &kapp;, it will be in the BUILD directory. If you already have a version of &kapp; installed, please remove it first or use the parameter <literal>-U</literal> instead of <literal>-i</literal> for upgrading instead of installing.
fr: Si tout se passe correctement, vous pouvez installer le paquetage RPM contenant les exécutables de &kapp;, celui-ci étant stocké dans le sous dossier BUILD. Si vous avez déjà une version de &kapp; installée sur votre système, vous devez tout d'abords désinstaller celui-ci en premier ou utiliser le paramètre <literal>-U</literal> à la place de <literal>-i</literal> pour mettre à jour automatiquement le paquetage.

source: Building RPM packages from CVS
fr: La construction d'un paquetage RPM à partir du CVS

source: For initially checking out the sources you will need some disk space (about 70 megabytes) in a directory of your choice, the cvs package of your favorite distribution and full access to the internet. If you get error messages about rejected connections you either have typed something wrong or your provider doesn't give you full access. A good place for the source files will be <filename>"$HOME/src"</filename>.
fr: Pour initialement vérifier la mise à jour des sources sur le CVS, vous avez besoin d'un espace disque conséquent (environ 70 Mo) dans le dossier de votre choix, du paquetage correspondant au programme cvs dédié à votre distribution, et d'un accès complet à internet. Si vous recevez un message d'erreur pour des connexions qui sont rejetées, soit vous avez tapé des commandes incorrectes, soit votre fournisseur d'accès à internet n'autorise pas certaine connexion depuis votre système. Le meilleur endroit pour stocker les fichiers sources est <filename>« $HOME/src »</filename>.

source: First create the directory that will receive the subdirectoy with &kapp; sources and change into it:
fr: En premier lieu, vous devez créer le dossier où vous allez recevoir le sous-dossier qui stockera les sources de &kapp; :

source: Then log in into the CVS server. As I guess that you want to do that as normal user, you log in as anonymous: <screen width="75" format="linespecific"> <prompt>% </prompt><command>cvs -d:pserver:anonymous@cvs.kwave.sourceforge.net:/cvsroot/kwave login</command> </screen> Then the server asks you for a password. Simply press enter, as we do not have a password for anonymous access.
fr: Ensuite vous devez vous connecter au serveur CVS. Vous allez utiliser le compte anonyme à l'aide de la commande suivante : <screen width="75" format="linespecific"> <prompt>% </prompt><command>cvs -d:pserver:anonymous@cvs.kwave.sourceforge.net:/cvsroot/kwave login</command> </screen> Le serveur vous demandera alors un mot de passe. Appuyer simplement sur la touche « Entrée ». Il n'y a pas de mot de passe pour le compte anonyme.
