Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: You can easily compile the RPM package optimized for Athlon, Athlon-XP, Pentium and Pentium Pro (and some other CPUs) by using some defines in your <filename>rpmrc</filename> file. You can either modify your system's <filename>rpmrc</filename> file in <filename>/usr/lib/rpm</filename> or the <filename>.rpmrc</filename> file in your home directory. There you can specify option lines like these: <screen width="70" format="linespecific"> <userinput moreinfo="none">optflags: i586 -O2 -march=pentium -DNDEBUG -fomit-frame-pointer</userinput> <userinput moreinfo="none">optflags: i686 -O2 -march=pentiumpro -DNDEBUG -fomit-frame-pointer</userinput> <userinput moreinfo="none">optflags: athlon -O2 -march=athlon -DNDEBUG -fomit-frame-pointer</userinput> <userinput moreinfo="none">optflags: k6 -O3 -march=k6 -DNDEBUG -fomit-frame-pointer</userinput> <userinput moreinfo="none">optflags: k7 -O3 -march=athlon-xp -DNDEBUG -fomit-frame-pointer</userinput> </screen> (I found those nice tricks at <ulink url="http://www.keywarrior.net/duesti/rpmopt.en.html"> http://www.keywarrior.net/duesti/rpmopt.en.html</ulink>. Thanks to Matthias Düsterhöft!).
cs: Můžete snadno sestavit balíček RPM, který bude vyladěný pro Athlon, Athlon-XP, Pentium a Pentium Pro (a některé další procesory) pomocí některých vymezení ve vašem <filename>rpmrc</filename> souboru. Rovněž můžete upravit svůj systémový <filename>rpmrc</filename> soubor v <filename>/usr/lib/rpm</filename> nebo soubor<filename>.rpmrc</filename> ve svém domovském adresáři. Můžete přesně určit řádky s volbami, jako jsou tyto: <screen width="70" format="linespecific"> <userinput moreinfo="none">optflags: i586 -O2 -march=pentium -DNDEBUG -fomit-frame-pointer</userinput> <userinput moreinfo="none">optflags: i686 -O2 -march=pentiumpro -DNDEBUG -fomit-frame-pointer</userinput> <userinput moreinfo="none">optflags: athlon -O2 -march=athlon -DNDEBUG -fomit-frame-pointer</userinput> <userinput moreinfo="none">optflags: k6 -O3 -march=k6 -DNDEBUG -fomit-frame-pointer</userinput> <userinput moreinfo="none">optflags: k7 -O3 -march=athlon-xp -DNDEBUG -fomit-frame-pointer</userinput> </screen> (Tato hezká kouzla jsem našel na <ulink url="http://www.keywarrior.net/duesti/rpmopt.de.html"> http://www.keywarrior.net/duesti/rpmopt.en.html</ulink>. Díky Matthiasovi Düsterhöftovi!).
de: Sie können relativ einfach ein für Athlon, Athlon-XP, Pentium und Pentium Pro (oder einige andere CPUs) optimiertes Paket kompilieren, indem Sie einige Definitionen in Ihrer <filename>rpmrc</filename> Datei setzen. Sie können auch Ihre systemweite <filename>rpmrc</filename> Datei oder die <filename>.rpmrc</filename> Datei in ihrem Home-Verzeichnis verändern. Dort können Sie zum Beispiel folgende Options-Zeilen angeben: <screen width="40" format="linespecific"> <prompt moreinfo="none">% </prompt><userinput moreinfo="none">optflags: i586 -O2 -march=pentium -DNDEBUG -fomit-frame-pointer</userinput> <prompt moreinfo="none">% </prompt><userinput moreinfo="none">optflags: i686 -O2 -march=pentiumpro -DNDEBUG -fomit-frame-pointer</userinput> <prompt moreinfo="none">% </prompt><userinput moreinfo="none">optflags: athlon -O2 -march=athlon</userinput> <prompt moreinfo="none">% </prompt><userinput moreinfo="none">optflags: k6 -O3 -march=k6 -mcpu=k6 -DNDEBUG -fomit-frame-pointer</userinput> <prompt moreinfo="none">% </prompt><userinput moreinfo="none">optflags: k7 -O3 -march=athlon-xp -mcpu=athlon-xp -DNDEBUG -fomit-frame-pointer</userinput> </screen> (Ich fand diese schönen Tricks auf <ulink url="http://www.keywarrior.net/duesti/rpmopt.de.html"> http://www.keywarrior.net/duesti/rpmopt.de.html</ulink>. Dank an Matthias Düsterhöft!).
es: Puede compilar fácilmente el paquete optimizado RPM para Athlon, Athlon-XP, Pentium y Pentium Pro (y otras CPUs) usando ciertas definiciones en su archivo <filename>rpmrc</filename>. Puede modificar el archivo <filename>rpmrc</filename> de su sistema en <filename>/usr/lib/rpm</filename> o el archivo <filename>.rpmrc</filename> en su directorio personal. Ahí puede especificar lineas de opciones como las siguientes: <screen width="70" format="linespecific"> <userinput moreinfo="none">optflags: i586 -O2 -march=pentium -DNDEBUG -fomit-frame-pointer</userinput> <userinput moreinfo="none">optflags: i686 -O2 -march=pentiumpro -DNDEBUG -fomit-frame-pointer</userinput> <userinput moreinfo="none">optflags: athlon -O2 -march=athlon -DNDEBUG -fomit-frame-pointer</userinput> <userinput moreinfo="none">optflags: k6 -O3 -march=k6 -DNDEBUG -fomit-frame-pointer</userinput> <userinput moreinfo="none">optflags: k7 -O3 -march=athlon-xp -DNDEBUG -fomit-frame-pointer</userinput> </screen> (Encontré estos trucos en <ulink url="http://www.keywarrior.net/duesti/rpmopt.en.html"> http://www.keywarrior.net/duesti/rpmopt.en.html</ulink>. Gracias Matthias Düsterhöft!).

source: This means that on an <literal>k7</literal> architecture the rpm package will be compiled using <literal>-O3 -march=athlon-xp -DNDEBUG -fomit-frame-pointer</literal> as compiler option and so on, you might extend or adapt these to your own needs. The settings apply to all of the sections before in all places where <command>rpmbuild -ta</command> is used or where a binary RPM is to be created out of a source rpm using <command>rpmbuild --rebuild</command>.
cs: Znamená to, že na architektuře <literal>k7</literal> bude balíček rpm sestaven pomocí <literal>-O3 -march=athlon-xp -DNDEBUG -fomit-frame-pointer</literal> jako volbou pro sestavení atd. Můžete ji rozšířit nebo přizpůsobit podle svých vlastních potřeb. Nastavení použijte předtím na všechny čísti na všechmístech, kde je použito <command>rpmbuild -ta</command> nebo, kde má být vytvořen RPM ze zdrojového rpm pomocí příkazu <command>rpmbuild --rebuild</command>.
de: Das bedeutet, dass auf einer <literal>K7-Architektur</literal> das rpm Paket unter Benutzung von <literal>-O3 -march=athlon-xp -mcpu=athlon-xp -DNDEBUG -fomit-frame-pointer</literal> als Compiler Option kompiliert wird. Sie sollten dies für Ihre eigenen Bedürfnisse erweitern oder anpassen. Die Einstellungen sind für alle vorhergehenden Sektionen anwendbar, wo ein <command>rpmbuild -ta</command> benutzt wurde oder ein binary RPM mittels eines Quell-RPM unter Benutzung von <command>rpmbuild --rebuild</command> erstellt wurde.
es: Esto quiere decir que en una arquitectura <literal>k7</literal> el paquete rpm será compilado usando <literal>-O3 -march=athlon-xp -DNDEBUG -fomit-frame-pointer</literal> como opción de compilación y demás, podría extender o adaptar estas a sus propias necesidades. Los ajustes se aplican a todas las secciones anterioresen todos los lugares donde <command>rpmbuild -ta</command> es usado o donde un RPM binario es creado a partir de las fuentes desde un rpm usando <command>rpmbuild --rebuild</command>.

source: If <command>rpm</command> refuses to install your package because it seems not to fit to your computer's architecture, you can normally just install an optimized package by specifying the additional parameter <command>--ignorearch</command> and don't care.
cs: Pokud <command>rpm</command> odmítne instalaci vašeho balíčku, protože to vypadá, že nezapadá do architektury vašeho počítače, můžete obvykle nainstalovat pouze vyladěný balíček, a to zadáním dodatečného parametru <command>--ignorearch</command>, a dál si nedělejte starosti.
de: Falls es <command>rpm</command> ablehnt Ihr Paket aufgrund von scheinbarer Unstimmigkeit mit ihrer Computer- Architektur zu installieren, können Sie ein optimiertes Paket trotzdem problemlos mit der zusätzlichen Angabe des Parameters <command>--ignorearch</command> installieren.
es: Si <command>rpm</command> rechaza instalar su paquete debido a que parece no corresponder a la arquitectura de su ordenador, puede normalmente instalar un paquete optimizado especificando el parámetro adicional <command>--ignorearch</command> sin preocuparse.
fr: N'oubliez pas que la commande <command>rpm</command> peut refuser d'installer votre paquetage parce qu'elle est incapable de reconnaître votre architecture matérielle. Normalement, vous pouvez juste installer et optimiser le paquetage en spécifiant l'option <command>--ignorearch</command>.

source: How to pass optimizer options to the compiler manually
cs: Jak předat překladač volby pro vyladění ručně
de: Wie werden Optimierungs-Parameter manuell an den Compiler übergeben
es: Cómo pasar opciones de optimización manualmente al compilador

source: The invocation of the compiler is quite simple. It normally is sufficient to set the environment variables <literal><symbol>CFLAGS</symbol></literal> and <literal><symbol>CXXFLAGS</symbol></literal> in the correct way and then compile as usual. For the best settings please consult the documentation or homepage of the corresponding compiler.
cs: Vyvolání překladače je docela jednoduché. Obvykle stačí správným způsobem nastavit proměnné prostředí <literal><symbol>CFLAGS</symbol></literal> a<literal><symbol>CXXFLAGS</symbol></literal> a potom provést sestavení, jako obvykle. Kvůli nejlepšímu nastavení se, prosím, poraďte s dokumentací nebo na domovských stránkách odpovídajícího překladače.
de: Der Aufruf eines optimierten Compilers ist recht einfach. Es reicht normalerweise aus, die Umgebungsvariablen <symbol>CFLAGS</symbol> und<symbol>CXXFLAGS</symbol> in der korrekten Weise zu setzen und dann wie gewohnt zu übersetzen. Für die besten Einstellungen lesen Sie bitte in der Dokumentation oder Homepage des entsprechenden Compilers nach.
es: La llamada al compilador es bastante simple. Normalmente es suficiente con establecer las variables de entorno <literal><symbol>CFLAGS</symbol></literal> y <literal><symbol>CXXFLAGS</symbol></literal> de la manera adecuada y compilar de la forma habitual. Para obtener los mejores ajustes consulte la documentación o la página web del compilador.

source: If you build &kwave; from a source tree (unpacked tar.bz2 or from GIT) the flags need to be specified before the call. For example:
cs: Pokud sestavujete &kwave; ze stromu zdroje (nezabalený tar.bz2 nebo z Git) je potřeba zadat příznaky před zavoláním. Například:
de: Wenn Sie &kwave; von einem Quellverzeichnis aus (entpacktes tar.bz2 oder via GIT) erstellen, sollten die Flags vor dem Aufruf angegeben werden. Zum Beispiel:
es: Si compila &kwave; desde un árbol de recursos (tar.bz2 desempaquetado o desde GIT) las banderas requieren ser especificadas antes de la llamada. Por ejemplo:

source: If you re-build &kwave; from a source rpm package, please follow the instruction in the <link linkend="rpm_optimizations">previous section</link>.
cs: Pokud sestavujete znovu &kwave; ze zdrojového rpm balíčku, následujte, prosím, pokyny v <link linkend="rpm_optimizations">předchozím oddíle</link>.
de: Wenn Sie &kwave; aus einem Quell-RPM-Paket erstellen, folgen Sie bitte den Anweisungen im <link linkend="rpm_optimizations">vorherigen Abschnitt</link>.
es: Si recompila &kwave; desde un paquete fuente rpm, por favor, siga las instrucciones de la <link linkend="rpm_optimizations">sección anterior</link>.

source: Basics about digital audio
cs: Základy o digitálním zvuku
de: Grundlagen digitaler Audiobearbeitung
es: Fundamentos sobre audio digital
fr: Les rudiments sur les enregistrements audio numériques

source: This chapter should give a short introduction about the basics of digital audio processing, without going too much into details. Of course this might be a bit incomplete, but if you have questions, you can ask at the &kwave; mailing list or consult some further literature.
cs: Tato kapitola by měla podat krátký úvod do základů digitálního zpracování zvuku, aniž by zacházela do přílišných podrobností. Samozřejmě může být trochu neúplná, ale jestliže máte otázky, můžete je vznést na &kwave; seznamu s adresami nebo se poradit s nějakou další literaturou.
de: Dieses Kapitel soll eine kurze Einführung in die Grundlagen der digitalen Audiobearbeitungen geben, ohne jedoch allzu sehr ins Detail zu gehen. Natürlich wird dies teilweise unvollständig sein, doch wenn noch Fragen offen bleiben, können Sie diese auf der &kwave; Mailingliste stellen oder weiterführende Literatur konsultieren.
es: Este capítulo debería proporcionan un breve introducción sobre los fundamentos del procesamiento de audio digital sin entrar en muchos detalles. Por supuesto, podría ser un poco incompleto, pero si tiene preguntas puede preguntar en la lista de correo de &kwave; o consultar más libros.

source: The analogue world
cs: Svět analogu
de: Die analoge Welt
es: El mundo analógico
fr: Le monde de l'analogique.

source: First of all, one must know that the world is <emphasis>analogue</emphasis> - but computers work <emphasis>digitally</emphasis>. So there are several ways to convert analogue audio to digital audio and back again. As the way from digital to analogue normally is the reversion of the way from analogue to digital, we only describe the way from analogue to digital.
cs: Nejprve si uvědomme, že svět je postaven na <emphasis>analogu</emphasis> - ale počítače pracují <emphasis>digitálně</emphasis>. A taj je několik způsobů, jak převést analogový zvuk na digitální a zase zpátky. Jelikož cesta z digitálu na analog je obvykle obrácením způsobu, jakým se převádí analogový zvuk na digitální, popíšeme si pouze způsob převodu z analogu na digitál.
de: Zuerst muss man sich im klaren sein, dass die Welt <emphasis>analog</emphasis> ist - Computer jedoch <emphasis>digital</emphasis> arbeiten. Es gibt also mehrere Wege um Audio von analog nach digital und umgekehrt umzuwandeln. Nachdem die Umsetzung von digital nach analog die Umkehrung der Umsetzung von analog nach digital ist, beschreiben wir nur letzteres.
es: Primero debe saber que el mundo es <emphasis>analógico</emphasis> y que los ordenadores trabajan digitalmente. Por lo que existen distintos modos para convertir audio analógico en audio digital y viceversa. Como el modo de convertir de digital a analógico es normalmente el proceso inverso de convertir de analógico a digital sólo describiremos el modo de analógico a digital.
fr: Tout d'abord, la première chose à savoir est que le monde qui nous entoure est <emphasis>analogique</emphasis> alors que l'ordinateur travail en <emphasis>numérique</emphasis>. Il existe de nombreuses méthodes pour convertir le son analogique en données numériques et vice versa. Comme la méthode de conversion du numérique vers l'analogique est normalement l'inverse de la méthode pour passer de l'analogique au numérique, nous ne décrirons que cette dernière.

source: <phrase>Conversion from sound to bits</phrase>
cs: <phrase>Převod ze zvuku na bity</phrase>
de: <phrase>Umwandlung von Sound in Bits</phrase>
es: <phrase>Conversión de sonido a bits</phrase>
fr: <phrase>La conversion du son en bits</phrase>

source: <para>Conversion from sound to bits</para>
cs: <para>Převod ze zvuku na bity</para>
de: <para>Umwandlung von Sound in Bits</para>
es: <para>Conversión de sonido a bits</para>
fr: <para>La conversion du son en bits</para>

source: Before continuing, analogue audio has to be transformed into electronic signals in order to find it's way into a computer. One common way to do this is by using a microphone and an amplifier. This combination gets sound (changes of air pressure) at it's input and a voltage at it's output. Higher amplitude of the pressure changes will be represented by higher voltages at the amplifier's output. This output is also called a <emphasis>'signal'</emphasis>. Instead of a microphone you can of course also imagine other sources of audio. And the "amplifier" can be the one that is integrated into your sound card, where you normally can't see it.
cs: Před pokračováním se musí analogový zvuk přeměnit na elektronické signály, aby se tak mohl dostat do počítače. Jedním z obvyklých způsobů, jak se to provádí, je použití mikrofonu a zesilovače. Jejich propojením se získá zvuk (změny tlaku vzduchu) na vstupu a napětí na výstupu. Větší rozkmit změn tlaku bude představován větším napětím na výstupu zesilovače. Tento výstup je taktéž nazýván <emphasis>'signál'</emphasis>. Místo mikrofonu si můžete samozřejmě představit i jiné zdroje zvuku. A "zesilovač" může být začleněn ve vaší zvukové kartě, kde jej normálně nemůžete vidět.
de: Bevor es weiter geht, muss analoges Audio zuerst in digitale Signale umgewandelt werden um in einem Computer verarbeitet werden zu können. Ein üblicher Weg dafür ist die Verwendung von einem Mikrophon und einem Verstärker. Diese Kombination hat Töne (also Luftdruckschwankungen) am Eingang und eine elektrische Spannung an ihrem Ausgang. Höhere Druckamplituden erzeugen dabei höhere Spannungen am Ausgang des Verstärkers. Der Verstärker produziert an seinem Ausgang ein sogenanntes <emphasis>'Signal'</emphasis>. Anstelle eines Mikrophons kann man sich natürlich auch andere Audio-Quellen vorstellen. Und der "Verstärker" kann derjenige sein, der in Ihrer Soundkarte eingebaut sein, wo man ihn normalerweise nicht sieht.
es: Antes de continuar, el audio analógico tiene que ser transformado en señales electrónicas para ser tratado por el ordenador. Un procedimiento común para hacer esto es usando un microfono y un amplificador. Esta combinación obtiene sonido (cambios en la presión del aire) como entrada y un voltaje como salida. Así cuanto mayor sea la amplitud debido a los cambios de presión, mayores voltajes en la salida del amplificador. Esta salida también se denomina <emphasis>'señal'</emphasis>. En vez de un microfono también puede imaginar otras fuentes de audio. El "amplificador" puede ser uno integrado en su tarjeta de sonido por lo que no podrá verlo.
fr: Avant de continuer, le son analogique doit être transformé en un signal électrique qui pourra être traité par l'ordinateur. Un des procédés les plus utilisés pour cela est l'utilisation d'un microphone et d'un amplificateur. Cette combinaison donne une tension qui est proportionnelle aux changements de la pression dans l'air. Les amplitudes les plus grandes des changements de pression donneront les tensions avec la plus grande amplitude à la sortie de l'amplificateur. Cette sortie est aussi appelée un <emphasis>« signal »</emphasis>. A la place d'un microphone on peut imaginer d'autre source de capture sonore. « L'amplificateur » peut être intégré directement dans la carte son de votre ordinateur et vous ne pouvez pas le voir.

source: <phrase>Conversion to electronic signal</phrase>
cs: <phrase>Přeměna na elektronický signál</phrase>
de: <phrase>Umwandlung in ein elektronisches Signal</phrase>
es: <phrase>Conversión a señal electrónica</phrase>
fr: <phrase>La conversion d'un signal électronique</phrase>

source: <para>Conversion to electronic signal</para>
cs: <para>Přeměna na elektronický signál</para>
de: <para>Umwandlung in ein elektronisches Signal</para>
es: <para>Conversión a señal electrónica</para>
fr: <para>La conversion d'un signal électronique</para>

source: At this stage, the electrical signal has three limitations that one should keep in mind:
cs: Na tomto stupni má elektronický signál tři omezení, jež je třeba mít na mysli:
de: An dieser Stelle sollte man im Hinterkopf behalten, dass das elektrische Signal drei Beschränkungen unterliegt:
es: En este punto, la señal electrica tiene tres limitaciones que deben tenerse en cuenta:
fr: A ce stade, le signal électrique présente trois limitations dont une doit être bien présente à l'esprit :

source: The <emphasis>amplitude</emphasis> (volume) is limited to some maximum level. This is a consequence of the electronic (amplifiers) that are only able to handle voltages within some specific range. That's no problem as long as sounds are not too loud. In that case the signal would be <emphasis>clipped</emphasis>, which means that the electrical signal will run against it's margins and the result will be disturbed.
cs: <emphasis>Rozkmit</emphasis> (hlasitost) je omezen na určitou nejvyšší možnou úroveň, což je následek používání elektronických zesilovačů, jež jsou schopny zvládnout napětí v rámci určitého stanoveného rozsahu. Není to žádný problémem, pokud není zvuk příliš hlasitý. V tom případě by byl signál <emphasis>zastřižený</emphasis>, což znamená, že elektrický signál poběží proti svým okrajům a výsledek tak bude narušený.
de: Die <emphasis>Amplitude</emphasis> ist auf einen Maximalwert beschränkt. Dies liegt daran, dass elektronische Verstärker nur Spannungen bis zu einer gewissen Grenze verarbeiten können. Das stellt kein Problem dar solange die Lautstärke nicht zu hoch wird. In diesem Fall würde das Signal sonst <emphasis>begrenzt</emphasis>, was bedeutet dass das Signal gegen seine Grenzen läuft und dadurch gestört wird.
es: La <emphasis>amplitud</emphasis> (volumen) es limitada a un cierto nivel máximo. Esto es consecuencia de la electrónica (amplificadores) que es solo capaz de manejar voltajes dentro de ciertos rangos. Esto no es un problema siempre que el sonido no esté demasiado alto. En tal caso la señal sería <emphasis>recortada</emphasis>, lo que significa que una parte de la señal electrica sería truncada a los niveles máximos.
fr: L'<emphasis>amplitude</emphasis> (volume) est limitée à un niveau maximum. Ceci est la conséquence de l'électronique (amplificateurs) qui peut seulement traiter des tensions suivant des plages bien spécifiques. Cela ne pose pas de problème tant que les sons ne sont pas trop forts. Dans ce cas, le signal sera <emphasis>saturé</emphasis>, et une partie sera tronquée au niveau les plus forts.
