Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: For a more complete and up-to-date list, please consult the <ulink url="&url_readme;">'README'</ulink> file that is included in the source distribution. This file also contains some special hints for getting &kwave; running and/or building &kwave; under some distributions.
cs: Kvůli úplnějšímu a nejnovějšímu seznamu požadavků se, prosím, poraďte se souborem README. který je zahrnut ve zdrojové distribuci, nebo jej lze najít zde: <ulink url="&url_readme;"> &url_readme;</ulink>. Tento soubor obsahuje také některé zvláštní tipy, jak program &kwave; pod některými distribucemi &kwave; spustit a/nebo sestavit.
de: Für eine aktuellere und vollständigere Liste lesen Sie bitte die <ulink url="&url_readme;">README</ulink>-Datei, die in der Quellcode-Distribution enthalten ist. Diese Datei enthält auch einige Tipps um &kwave; unter anderen Distributionen zum Laufen zu bekommen oder zu kompilieren.
es: Para una lista más completa y actualizada, por favor, consulte el archivo <ulink url="&url_readme;">'README'</ulink> que se incluye con el código fuente. Este archivo contiene algunos consejos para hacer funcionar &kwave; en ciertas distribuciones.

source: If you intend to compile &kwave; from the sources, you will need at least:
cs: Pokud máte v úmyslu kompilovat program &kwave; ze zdrojových souborů, budete alespoň potřebovat:
de: Wenn Sie vorhaben, &kwave; aus den Quellen zu kompilieren, brauchen Sie zusätzlich mindestens:
es: Si planea compilar &kwave; desde las fuentes necesitará al menos:

source: <ulink url="&url_cmake;">cmake</ulink>-2.4.6 or newer
cs: <ulink url="&url_cmake;">cmake</ulink>-2.4.6 nebo novější
de: <ulink url="&url_cmake;">cmake</ulink>-2.4.6 oder neuer
es: <ulink url="&url_cmake;">cmake</ulink>-2.4.6 o superior

source: A recent C/C++ compiler. GCC-4.x works fine, some older and any newer version (like gcc-4.8 and newer) may work too.
de: Einen aktuellen C/C++ Compiler. GCC-4.x sollte funktionieren, einige ältere und jede neuere Versionen (beispielsweise gcc-4.8 und neuer) sollten ebenfalls funktionieren.
es: Un compilador reciente de C/C++. GCC-4.x funciona correctamente, algunas versiones antiguas y cualquiera más nueva (como gcc-4.8 o superior) pueden funcionar también.

source: The glibc2 (libc-6) development environment. On SuSE systems the package is called "libc", on other systems it might be called "libc-devel".
cs: Vývojové prostředí glibc2 (libc-6). Na systémech se SUSE se tento balíček nazývá "libc", na jiných systémech může být nazván "libc-devel".
de: Die glibc2 (libc-6) Entwicklungsumgebung. Auf SuSE-Systemen heisst das Paket "libc", auf anderen Systemen könnte es "libc-devel" heissen.
es: El entorno de desarrollo glibc2 (libc-6). En SuSE el paquete tiene por nombre "libc", en otros sistemas puede tener por nombre "libc-devel".
fr: De la bibliothèque de développement glibc2 (libc-6). Sur la distribution SuSE Linux, le paquetage se nomme « libc ». Sur d'autres systèmes il peut s'appeler « libc-devel ».

source: The KDE4 development environment: "kdelibs4-devel", "kdemultimedia4-devel", "kdesdk4".
cs: KDE4 vývojové prostředí: "kdelibs4-devel", "kdemultimedia4-devel", "kdesdk4".
de: Die KDE4-Entwicklungsumgebung: "kdelibs4-devel", "kdemultimedia4-devel", "kdesdk4".
es: El entorno de desarrolo KDE4: "kdelibs4-devel", "kdemultimedia4-devel", "kdesdk4".

source: The Qt4 development environment, the package is normally called "qt4-devel" or similar.
cs: Qt4 vývojové prostředí, balíček se obyčejně nazývá "qt4-devel" nebo podobně.
de: Die Qt4-Entwicklungsumgebung, das Paket heisst normalerweise "qt4-devel" oder ähnlich.
es: El entorno de desarrollo Qt4, el paquete normalmente tiene por nombre "qt4-devel" o similar.

source: pulseaudio-4.0 or newer
de: PulseAudio 4.0 oder neuer
es: pulseaudio-4.0 o superior

source: id3lib-devel-3.8.1 or newer
cs: id3lib-devel-3.8.1 nebo vyšší
de: id3lib-devel-3.8.1 oder neuer
es: id3lib-devel-3.8.1 o superior

source: fftw-3.0 or newer
cs: fftw-3.0 nebo vyšší
de: fftw-3.0 oder neuer
es: fftw-3.0 o superior

source: mad-devel-0.15 or newer (if you have the permission to use MP3 code)
cs: mad-devel-0.15 nebo vyšší (pokud máte oprávnění používat kód MP3)
de: mad-devel-0.15 oder neuer (falls Sie die Erlaubnis haben MP3-Code zu verwenden)
es: mad-dvel-0.15 o superior (si tiene permiso para utilizar el codifcador MP3)

source: flac-devel-1.2.0 newer
de: flac-devel-1.2.0 oder neuer
es: flac-devel-1.2.0 o superior

source: If you intend to get the &kwave; sources via GIT, you will also need a current git package.
cs: Pokud máte v úmyslu získat &kwave; zdrojové soubory prostřednictvím Git, budete také potřebovat aktuální balíček "Git".
de: Falls Sie beabsichtigen &kwave; über GIT zu beziehen, brauchen Sie auch ein aktuelles git-Paket.
es: Si su intencio es obtener &kwave; mediante GIT también necesitará un paquete git actual.

source: ...many other packages, please take a look at the <ulink url="&url_readme;">'README'</ulink> file included in the source package.
cs: ...a mnoho dalších balíčků. Podívejte se, prosím, na <ulink url="&url_readme;"> "README"</ulink> soubor je zahrnut ve zdrojovém balíčku.
de: ...einige andere Pakete, bitte lesen Sie hierzu die Datei <ulink url="&url_readme;"> "README"</ulink>, die im Quellpaket enthalten ist.
es: ...muchos otros paquetes, por favor eche un vistazo al archivo <ulink url="&url_readme;">'README'</ulink> incluido en el paquete fuente.

source: Manual Compilation and installation
cs: Vlastnoruční kompilace a instalace
de: Kompilierung und Installation
es: Compilación manual e instalación
fr: Le manuel de compilation et d'installation.

source: Since version 0.7.10 &kwave; uses <ulink url="&url_cmake;">cmake</ulink>, a make system that is also used by KDE itself. So if you know how to build other KDE applications, you should not have any difficulties in building &kwave;. If you run into problems please report them to the &kwave; <link linkend="mailing-list">mailing list</link>.
cs: Od verze 0.7.10 &kwave; používá <ulink url="&url_cmake;">cmake</ulink>, "make" systém, který je používán také prostředím KDE. Takže pokud můžete sestavit jiné KDE aplikace, měl byste moci sestavit i &kwave;. Jestliže se setkáte s problémy, nahlašte je, prosím, do &kwave; <link linkend="mailing-list">poštovního seznamu</link>.
de: Seit Version 0.7.10 verwendet &kwave; <ulink url="&url_cmake;">cmake</ulink>, das Generiersystem das auch von KDE selbst verwendet wird. Somit sollten Sie wenn Sie andere KDE-Applikationen generieren können auch in der Lage sein &kwave; zu generieren. Wenn Sie auf Probleme stossen, melden Sie diese bitte an die &kwave; <link linkend="mailing-list">Mailing-Liste</link>.
es: Desde la versión 0.7.10 &kwave; usa <ulink url="&url_cmake;">cmake</ulink>, un sistema make que es usado también por KDE. Asi que si sabe como compilar otras aplicaciones KDE, no debería tener problemas para compilar &kwave;. Si encuentra algún problema, por favor, comuníquelos a la <link linkend="mailing-list">lista de correo</link>. de &kwave;.

source: In order to compile and install &kwave; on your system, it is best practice to do a <emphasis>out-of-tree</emphasis> build. This means that you hold the sources of &kwave; in one directory and build the package in another (temporary) directory.
cs: Při kompilaci a instalaci &kwave; na váš systém je nejlepší na zkoušku udělat sestavení programu <emphasis>"mimo adresářový strom"</emphasis>. To znamená, že držíte zdrojové soubory od &kwave; v jednom oadresáři, a balíček sestavujete v jiném (dočasném) adresáři.
de: Um &kwave; auf Ihrem System zu generieren und zu installieren, ist es am besten wenn Sie "<emphasis>out-of-tree</emphasis>" generieren. Das bedeutet, dass die Quellen von &kwave; in einem Verzeichnis liegen und die Generierung in einem anderen (temporären) Verzeichnis stattfindet.
es: Con el fin de compilar e instalar &kwave; en su sistema, la práctica más recomendada es compilar fuera del directorio de las fuentes. Esto quiere decir que las fuentes de &kwave; se encontrarán en un directorio y el resultado de la compilación en otro directorio (temporal).

source: Build options
cs: Volby pro sestavení programu
de: Generier-Optionen
es: Opciones de compilación

source: By specifying build options, you can enable or disable some features of &kwave;, like excluding some components or plugins from the generated package. Here is a list of the available options:
cs: Určením voleb pro sestavení programu můžete povolit nebo nepovolit některé funkce &kwave;, např. vyloučení některých částí nebo přídavných modulů z vytvořeného balíčku. Seznam dostupných voleb je zde:
de: Mit Hilfe von Generier-Optionen können Sie einige Funktionalitäten von &kwave; aktivieren oder deaktivieren, beispielsweise können Sie Plugins von der Generierung ausschliessen. Hier eine Auflistung der verfügbaren Optionen:
es: Mediante la especificación de opciones de compilación puede activar o desactivar algunas características de &kwave; como excluir ciertos componentes o complementos del paquete generado. Aquí se detalla una lista con las opciones disponibles:

source: <literal>WITH_ALSA</literal> enable playback/recording via ALSA [<literal>on</literal>/<literal>off</literal>, default=<literal>on</literal>]
cs: <literal>WITH_ALSA</literal> povolit přehrávání/nahrávání prostřednictvím ALSA [<literal>on: zapnuto</literal>/<literal>off: vypnuto</literal>, default=: výchozí=<literal>on: zapnuto</literal>]
de: <literal>WITH_ALSA</literal> aktiviere Wiedergabe / Aufnahme via ALSA [<literal>on</literal>/<literal>off</literal>, Vorgabe=<literal>on</literal>]
es: <literal>WITH_ALSA</literal> activar reproducción/grabación a través de ALSA[<literal>on</literal>/<literal>off</literal>, por defecto=<literal>on</literal>]

source: <literal>WITH_DEBUG</literal> build a debug version [<literal>on</literal>/<literal>off</literal>, default=<literal>off</literal>]
cs: <literal>WITH_DEBUG</literal> sestavit verzi ladění [<literal>on: zapnuto</literal>/<literal>off: vypnuto</literal>, default=: výchozí=<literal>off: vypnuto</literal>]
de: <literal>WITH_DEBUG</literal> generiere eine Debug-Version [<literal>on</literal>/<literal>off</literal>, Vorgabe=<literal>off</literal>]
es: <literal>WITH_DEBUG</literal> compila una versión de depuración<literal>on</literal>/<literal>off</literal>, por defecto=<literal>off</literal>]

source: <literal>WITH_DOC</literal> build online documentation [<literal>on</literal>/<literal>off</literal>, default=<literal>on</literal>]
cs: <literal>WITH_DOC</literal> sestavit dokumentaci na internetu [<literal>on: zapnuto</literal>/<literal>off: vypnuto</literal>, default=: výchozí=<literal>on: zapnuto</literal>]
de: <literal>WITH_DOC</literal> generiere Online-Dokumentation [<literal>on</literal>/<literal>off</literal>, Vorgabe=<literal>on</literal>]
es: <literal>WITH_DOC</literal> compila la documentación en línea [<literal>on</literal>/<literal>off</literal>, por defecto=<literal>on</literal>]

source: <literal>WITH_FLAC</literal> enable support for FLAC files [<literal>on</literal>/<literal>off</literal>, default=<literal>on</literal>]
cs: <literal>WITH_FLAC</literal> povolit podporu souborů FLAC [<literal>on: zapnuto</literal>/<literal>off: vypnuto</literal>, default=: výchozí=<literal>on: zapnuto</literal>]
de: <literal>WITH_FLAC</literal> aktiviere Unterstützung für FLAC-Dateien [<literal>on</literal>/<literal>off</literal>, Vorgabe=<literal>on</literal>]
es: <literal>WITH_FLAC</literal> activa soporte para archivos FLAC [<literal>on</literal>/<literal>off</literal>, por defecto=<literal>on</literal>]

source: <literal>WITH_MP3</literal> enable support for mp3 files [<literal>on</literal>/<literal>off</literal>, default=<literal>off</literal>] Please note that you need the permission to use code covered by the MP3 software patents!
cs: <literal>WITH_MP3</literal> povolit podporu souborů mp3 [<literal>on: zapnuto</literal>/<literal>off: vypnuto</literal>, default=: výchozí=<literal>on: zapnuto</literal>] Všimněte si, prosím, že pro použití kódu zahrnutého do patentů k počítačovým programům potřebujete svolení!
de: <literal>WITH_MP3</literal> aktiviere Unterstützung für MP3-Dateien [<literal>on</literal>/<literal>off</literal>, Vorgabe=<literal>off</literal>] Bitte beachten Sie dass Sie die Erlaubnis haben müssen den Programm-Code zu verwenden der von den MP3 Software-Patenten abgedeckt wird!
es: <literal>WITH_MP3</literal> activa soporte para archivos MP3 [<literal>on</literal>/<literal>off</literal>, por defecto=<literal>off</literal>] ¡Dese cuenta que necesita permiso para usar código bajo patentes de software MP3!

source: <literal>WITH_OGG_OPUS</literal> enable support for Ogg/Opus files [<literal>on</literal>/<literal>off</literal>, default=<literal>on</literal>]
de: <literal>WITH_OGG_OPUS</literal> aktiviere Unterstützung für Ogg/Opus-Dateien [<literal>on</literal>/<literal>off</literal>, Vorgabe=<literal>on</literal>]
es: <literal>WITH_OGG_OPUS</literal> activa soporte para archivos Ogg/Opus [<literal>on</literal>/<literal>off</literal>, por defecto=<literal>on</literal>]

source: <literal>WITH_OGG_VORBIS</literal> enable support for Ogg/Vorbis files [<literal>on</literal>/<literal>off</literal>, default=<literal>on</literal>]
de: <literal>WITH_OGG_VORBIS</literal> aktiviere Unterstützung für Ogg/Vorbis-Dateien [<literal>on</literal>/<literal>off</literal>, Vorgabe=<literal>on</literal>]
es: <literal>WITH_OGG_VORBIS</literal> activa soporte para archivos Ogg/Vorbis [<literal>on</literal>/<literal>off</literal>, por defecto=<literal>on</literal>]

source: <literal>WITH_OPTIMIZED_MEMCPY</literal> use an optimized version of memcpy, available for X86, X86_64 and PPC platforms [<literal>on</literal>/<literal>off</literal>, default=<literal>on</literal>]
cs: <literal>WITH_OPTIMIZED_MEMCPY</literal> použít vyladěnou verzi memcpy, dostupná pro platformy X86, X86_64 a PPC [<literal>zapnuto</literal>/<literal>vypnuto</literal>, výchozí=<literal>zapnuto</literal>]
de: <literal>WITH_OPTIMIZED_MEMCPY</literal> verwende eine optimierte Version der memcpy-Funktion, verfügbar for X86- X86_64 und PPC-Plattformen[<literal>on</literal>/<literal>off</literal>, Vorgabe=<literal>on</literal>]
es: <literal>WITH_OPTIMIZED_MEMCPY</literal>utiliza una versión optimizada de memcpy, disponible para las plataformas X86, X86_64 y PPC [<literal>on</literal>/<literal>off</literal>, por defecto=<literal>on</literal>]

source: <literal>WITH_OSS</literal> enable playback/recording via OSS [<literal>on</literal>/<literal>off</literal>, default=<literal>on</literal>]
cs: <literal>WITH_OSS</literal> povolit přehrávání/nahrávání prostřednictvím OSS [<literal>on: zapnuto</literal>/<literal>off: vypnuto</literal>, default=: výchozí=<literal>on: zapnuto</literal>]
de: <literal>WITH_OSS</literal> aktiviere Wiedergabe / Aufnahme via OSS [<literal>on</literal>/<literal>off</literal>, Vorgabe=<literal>on</literal>]
es: <literal>WITH_OSS</literal> activar reproducción/grabación a través de OSS [<literal>on</literal>/<literal>off</literal>, por defecto=<literal>on</literal>]

source: <literal>WITH_PHONON</literal> enable playback via Phonon (for testing only) [<literal>on</literal>/<literal>off</literal>, default=<literal>off</literal>]
cs: <literal>WITH_PHONON</literal> povolit přehrávání prostřednictvím Phonon (pouze kvůli zkoušení) [<literal>on: zapnuto</literal>/<literal>off: vypnuto</literal>, default=: výchozí=<literal>off: vypnuto</literal>]
de: <literal>WITH_PHONON</literal> aktiviere Wiedergabe Phonon (nur zu Testzwecken) [<literal>on</literal>/<literal>off</literal>, Vorgabe=<literal>off</literal>]
es: <literal>WITH_PHONON</literal> activar reproducción/grabación a través de Phonon (sólo para pruebas) [<literal>on</literal>/<literal>off</literal>, por defecto=<literal>off</literal>]

source: <literal>WITH_PULSEAUDIO</literal> enable playback/recording via PulseAudio [<literal>on</literal>/<literal>off</literal>, default=<literal>on</literal>]
de: <literal>WITH_PULSEAUDIO</literal> aktiviere Wiedergabe / Aufnahme via PulseAudio [<literal>on</literal>/<literal>off</literal>, Vorgabe=<literal>on</literal>]
es: <literal>WITH_PULSEAUDIO</literal> activa la reproducción/grabación a través de PulseAudio [<literal>on</literal>/<literal>off</literal>, por defecto=<literal>on</literal>]

source: These options can be passed to <literal><command>cmake</command></literal> with <command><literal>-D</literal><replaceable>option</replaceable><literal>=</literal><replaceable>value</replaceable></command>. For example, if you want to enable MP3 support, you can pass the corresponding option as follows:
de: Diese Optionen können an <literal><command>cmake</command></literal> mit <command><literal>-D</literal><replaceable>option</replaceable><literal>=</literal><replaceable>value</replaceable></command> übergeben werden. Wenn Sie beispielsweise die Unterstützung von MP3-Dateien aktivieren wollen, können Sie die entsprechende Option wie folgt übergeben:
es: Estas opciones pueden ser pasadas a <literal><command>cmake</command></literal> con <command><literal>-D</literal><replaceable>opción</replaceable><literal>=</literal><replaceable>valor</replaceable></command>. Por ejemplo, si quiere activar el soporte MP3 puede pasar la opción correspondiente como sigue:

source: Building RPM packages from tar.bz2 archives
cs: Vytvoření balíčků RPM z archivů tar.bz2
de: Erstellung von RPM-Paketen aus tar.bz2-Archiven
es: Creando paquetes RPM desde archivos tar.bz2

source: With working rpmbuild -ta
cs: S pracujícím rpmbuild -ta
de: Mit funktionierendem rpmbuild -ta
es: Usando rpmbuild -ta
fr: Utilisation de la commande « rpmbuild -ta »

source: If you are running a system with RPM support, the preferred way to install &kwave; on your system will be the creation of a nice RPM package. First you should get the current source of &kwave;, either as a tar.bz2 archive from the &kwave; download page or check out an up-to-date copy via <link linkend="git-repository">GIT</link> (like described in the <link linkend="git_checkout">chapter about GIT</link>) and read the <link linkend="building_rpm_from_git">next</link> chapter.
de: Wenn Sie ein System mit RPM-Unterstützung haben, ist die bevorzugte Methode der Installation die Erstellung eines RPM Paketes. Als erstes sollten Sie sich die aktuellen Quellen von &kwave; besorgen, entweder als tar.bz2 Archiv von der &kwave; Download-Seite oder als aktuelle Kopie via <link linkend="git-repository">GIT</link> (wie es in dem <link linkend="git_checkout">Kapitel über GIT</link> beschrieben ist) und lesen Sie das <link linkend="building_rpm_from_git">nächste</link> Kapitel.

source: If you have downloaded a tar.bz2 archives of &kwave;, create and install the RPMs just by doing the following steps (where <replaceable>[arch]</replaceable> stands for the platform you have built the package and might be something like <literal>i586</literal>, <literal>i686</literal>, <literal>sparc</literal> or whatever, <replaceable>XXX</replaceable> stands for the version number you have downloaded).
cs: Jestliže jste si stáhl archiv tar.bz2 z &kwave;, vytvořte a instalujte RPM provedením následujících kroků (kde <replaceable>[arch]</replaceable> představuje platformu, pro kterou jste balíček vytvořil a může vypadat nějak takto <literal>i586</literal>, <literal>i686</literal>, <literal>sparc</literal> nebo i jinak, <replaceable>XXX</replaceable> představuje číslo verze, kterou jste si stáhl).
de: Wenn Sie ein tar.bz2 Archiv von &kwave; heruntergeladen haben, erstellen und installieren Sie die RPMs einfach, indem Sie den folgenden Schritten folgen (wobei <replaceable>[arch]</replaceable> für die Plattform steht, für die Sie das Paket erstellt haben, und sollte <literal>i386</literal>, <literal>i586</literal>, <literal>sparc</literal> oder ähnliches sein. <replaceable>XXX</replaceable> steht für die Versionsnummer des heruntergeladenen Paketes).
es: Si ha descargado un archivo tar.bz2 de &kwave;, cree e instale los paquetes RPM siguiendo los siguientes pasos (donde <replaceable>[arch]</replaceable> hace referencia a la plataforma para la que ha creado el paquete y podría ser algo como <literal>i586</literal>, <literal>i686</literal>, <literal>sparc</literal> o cualquier otra, <replaceable>XXX</replaceable> hace referencia al número de versión descargada).

source: To build the &kwave; package and install it do:
cs: Vytvořit &kwave; balíček a instalovat jej do:
de: Erstellen Sie das &kwave; Paket und installieren Sie es wie folgt:
es: Para crear e instalar el paquete &kwave; haga lo siguiente:

source: <emphasis>Note for SuSE users: </emphasis> you have to specify the directory <filename>/usr/src/packages</filename> instead of <filename>/usr/src/redhat</filename> !
cs: <emphasis>Poznámka pro uživatele SuSE: </emphasis> musíte určit adresář <filename>/usr/src/packages</filename> namísto <filename>/usr/src/redhat</filename> !
de: <emphasis>Hinweis für SuSE Benutzer: </emphasis> Sie müssen das Verzeichnis <filename>/usr/src/packages</filename> anstelle von <filename>/usr/src/redhat</filename> angeben!
es: <emphasis>Nota para usuarios de SUSE: </emphasis> tienen que especificar el directorio <filename>/usr/src/packages</filename> en vez de <filename>/usr/src/redhat</filename> !
fr: <emphasis>Pour les utilisateurs d'une distribution SuSE LINUX </emphasis> vous devez spécifier le dossier <filename>/usr/src/packages</filename> à la place de <filename>/usr/src/redhat</filename> !

source: If you haven't seen any errors, then that's it and you can skip the rest of this chapter. If rpm was unable to build the packages and says something like "spec file not found", then go on and read the rest of this section.
cs: Pokud jste neuviděli nějaké chyby, pak je vše v pořádku a vy můžete přeskočit zbytek této kapitoly. Pokud rpm nebylo schopno balíčky vytvořit a říká něco jako "spec file not found", potom pokračujte ve čtení zbytku tohoto oddílu.
de: Wenn keine Fehler aufgetreten sind, dann haben Sie es geschafft und können den Rest des Kapitels überspringen. Wenn rpm nicht in der Lage war, ein Paket zu erstellen und etwas sagt wie "spec file not found", dann sollten Sie den Rest dieses Abschnittes lesen.
es: Si no ve ningún error puede saltarse el resto de este capítulo. Si rpm no fue capaz de crear los paquetes y muestra algo como "spec file not found", entonces lea el resto de la sección de este capítulo.
fr: Si vous n'avez pas de messages d'erreurs, vous pouvez alors passer le reste de ce chapitre. Si le programme utilitaire « rpm » est incapable de construire les paquetages et qu'un message du genre « spec file not found » est affiché, alors le reste du chapitre vous sera utile.

source: With broken rpmbuild -ta support
cs: S pokaženou podporou rpmbuild -ta
de: Mit defektem rpmbuild -ta
es: Soporte rpmbuild -ta no disponible
fr: Que faire lorsque la commande « rpmbuild -ta » ne fonctionne pas ?

source: If you can't get <command>rpmbuild -ta</command> working, here are the steps for making that manually (the hard way):
cs: Pokud se vám nedaří zajistit, aby příkaz <command>rpmbuild -ta</command> pracoval, tady jsou nezbytné kroky pro vlastnoruční provedení tohoto úkonu (složitější způsob):
de: Falls Sie <command>rpmbuild -ta</command> nicht zum laufen bekommen, sind hier die Schritte um dieses "per Hand" (auf die harte Tour) zu bewerkstelligen:
es: Si no puede hacer funcionar <command>rpmbuild -ta</command>, aquí tiene los pasos para hacerlo manualmente (por las malas):
fr: Si vous ne pouvez pas exécuter la commande <command>rpmbuild -ta</command>, il existe plusieurs solutions pour réaliser cette tâche manuellement (solutions délicates) :
