Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: The &kwave; Handbook
cs: &kwave; Příručka
de: Das &kwave; Handbuch
es: Manual de &kwave;

source: ROLES_OF_TRANSLATORS
cs: <othercredit role="translator"><firstname>Pavel</firstname><surname>Fric</surname><affiliation><address><email>pavelfric@seznam.cz.</email></address></affiliation><contrib>Překlad do českého jazyka</contrib></othercredit>
de: <othercredit role="translator"><firstname>Sven-Steffen</firstname><surname>Arndt</surname><affiliation><address><email>ssa29@gmx.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit><othercredit role="translator"><firstname></firstname><surname></surname><affiliation><address><email>Thomas.Eschenbacher@gmx.de</email></address></affiliation><contrib></contrib></othercredit>
es: <othercredit role="translator"><firstname>Carlos</firstname><surname>R.</surname><affiliation><address><email>pureacetone@gmail.com</email></address></affiliation><contrib>Spanish translation</contrib></othercredit>
fr: <othercredit role="translator"> <firstname>CAULIER</firstname><surname>Gilles</surname> <affiliation><address><email>caulier.gilles@free.fr</email></address></affiliation> <contrib>Traductions Française </contrib></othercredit><othercredit role="translator"><firstname>CAULIER</firstname><surname>Danielle</surname><affiliation><address><email>caulier.danielle@free.fr</email></address> </affiliation><contrib>Relecture </contrib></othercredit>

source: &kwave; is a simple sound editor for KDE.
cs: &kwave; je jednoduchý editor zvuku pro prostředí KDE.
de: &kwave; ist ein einfacher Sound-Editor für KDE.
es: &kwave; es un editor de sonido para KDE.

source: Introduction
cs: Úvod
de: Einleitung
es: Introducción

source: This is "&kwave;", a simple sound editor for KDE-4. Its features include:
cs: Toto je "&kwave;", jednoduchý editor zvuku pro KDE-4. Mezi jeho hlavní přednosti patří:
de: Dies ist "&kwave;", ein einfacher Sound-Editor für KDE-4. Er enthält folgende Funktionalität:
es: &kwave; es un editor de sonido para KDE-4. Sus características incluyen:

source: a user interface that can be switched to SDI, MDI or Tab mode
de: eine Benutzerschnittstelle die zwischen SDI-, MDI- und Tab-Modus umgeschaltet werden kann
es: una interfaz de usuario que puede ser cambiada a modo SDI, MDI o pestañas.

source: simple cut, copy and paste functions
cs: funkce jednoduchého vyjímání, kopírování a vkládání
de: einfaches Ausschneiden, Kopieren und Einfügen
es: Funciones de corte, copia y pegado
fr: Les fonctions de couper, copier et coller.

source: multi-level undo/redo
cs: Víceúrovňový krok zpět/znovu
de: mehrstufiges Rückgängig/Wiederherstellen
es: Hacer y deshacer multiple
fr: Le défaire et refaire multiple.

source: labeling of signals
cs: Označení signálů štítkem
de: Setzen von Markern
es: Etiquetado de señales

source: Recording functionality, including pre-recording
cs: Nahrávací funkce včetně nahrávání předem
de: Aufnahme-Funktionalität, inklusive Vorab-Aufnahme
es: Grabación, incluyendo pre-grabación

source: Playback via ALSA and OSS
cs: Přehrávání prostřednictvím ALSA a OSS
de: Wiedergabe via ALSA und OSS
es: Reproducción vía ALSA u OSS

source: Recording via ALSA and OSS
cs: Nahrávání prostřednictvím ALSA a OSS
de: Aufnahme via ALSA und OSS
es: Grabación vía ALSA u OSS

source: MP3 import/export
de: MP3 Import und Export
es: Importación/exportación MP3

source: Ogg/Vorbis import/export
cs: Import a export Ogg/Vorbis
de: Ogg/Vorbis Import und Export
es: Importación/exportación Ogg/Vorbis
fr: Importation et exportation des fichiers au format Ogg / Vorbis.

source: FLAC import/export
cs: Import a export FLAC
de: FLAC Import und Export
es: Importación/exportación FLAC

source: some analysis functions such as Sonagram
cs: Některé analytické funkce jako například Sonogram
de: einige Analyse-Funktionen wie Sonagramm
es: Algunas funciones de análisis como Sonograma
fr: Quelques fonctions d'analyses tel que le Sonogramme.

source: internally uses 24 bit fixed precision for sample data
cs: Vnitřně používá pro data vzorků pevně danou 24 bitovou přesnost
de: verwendet intern 24 Bit Festkommaformat für Sample-Daten
es: Uso interno de 24 bits con coma fija para la información de muestra

source: free selectable sample rates
cs: Volně volitelné vzorkovacá kmitočty
de: frei einstellbare Sample-Raten
es: Frecuencias de muestreo seleccionables
fr: Une sélection libre du taux d'échantillonnage.

source: support for editing of multi channel files
cs: Podpora pro upravování mnohakanálových souborů
de: Unterstützung für das Bearbeiten von mehrspurigen Dateien
es: Soporte para editar archivos multicanal

source: playback of multi channel audio files (audio output will be mixed down to mono or stereo)
cs: Přehrávání mnohakanálových zvukových souborů (zvukový výstup bude smíchán na monofonní nebo stereofonní zvuk)
de: Wiedergabe von mehrspurigen Audiodateien (Audioausgabe wird zu Mono oder Stereo heruntergemischt)
es: Reproducción de archivos de audio multicanal (la salida de audio será reducida a mono o estéreo)

source: extendible through an easy-to-use plugin interface
cs: Grafické rozhraní rozšiřitelné přes snadno použitelný přídavný modul
de: erweiterbar durch eine einfach zu benutzende Plugin-Schnittstelle
es: Extensible a través de una fácil interfaz de complementos
fr: L'extension facile des fonctionnalités du programme par l'ajout de modules externes.

source: import/export of other audio formats through <ulink url="&url_libaudiofile;">audiofile</ulink>
cs: Import a export dalších zvukových formátů přes <ulink url="&url_libaudiofile;">zvukový soubor</ulink>
de: Import/Export weiterer Audio-Dateiformate durch <ulink url="&url_libaudiofile;">libaudiofile</ulink>
es: Importación/exportación de otros formatos de archivo a través de <ulink url="&url_libaudiofile;">audiofile</ulink>

source: If you are interested what has been done and what has still to be done, then look at the files <filename>CHANGES</filename> and <filename>TODO</filename> included in the source package. Help and constructive critics are always welcome.
cs: Pokud vás zajímá, co se už udělalo a co se ještě musí udlat, podívejte se na soubory <filename>CHANGES</filename> a <filename>TODO</filename> zahrnuté ve zdrojovém balíčku. Pomoc a konstruktivní kritika jsou vždy vítány.
de: Wenn Sie interessiert was getan wurde oder was noch getan werden muss, dann schauen Sie in die Dateien <filename>CHANGES</filename> und <filename>TODO</filename>, die den Quelldateien beiliegen. Hilfe und konstruktive Kritik sind immer willkommen.
es: Si está interesado en lo que se ha hecho y en lo qué queda aún por hacer, eche un vistazo a los archivos <filename>CHANGES</filename> y <filename>TODO</filename> incluidos en el paquete fuente. Ayuda y críticas constructivas son siempre bienvenidas.
fr: Si vous êtes intéressé par ce qui a été fait dans ce programme, ou par ce qui reste à faire, alors lisez les fichiers <filename>CHANGES</filename> et <filename>TODO</filename> inclus dans le paquetage des sources. De l'aide et des remarques constructives sont toujours les bienvenues.

source: &kwave; Resources
cs: &kwave; Zdroje
de: &kwave; Ressourcen
es: Recursos de &kwave;

source: So if you want to get in contact with the developers, need some further help on using &kwave;, submit patches, bug reports or other stuf, the following resources might be of interest for you:
cs: Takže jestliže se chcete spojit s vývojáři, potřebujete další pomoc při používání &kwave;, předložit záplaty, hlášení o chybách nebo jiné věci, mohly by vás zajímat následující zdroje:
de: Falls Sie mit den Entwicklern in Kontakt treten wollen, weiterführende Hilfe zur Benutzung von &kwave; brauchen, Patches, Fehlermeldungen oder anderes mitteilen wollen, dann werden die folgenden Adressen von Interesse sein:
es: Asi qué si quiere ponerse en contacto con los desarrolladores, necesita más ayuda en el uso de &kwave;, enviar parches, reportar errores u otras cosas, los siguientes recursos puede ser de interes:

source: Project Homepage<anchor id="project-homepage"/>
cs: Domovská stránka projektu<anchor id="project-homepage"/>
de: Projekt-Homepage<anchor id="project-homepage"/>
es: Página del proyecto<anchor id="project-homepage"/>

source: For information about new up-to-date releases or some other information about this project, take a look at the <ulink url="&url_homepage;">&kwave; homepage</ulink>
cs: Kvůli informacím o nejnovějších vydáních nebo kvůli dalším informacím o tomto projektu se podívejte na <ulink url="&url_homepage;">&kwave; domovská stránka</ulink>
de: Für Informationen über aktuelle Releases oder andere Informationen über dieses Projekt, besuchen Sie bitte die <ulink url="&url_homepage;">&kwave; Homepage</ulink>.
es: Para información sobre últimas versiones u otra información sobre este proyecto, eche un vistazo a <ulink url="&url_homepage;">la página de &kwave;</ulink>

source: Mailing List<anchor id="mailing-list"/>
cs: Poštovní seznam<anchor id="mailing-list"/>
de: Mailing-Liste<anchor id="mailing-list"/>
es: Lista de correo<anchor id="mailing-list"/>

source: If you need some help on using &kwave; or want to get involved in the development, join the Kwave developer mailing list by visiting <ulink url="&url_mailinglist;"> "&url_mailinglist;"</ulink>.
cs: Jestliže potřebujete s používáním pomoci &kwave; nebo se chcete zapojit do vývoje, připojte se k seznamu adres vývojářů Kwave návštěvou <ulink url="&url_mailinglist;"> "&url_mailinglist;"</ulink>.
de: Wenn Sie Hilfe zur Verwendung von &kwave; benötigen oder an der Entwicklung teilnehmen wollen, treten Sie bitte der Mailing-Liste bei indem Sie folgende Seite besuchen: <ulink url="&url_mailinglist;"> "&url_mailinglist;"</ulink>.
es: Si necesita ayuda para usar &kwave; o quiere participar en su desarrollo, únase a la lista de correo de desarrollo visitando <ulink url="&url_mailinglist;"> "&url_mailinglist;"</ulink>.

source: There also is a GIT repository, hosted by <ulink url="&url_sourceforge;">SourceForge</ulink> where you can get the sources of the latest development version. For instructions on how to get access to the repository, read in the chapter about <link linkend="building_rpm_from_git">building from GIT</link>, or look at <ulink url="&url_git_instructions;">"&url_git_instructions;"</ulink>. There also is a nice <ulink url="&url_git_web;">web interface</ulink> you can use to browse through the sources.
cs: Je zde Git repozitář, který je hostován <ulink url="&url_sourceforge;">SourceForge</ulink> , kde můžete získat zdrojové soubory poslední vývojářské verze. Instrukce, jak získat přístup k repozitáři, si přečtěte v kapitole <link linkend="building_rpm_from_git">o sestavování z Git</link>. Podívejte se rovněž na <ulink url="&url_git_instructions;">"&url_git_instructions;"</ulink>,nebo jednoduše procházejte stromem Git za pomoci hezkého webového<ulink url="&url_git_web;">rozhraní pro Git na internetu</ulink>.
de: Es gibt auch ein GIT-Repository, bereitgestellt auf <ulink url="&url_sourceforge;">SourceForge</ulink>, von dem Sie die Quellcodes der jeweils aktuellen Entwicklerversionen beziehen können. Für Anweisungen wie Sie auf das GIT-Repository zugreifen können, lesen Sie bitte das entsprechende Kapitel zum Thema <link linkend="building_rpm_from_git">Erstellen aus GIT</link>, lesen unter <ulink url="&url_git_instructions;"> "&url_git_instructions;"</ulink>. Sie können aber auch einfach die Quellen über das <ulink url="&url_git_web;">Web-Interface</ulink> ansehen.
es: También existe un repositorio GIT hospedado por <ulink url="&url_sourceforge;">SourceForge</ulink> donde puede acceder al código fuente de la última versión en desarrollo. Para instrucciones de cómo obtener acceso al repositorio lea el capítulo sobre <link linkend="building_rpm_from_git">compilando desde GIT</link> o mire en <ulink url="&url_git_instructions;">"&url_git_instructions;"</ulink>. Existe también un <ulink url="&url_git_web;">interfaz web</ulink> para navegar a través del repositorio.

source: &kwave; Revision History
cs: &kwave; Historie revizí
de: &kwave; - Historischer Rückblick
es: Histórico de versiones de &kwave;

source: This project has been started by Martin Wilz in summer 1998 and has been developed and improved by him an some other people. In November 1999 Thomas Eschenbacher has started to fix some little bugs here and there and stepped into the source code of the program deeper and deeper. Up to today he has extended, rewritten or revised nearly every component of the program and spent much time on improving it.
cs: Tento projekt byl zahájen Martinem Wilzem v létě roku 1998 a byl vyvíjen a vylepšován jím a některými dalšími lidmi. V listopadu 1999 začal Thomas Eschenbacher tu a tam opravovat některé malé programové chyby a dostával se krok za krokem hlouběji a hlouběji do zdrojového kódu tohoto programu. Do dneška rozšířil, přepsal nebo přepracoval téměř každou součást programu a strávil mnoho času jeho vylepšováním.
de: Dieses Projekt wurde von Martin Wilz im Sommer 1998 begonnen und wurde entwickelt und verbessert durch ihn und einige andere. Im November 1999 begann Thomas Eschenbacher einige kleine Fehler hier und da zu beheben und vertiefte sich so mehr und mehr in den Quellcode des Programms. Bis heute hat er beinahe alle Komponenten des Programms erweitert, neu geschrieben oder bearbeitet und eine Menge Zeit investiert um es zu verbessern.
es: Este proyecto fue comenzado por Martin Wilz en el verano de 1998 y ha sido desarrolado y mejorado por él y otras personas. En noviembre de 1999 Thomas Eschenbacher comenzó a solucionar pequeños errores y a sumergirse en el código fuente más y más. Hasta hoy él ha ampliado, reescrito o revisado casi cada componente del programa y dedicado mucho tiempo en mejorarlo.
fr: Ce projet a débuté en été 1998 par Martin Wilz et a été développé et amélioré par lui-même et quelques autres contributeurs. En novembre 1999 Thomas Eschenbacher a commencé à corriger quelques petits bogues et à s'investir progressivement dans l'ensemble du code source du programme. Jusqu'à aujourd'hui, il a ajouté, réécri et corrigé progressivement chaque partie du logiciel et a consacré beaucoup de temps pour les améliorer.

source: Since &kwave; v0.8.0 the changelog is no longer included in this manual. So if you are interested in a complete list of changes, you can find the full history here: <ulink url="&url_changelog;"> &url_changelog;</ulink> or browse through the sources on your own through the <ulink url="&url_git_web;">GIT web interface</ulink>.
cs: Od &kwave; v0.8.0 není seznam změn nadále začleněn do této příručky . Takže pokud vás zajímá úplný seznam změn, najdete úplnou historii změn zde: <ulink url="&url_changelog;"> &url_changelog;</ulink> nebo procházejte zdroji pomocí <ulink url="&url_git_web;">rozhraní pro Git na internetu</ulink>..
de: Seit &kwave; v0.8.0 ist die Änderungshistorie nicht mehr im Benutzerhandbuch enthalten. Wenn Sie also an einer vollständigen Liste der Änderungen interessiert sind, finden Sie die vollständige Historie hier: <ulink url="&url_changelog;"> &url_changelog;</ulink>. Alternativ können Sie sich die Änderungen auch über das <ulink url="&url_git_web;">GIT Web-Interface</ulink> ansehen.
es: Desde la versión 0.8.0 de &kwave; el histórico de versiones no es incluido en este manual. Si está interesado en la lista completa de cambios, puede encontrala aquí: <ulink url="&url_changelog;"> &url_changelog;</ulink> o buscar a través del código fuente a través de la <ulink url="&url_git_web;">interfaz web GIT</ulink>.

source: How to obtain &kwave;
cs: Jakým způsobem získat &kwave;
de: Wie erhält man &kwave;
es: Cómo obtener &kwave;

source: &kwave; has an own homepage under <ulink url="&url_homepage;">&url_homepage;</ulink>. Here you can find further information about the project, as well as information about current stable and up-to-date development versions.
cs: &kwave; má vlastní domovskou stránku na adrese <ulink url="&url_homepage;"> &url_homepage;</ulink>. Zde najdete další informace k projektu, a stejně tak i informace o aktuální stabilní a nejnovější vývojářské verzi.
de: &kwave; hat eine eigene Homepage unter <ulink url="&url_homepage;"> &url_homepage;/</ulink>. Hier können Sie weitere Informationen über das Projekt, wie auch Informationen über die aktuelle stabile sowie neueste Entwicklerversionen finden.
es: &kwave; dispone de su propia página web en <ulink url="&url_homepage;">&url_homepage;</ulink>. Ahí puede encontrar más información sobre el proyecto, además de información sobre las versiones estables y de desarrollo actuales.

source: If you want to get a &kwave; release, you have the choice to visit <ulink url="&url_download;">&url_download;</ulink> and
cs: Pokud chcete získat &kwave; vydání, můžete navštívit <ulink url="&url_download;"></ulink> &url_download; a
de: Wenn Sie eine Release von &kwave; wollen können Sie die Seite <ulink url="&url_download;">&url_download;</ulink> besuchen und
es: Si quiere obtener una versión de &kwave; tiene la opción de visitar <ulink url="&url_download;">&url_download;</ulink> y

source: download a binary package of the latest stable version, if there is one for your distribution,
cs: stáhnout si binární balíček poslední stabilní verze. Pokud se tam nachází nějaký určený pro vaši distribuci,
de: ein Binärpaket der letzten stabilen Version herunterladen, sofern eines für Ihre Distribution existiert,
es: descargar la última versión estable en un paquete binario si existe para su distribución,

source: download a source RPM package of the latest stable version,
cs: stáhnout si zdrojový RPM balíček poslední stabilní verze,
de: ein Quell-RPM der letzten stabilen Version herunterladen,
es: descargar la última versión estable en un paquete fuente RPM ,

source: compile on your own, from a .tar.bz2 archive with the source code of the latest stable version,
cs: sestavit si program vlastními silami z .tar.bz2 archivu obsahujícího zdrojový kód poslední stabilní verze,
de: selbst aus einem tar.bz2-Archiv mit den Quellen der letzten stabilen Version kompilieren,
es: compilar usted mismo la última versión estable desde un archivo .tar.bz2 con el código fuente,

source: compile on your own, from the latest GIT source.
cs: sestavit si program vlastními silami z poslední Git verze.
de: aus den per GIT abgerufenen Quellen selbst kompilieren.
es: compilar usted mismo desde la última fuente GIT.

source: Don't be afraid, compiling Kwave should be quite simple even if you are not a programmer. It just needs some developer packages to be installed.
cs: Nebojte se, protože kompilace Kwave by měla být celkem jednoduchou záležitostí i v případě, že nejste programátorem. Je jenom potřeba mít nainstalovány některé vývojářské balíčky.
de: Schrecken Sie nicht davor zurück, Kwave selbst zu kompilieren, auch wenn Sie kein Programmierer sind. Es müssen nur einige Entwickler-Pakete installiert sein.
es: No se asuste, compilar Kwave debería ser bastante sencillo incluso para alguien que no es programador, simplemente necesita algunos paquetes de desarrollo instalados.

source: Requirements
cs: Požadavky
de: Anforderungen
es: Requisitos
fr: Ce dont vous avez besoin.

source: In order to successfully use &kwave;, you need:
cs: Abyste program mohl úspěšně používat &kwave;, potřebujete:
de: Für den erfolgreichen Einsatz von &kwave; brauchen Sie:
es: Con el fin de usar &kwave; exitosamente, necesita:

source: a computer running Linux (&kwave; might also run under some other operating system, but we have never tested this, please let us know if you get it working under some other platform / operating system)
cs: počítač, na němž běží Linux (&kwave; může být spouštěn i pod některými dalšími operačními systémy, ale nikdy jsme tuto možnost nezkoušeli. Dejte nám, prosím, vědět, jestliže se vám podaří spustit Kwave na jiné platformě/pod jiným operačním systémem)
de: einen Computer mit installiertem Linux (&kwave; läuft möglicherweise auch unter anderen Betriebssystemen, aber dieses haben wir nicht getestet. Bitte lassen Sie es uns wissen, wenn Sie es auf anderen Plattformen/ Betriebssystemen zum laufen gebracht haben)
es: un ordenador ejecutando Linux (&kwave; podría funcionar en otros sistemas operativos, pero nunca hemos lo hemos probado, por favor, avísenos si lo hace funcionar en otra plataforma o sistema operativo)

source: working sound playback (not really required for using but what would you do with a sound editor if you can't <emphasis>hear</emphasis> the result of your work?)
cs: Pracující přehrávání zvuku (pro použití programu není ve skutečnosti vyžadováno, ale co byste asi tak dělal s editorem zvuku, kdybyste si nemohl <emphasis>poslechnout</emphasis> výsledek vaší práce?)
de: eine funktionierende Soundwiedergabe (nicht wirklich erforderlich für die Benutzung, aber was sollte man mit einem Soundeditor, wenn man sich nicht die Ergebnisse <emphasis>anhören</emphasis> kann?)
es: un dispositivo reproductor de sonido (realmente no es necesario para usar el programa pero ¿para qué querría un editor de sonido si no puede <emphasis>escuchar</emphasis> el resultado de su trabajo?)
fr: D'un équipement audio pour l'écoute des fichiers sonores (ce n'est pas absolument nécessaire, mais que faire avec un éditeur de pistes audio sans pouvoir <emphasis>écouter</emphasis> le résultat de son travail).

source: KDE-4.5 or higher (at least the libraries, if you are a gnome fan, you can also run &kwave; if the proper libs are installed).
cs: KDE ve verzi 4.5 nebo vyšší (alespoň knihovny. V případě, že jste fonouškem prostředí GNOME, můžete program spouštět také,&kwave; pokud jsou nainstalovány ty správné knihovny).
de: KDE-4.5 oder höher (zumindest die Bibliotheken: &kwave; läuft auch unter gnome, wenn die richtigen Bibliotheken installiert sind).
es: KDE-4.5 o superior (por lo menos las bibliotecas; si es un usuario de gnome también puede utilizar &kwave; si instala las bibliotecas adecuadas).

source: Qt-4.7 or higher (normally comes with KDE4)
de: Qt-4.7 oder neuer (kommt normalerweise bei der Installation von KDE4 mit)
es: Qt-4.7 o superior (normalmente se incluyen con KDE4)

source: ALSA 1.0.14 or higher (for record/playback)
cs: ALSA ve verzi 1.0.14 nebo vyšší (kvůli nahrávání a přehrávání)
de: ALSA 1.0.14 oder höher (für Aufnahme/Wiedergabe)
es: ALSA 1.0.14 o superior (para grabación/reproducción)

source: PulseAudio 4.0 or higher (for record/playback)
de: PulseAudio 4.0 oder höher (für Aufnahme/Wiedergabe)
es: PulseAudio 4.0 o superior (para grabación/reproducción)

source: id3lib-3.8.1 or higher (for ID3 tags)
cs: id3lib ve verzi 1.0.14 nebo vyšší (kvůli ID3 značkám)
de: id3lib-3.8.1 oder neuer (für ID3-Tags)
es: id3lib-3.8.1 o superior (para metadatos ID3)

source: mad-0.15 or higher (optionally for MP3 import/export)
de: mad-0.15 oder neuer (optional für MP3-Import/Export)
es: mad-0.15 o superior (opcionalmente para importación/exportación MP3)

source: flac-1.2.0 or higher (for FLAC import/export)
de: flac-1.2.0 oder neuer (für FLAC-Import/Export)
es: flac-1.2.0 o superior (para importación/exportación FLAC)

source: libsamplerate-0.1.3 or higher (sample rate conversion)
cs: libsamplerate-0.1.3 nebo vyšší (převod kmitočtu)
de: libsamplerate-0.1.3 oder neuer (Abtastraten-Änderung)
es: libsamplerate-0.1.3 o superior (conversión de frecuencia de muestreo)
