Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: String parameters are automatically trimmed (all whitespace at the start and at the end is removed). If that is not wanted, they can be surrounded by double quotes (<token>&quot;</token>). If a string parameter contains special characters (like <quote><token>,</token></quote>, <quote><token>;</token></quote>, <quote><token>#</token></quote> or a <quote><token>&bsol;</token></quote> itself), these special characters have to be escaped by preceding a <quote><token>&bsol;</token></quote>.
de: Text-Parameter werde automatische zugeschnitten (alle Leerzeichen am Anfang und am Ende werden entfernt). Sollte das nicht gewünscht sein, so kann der Parameter in Anführungszeichen (<token>&quot;</token>) gesetzt werden. Falls ein Text Sonderzeichen enthält (wie beispielsweise <quote><token>,</token></quote>, <quote><token>;</token></quote>, <quote><token>#</token></quote> or a <quote><token>&bsol;</token></quote>), so muss diesen ein Escape-Zeichen <quote><token>&bsol;</token></quote> vorangestellt werden .

source: Multiple commands can be concatenated to a <emphasis>command list</emphasis> by using a <quote>;</quote> as separator.
de: Mehrere Befehle können mit einem <quote>;</quote> als Trennzeichen zu einer Befehlsliste zusammengefügt werden.

source: Example: <screen><command>fileinfo(<parameter>Comments</parameter><token>,</token><parameter>"This is an \"example\" comment."</parameter>)</command></screen> This example consist of the command <quote><command>fileinfo</command></quote> and has two parameters: the keyword <parameter>Comments</parameter> and the text <quote><parameter>"This is an \"example\" comment."</parameter></quote>. (These parameters are explained in the corresponding section in the command reference).
de: Beispiel: <screen><command>fileinfo(<parameter>Comments</parameter><token>,</token><parameter>"Dies ist ein \"Beispiel\"-Kommentar."</parameter>)</command></screen> Dieses Beispiel besteht aus dem Befehl <quote><command>fileinfo</command></quote> und hat zwei Parameters: das Schlüsselwort <parameter>Comments</parameter> und den Text <quote><parameter>"Dies ist ein \"Beispiel\"-Kommentar."</parameter></quote>. (Diese Parametersind im zugehörigen Abschnitt der Befehlsreferenz beschrieben).

source: Using the Command Line
de: Verwenden der Kommandozeile

source: In addition to the command line options listed in the section <link linkend="command_line">Command Line</link> which are used to start &kwave; in iconified mode or without splash screen, you can pass text commands on the command line, encoded in a special URI format:
de: Zusätzlich zu den im Abschnitt <link linkend="command_line">Kommandozeile</link> beschriebenen Parametern zum Starten von &kwave; im minimierten Zustand oder ohne Begrüßungsbildschirm können Sie auch Text-Befehle per Kommandozeile übergeben, kodiert als spezielle Adresse (URI):

source: kwave:<replaceable>command</replaceable>[?<replaceable>parameter</replaceable>[,<replaceable>parameter</replaceable> ...] ]
de: kwave:<replaceable>Befehl</replaceable>[?<replaceable>parameter</replaceable>[,<replaceable>Parameter</replaceable> ...] ]

source: The rules for transforming a &kwave; text command into a valid URI are as follows:
de: Die Regeln zur Übersetzung eines &kwave;-Text-Befehls in eine gültige Adresse (URI) sind wie folgt:

source: The URI starts with the word <literal>kwave</literal>, followed by a <quote><token>:</token></quote> and the command name.
de: Die Adresse (URI) startet mit dem Wort <literal>kwave</literal>, gefolgt von einem <quote><token>:</token></quote> und dem Befehls-Namen.

source: If the command has parameters, they have to be appended after the command name, using a <quote><token>?</token></quote> as separator.
de: Falls der Befehl Parameter besitzt, müssen diese nach dem Befehl, getrennt mit einem <quote><token>?</token></quote> angehängt werden.

source: Multiple parameters can be appended by using a <quote><token>,</token></quote> as separator.
de: Mehrere Parameter können mit einem <quote><token>,</token></quote> als Trennzeichen angehängt werden.

source: All special characters in command name and parameters have to be URL encoded. Here a list of the translations:
de: Alle Sonderzeichen in Befehlsnamen und Parameter müssen als URL kodiert werden. Hier eine Liste von Zeichenersetzungen:

source: URL Encoding Translation Table
de: Übersetzungstabelle für URL-Kodierung

source: encoded
de: kodiert

source: (space)
de: (Leerzeichen)

source: &kwave; Script Files
de: &kwave;-Skripte

source: General Structure
de: Allgemeine Struktur

source: A &kwave; <emphasis>script</emphasis> consists of a list of lines, where each line can be:
de: Ein &kwave;-<emphasis>Skript</emphasis> besteht aus einer Liste von Zeilen, wobei jede Zeile in eine der folgenden Kategorien eingeteilt werden kann:

source: a single <emphasis>command</emphasis>,
de: ein einzelner <emphasis>Befehl</emphasis>,

source: a <emphasis>command list</emphasis>, with two or more commands concatenated by a <quote><token>;</token></quote>.
de: eine <emphasis>Befehls-Liste</emphasis>, mit zwei oder mehr per <quote><token>;</token></quote> voneinander getrennten Befehlen.

source: a <emphasis>comment</emphasis>,
de: ein <emphasis>Kommentar</emphasis>,

source: a <emphasis>label</emphasis>
de: eine <emphasis>Sprungmarke</emphasis>

source: or an <emphasis>empty line</emphasis>, that contains whitespace only
de: oder eine <emphasis>Leerzeile</emphasis>, die nur aus Leerzeichen besteht

source: Comments and Empty Lines
de: Kommentare und Leerzeilen

source: All characters that follow a <quote><token>#</token></quote> (except when used in quotes or when escaped) are treated as comments, they will be silently ignored.
de: Alle Zeichen die einem <quote><token>#</token></quote> folgen (außer wenn in Anführungszeichen gesetzt oder mit vorgestelltem Escape-Zeichen) werden als Kommentare behandelt, sie werden stillschweigend ignoriert.

source: Lines that contain only whitespace or comments are ignored as well.
de: Zeilen die nur aus Leerzeichen oder Kommentaren bestehen werden ebenfalls ignoriert.

source: Termination
de: Beenden

source: A &kwave; script terminates either when all commands have been executed successfully without an error or when a command has returned an error code. There is no special command for aborting the execution of a script. If you want to implement a possibility for the user to end a script, you can use the command <quote><link linkend="cmd_sect_msgbox"><command>msgbox</command></link>(<parameter><replaceable>text</replaceable></parameter>)</quote>. This shows a message box with the two buttons <quote><guibutton>OK</guibutton></quote> (which lets the script continue) and <quote><guibutton>Cancel</guibutton></quote> (which returns an error code and stops the script).
de: Ein &kwave;-Skript beendet sich entweder wenn alle Befehle ohne einen Fehler ausgeführt wurden oder sobald ein Befehl einen Fehlercode zurück gibt. Es gibt keinen speziellen Befehl zum Abbrechen eines Skriptes. Falls Sie jedoch eine Möglichkeit vorsehen wollen dass der Anwender ein Skript beenden kann, so steht Ihnen der Befehl <quote><link linkend="cmd_sect_msgbox"><command>msgbox</command></link>(<parameter><replaceable>Text</replaceable></parameter>)</quote> zur Verfügung. Dieser zeigt ein Benachrichtigungs-Fenster mit den beiden Schaltflächen <quote><guibutton>OK</guibutton></quote> (um das Skript weiter auszuführen) und der Schaltfläche <quote><guibutton>Abbrechen</guibutton></quote> (um das Skript zu beenden).

source: Labels
de: Marker
es: Marcadores

source: Lines that consist only of an identifier, followed by a <quote><token>:</token></quote> are treated <emphasis>labels</emphasis>. They can be referenced later in the script by the special keyword <quote><command>GOTO</command></quote> <footnote><para>Note: Please don't mix up the keyword <quote><command>GOTO</command></quote> with the text command <quote><link linkend="cmd_sect_goto"><command>goto</command></link> (<parameter><replaceable>position</replaceable></parameter>)</quote> ! </para></footnote> ,which makes the execution of the script continue at the location of that label (see example below).
de: Zeilen die nur aus einem Bezeichner gefolgt von einem <quote><token>:</token></quote> bestehen werden als <emphasis>Sprungmarken</emphasis> betrachtet. Auf diese kann man sich an anderen Stellen im Skript mit dem Schlüsselwort <quote><command>GOTO</command></quote> <footnote><para>Hinweis: Bitte verwechseln Sie nicht das Schlüsselwort <quote><command>GOTO</command></quote> mit dem Textbefehl <quote><link linkend="cmd_sect_goto"><command>goto</command></link> (<parameter><replaceable>Position</replaceable></parameter>)</quote> ! </para></footnote> beziehen, das bewirkt dass die Ausführung des Skriptes an der Stelle mit der angegebenen Sprungmarke fortgesetzt wird (siehe Beispiel unten).

source: A line that contains a label must not contain any other content (except comments or whitespace) after the <quote><token>:</token></quote>.
de: Eine Zeile die eine Sprungmarke enthält darf nach dem <quote><token>:</token></quote> keinen anderen Inhalt (mit Ausnahme von Kommentaren und Leerzeichen) enthalten.

source: Example:
de: Beispiel:
es: Ejemplo:

source: <replaceable>start:</replaceable><literal> # &lt;= this is a label</literal> <literal> # do something...</literal> <literal> </literal><command>msgbox</command>(<parameter>once again?</parameter>) <literal> </literal><command>GOTO <parameter>start</parameter></command>
de: <replaceable>start:</replaceable><literal> # &lt;= dies ist ein Marker</literal> <literal> # tue irgendwas...</literal> <literal> </literal><command>msgbox</command>(<parameter>noch einmal?</parameter>) <literal> </literal><command>GOTO <parameter>start</parameter></command>

source: Command Reference
de: Befehlsreferenz

source: Alphabetical Index
de: Alphabetischer Index

source: Shows a dialog window with information about the KDE version used by the computer &kwave; is running at.
de: Zeigt ein Dialogfenster mit Informationen über die KDE-Version die auf dem Computer installiert ist der gerade &kwave; ausführt.

source: Add a new label at a given position. If the given position already contains a label, then this command does nothing. The label can be given an optional description.
de: Fügt einen Marker an der angegebenen Position hinzu. Falls an der angegeben Position bereits ein Marker existiert, bewirkt dieser Befehl nichts. Dem Marker kann auch eine Beschreibung zugewiesen werden.

source: Parameters
de: Parameter
es: Parámetros

source: position in samples where to insert the label
de: Position in Samples an der der Marker hinzugefügt werden soll

source: some descriptive text (optional)
de: eine kurze Beschreibung (optional)

source: Adds a new track after all existing tracks.
de: Fügt eine neue pur nach allen existierenden Spuren hinzu.

source: See also
de: Siehe auch

source: Discards the current content of the clipboard (might free some memory).
de: Verwirft den aktuellen Inhalt der Zwischenablage (kann etwas Arbeitsspeicher frei machen).

source: Closes the current file. If the GUI is configured to MDI or Tab mode, this also closes the corresponding sub window.
de: Schließt die aktuelle Datei. Wenn die graphische Oberfläche im MDI- oder Tab-Modus konfiguriert ist, schließt dies auch das zugehörige Unterfenster.

source: Corresponds to to the <guibutton>Continue</guibutton> toolbar button and lets the playback continue if it is paused.
de: Entspricht der Werkzeugleisten-Schaltfläche <guibutton>Fortsetzen</guibutton> und lässt die Wiedergabe fortsetzen wenn sie angehalten wurde.

source: Copies the content of the current selection to the clipboard. If the selection is empty, this command does nothing and the content of the clipboard remains unchanged. Only the content of the currently selected tracks is copied to the clipboard!
de: Kopiert den Inhalt der aktuellen Auswahl in die Zwischenablage. Wenn die Auswahl leer ist, bewirkt dieser Befehl nichts und der Inhalt der Zwischenablage bleibt unverändert. Es wird nur der Inhalt der aktuell ausgewählten Spuren in die Zwischenablage kopiert!

source: Crops the signal to the current selection by deleting everything that is after and before the current selection. Affects all tracks. If nothing is selected this command does nothing.
de: Schneidet das Signal auf die aktuelle Auswahl zu indem alles was sich vor oder nach der Auswahl befindet gelöscht wird. Wirkt sich auf alle Spuren aus. Wenn kein Bereich markiert ist bewirkt dieser Befehl nichts.

source: Copies the content of the current selection to the clipboard and removes it from the signal. If the selection is empty, this command does nothing and the content of the clipboard remains unchanged. Only the content of the currently selected tracks is copied to the clipboard, but the selected range is deleted from all tracks.
de: Kopiert den Inhalt der aktuellen Auswahl in die Zwischenablage und löscht ihn aus dem Signal. Wenn die aktuelle Auswahl leer ist bewirkt dieser Befehlt nichts und der Inhalt der Zwischenablage bleibt unverändert. Nur der Inhalt der selektierten Spuren wird in die Zwischenablage kopiert, der ausgewählte Bereich wird jedoch von allen Spuren gelöscht.

source: &i18n-cmd_syntax;<command>&no-i18n-cmd_delayed;</command>( <replaceable>milliseconds</replaceable>, <replaceable>command</replaceable> )
de: &i18n-cmd_syntax;<command>&no-i18n-cmd_delayed;</command>( <replaceable>Millisekunden</replaceable>, <replaceable>Befehl</replaceable> )

source: Executes a <replaceable>command</replaceable> after a given delay. Please note that the command is executed asynchronously after the given time has elapsed. Multiple commands can be queued, where the delays are relative to the last queued command. This command is intended to be used for queuing commands when taking screenshots for documentation purposes.
de: Führt einen <replaceable>Befehl</replaceable> nach einer angegebenen Verzögerung aus. Bitte beachten Sie dass der Befehl asynchron ausgeführt wird nachdem die angegebene Zeit abgelaufen ist. Mehrere Befehle können eingereiht werden, die Verzögerungszeit beginnt dann jeweils nach der Ausführung des letzten eingereihten Befehls. Dieser Befehl ist gedacht um Befehle vorzubereiten die beim Erstellen von Bildschirmfotos benötigt werden.

source: <parameter>milliseconds</parameter>:
de: <parameter>Millisekunden</parameter>:

source: number of whole milliseconds to wait before executing the command
de: Anzahl der ganzen Millisekunden die vor der Ausführung des Befehls gewartet werden sollen

source: <parameter>command</parameter>:
de: <parameter>Befehl</parameter>:

source: a command, including parameters to be executed after the given delay
de: Ein Befehl der nach der angegebenen Verzögerung ausgeführt werden soll, inklusive Parameter

source: Deletes the currently selected range of samples. If the selection is empty, this command does nothing. Affects all tracks.
de: Löscht den aktuell ausgewählten Bereich von Samples. Wenn die Auswahl leer ist bewirkt dieser Befehlt nichts. Wirkt sich auf alle Spuren aus.

source: Deletes a label, identified by it's index (starting from zero). If no label with the given index exists, this command does nothing.
de: Löscht einen Marker anhand ihres Index (beginnend bei Null). Wenn an dem angegeben Index kein Marker existiert, bewirkt dieser Befehl nichts.

source: index of the label to delete, starting with 0
de: Index des zu löschenden Markers, beginnend bei 0

source: Deletes a track, identified by it's index (starting from zero). If no track with the given index exists, this command exits with an error.
de: Löscht eine Spur anhand ihres Index (beginnend bei Null). Wenn keine Spur mit dem angegebenen Index existiert, kehrt dieser Befehl mit einem Fehler zurück.

source: index of the track to delete, starting with 0
de: Index der zu löschenden Spur, beginnend bei 0

source: Prints a list of all meta data entries to the console, for diagnostic purposes. (Only available when &kwave; has been compiled with the option <literal>WITH_DEBUG</literal> switched on).
de: Gibt eine Liste von Metadaten auf der Konsole aus, zu diagnostischen Zwecken. (Nur verfügbar wenn &kwave; mit der aktivierten Option <literal>WITH_DEBUG</literal> generiert wurde).

source: Opens a window in which the user can edit the position and the description of a label, which is identified by it's index (starting from zero). If no label with the given index exists, this command does nothing.
de: Öffnet ein Dialogfenster mit dem der Anwender die Position und der Beschreibung eines Markers anhand ihres Null-basierten Index ändern kann. Wenn kein Marker mit dem angegeben Index existiert, bewirkt diese Funktion nichts.

source: index of the label to edit, starting with 0
de: Index des zu bearbeitenden Markers, beginnend bei 0

source: Expands the current selection to the labels left and right from the current selection borders. If the border of selection already is on a label, it stays unchanged. If there is no label left or right of the current selection, it will be expanded to the start or end of the file.
de: Erweitert die Auswahl auf die Marker links und rechts von der aktuellen Auswahl. Wenn eine Grenze der Auswahl bereits auf einem Marker liegt, wird sie nicht verändert. Wenn links oder rechts von der Auswahl kein Marker liegt, wird sie zum Start oder Ende der Datei erweitert.

source: Set a file info entry to a new value.
de: Setzt einen Eintrag der Dateiinformationen auf einen neuen Wert.

source: <parameter>keyword</parameter>:
de: <parameter>Schlüsselwort</parameter>:

source: keyword of the entry
de: Schlüsselwort des Eintrags

source: <parameter>value</parameter>:
de: <parameter>Wert</parameter>:

source: value of the entry
de: Wert des Eintrags

source: Corresponds to to the <guibutton>Forward</guibutton> toolbar button. If the playback is currently running, it skips forward by 1/10 of the visible range. If the playback is not running, this does the same as the command <command>&no-i18n-cmd_view_scroll_right;</command>.
de: Entspricht der Werkzeugleisten-Schaltfläche <guibutton>Vorspulen</guibutton>. Wenn die Wiedergabe aktuell läuft, wird um 1/10 des sichtbaren Bereichs vorgespult. Wenn die Wiedergabe nicht läuft, entspricht dieser Befehl dem Befehl <command>&no-i18n-cmd_view_scroll_right;</command>.

source: &i18n-cmd_syntax;<command>&no-i18n-cmd_goto;</command>(<replaceable>pos</replaceable>)
de: &i18n-cmd_syntax;<command>&no-i18n-cmd_goto;</command>(<replaceable>Position</replaceable>)

source: Sets the cursor to the given position and makes it visible in current view. After this the selection has zero length.
de: Setzt den Cursor an die angegebene Position und verschiebt die aktuelle Ansicht so daß die Position angezeigt wird. Anschließend hat die Auswahl die Länge Null.

source: position in samples where to go to
de: Position in Samples an die gesprungen werden soll

source: &i18n-cmd_syntax;<command>&no-i18n-cmd_insert_at;</command>(<replaceable>pos</replaceable>)
de: &i18n-cmd_syntax;<command>&no-i18n-cmd_insert_at;</command>(<replaceable>Position</replaceable>)

source: Inserts the content of the clipboard at the given position, like the command <command>&no-i18n-cmd_paste;()</command>(). If the clipboard is currently empty, this function does nothing.
de: Fügt den Inhalt der Zwischenablage an der angegeben Position ein, so wie der Befehl <command>&no-i18n-cmd_paste;()</command>(). Ist die Zwischenablage leer bewirkt dieser Befehl nichts.

source: position in samples where to insert
de: Position in Samples an der eingefügt werden soll

source: Inserts a new track at the given index, using the current length and sample rate settings of the signal. If the index is higher than or equal to the current number of tracks, it will be appended as the last track, same as by the command <command>&no-i18n-cmd_add_track;()</command>. The index of all existing tracks at and after the given index will be incremented by one.
de: Fügt an dem angegebenen Index eine neue Spur hinzu, mit der Länge und Abtastrate des aktuellen Signals. Wenn der Index größer oder gleich der aktuellen Anzahl der Spuren ist, wird die Spur als letzte Spur angehängt,so wie durch den Befehl <command>&no-i18n-cmd_add_track;()</command>. Der Index aller Spuren ab der Position an der eingefügt wurde wird hierdurch um eins erhöht.

source: index of the track to insert, starting with 0
de: Index der einzufügenden Spur, beginnend bei 0

source: &i18n-cmd_syntax;<command>&no-i18n-cmd_loadbatch;</command>(<replaceable>filename</replaceable>)
de: &i18n-cmd_syntax;<command>&no-i18n-cmd_loadbatch;</command>(<replaceable>Dateiname</replaceable>)

source: Opens a &kwave; script file and processes the commands in it. Uses the context of the currently opened file or the current main window if no file is loaded.
de: Öffnet eine &kwave;-Skript-Datei und führt die darin enthaltenen Befehle aus. Verwendet den Kontext der aktuell geöffneten Datei oder des aktuell geöffneten Fensters falls keine Datei geladen ist.

source: <parameter>filename</parameter>:
de: <parameter>Dateiname</parameter>:

source: name of the kwave script file including path and extension
de: Name der &kwave;-Skripts-Datei, inklusive Pfad und Dateierweiterung

source: Corresponds to to the <guibutton>Loop</guibutton> toolbar button. Starts the playback (if it is not already running) and lets it play in a loop.
de: Entspricht der Werkzeugleisten-Schaltfläche <guibutton>Schleife</guibutton>. Startet die Wiedergabe (falls sie noch nicht läuft) und lässt sie in einer Schleife spielen.

source: &i18n-cmd_syntax;<command>&no-i18n-cmd_menu;</command> (<replaceable>command</replaceable>, <replaceable>path</replaceable>, [<replaceable>hotkey</replaceable>], [<replaceable>id</replaceable>])
de: &i18n-cmd_syntax;<command>&no-i18n-cmd_menu;</command> (<replaceable>Befehl</replaceable>, <replaceable>Pfad</replaceable>, [<replaceable>Tastenkürzel</replaceable>], [<replaceable>ID</replaceable>])

source: This is a very powerful command, which is used to add a new entry to the menu or to modify an existing entry. It determines which <emphasis>command</emphasis> is executed when the menu entry is activated, which <emphasis>icon</emphasis> is shown in the menu and which <emphasis>hotkey</emphasis> is used. Each menu entry can be <emphasis>disabled</emphasis> or <emphasis>hidden</emphasis>, can be assigned a unique <emphasis>id</emphasis> and can also join a <emphasis>menu group</emphasis>.
de: Dies ist ein sehr mächtiger Befehl, der verwendet wird um Menüeinträge hinzuzufügen oder zu ändern. Man legt damit fest welcher <emphasis>Befehl</emphasis> ausgeführt wird wenn der Eintrag aktiviert wird, welches <emphasis>Icon</emphasis> im Menü angezeigt und welches <emphasis>Tastenkürzel</emphasis> verwendet wird. Jeder Menüeintrag kann <emphasis>deaktiviert</emphasis> oder <emphasis>ausgeblendet</emphasis> werden, ihm kann eine eindeutige <emphasis>ID</emphasis> zugewiesen werden und er kann auch zu einer oder mehreren <emphasis>Menü-Gruppen</emphasis> hinzugefügt werden.

source: You normally do not need this command within a &kwave; script!
de: Normalerweise brauchen Sie dies nicht in einem &kwave;-Skript!
