Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: select the whole signal: <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>A</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Selection</guimenuitem><guimenuitem>All</guimenuitem> </menuchoice>
cs: vybrat celý signál: <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>A</keycap></keycombo></shortcut> <guimenu>Úpravy</guimenu><guimenuitem>Výběr</guimenuitem><guimenuitem>Vše</guimenuitem> </menuchoice>
de: Auswahl des gesamten Signals: <menuchoice> <shortcut><keycombo><keycap>Strg</keycap><keycap>A</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Auswahl</guimenuitem><guimenuitem>Alles</guimenuitem> </menuchoice>
es: seleccionar toda la señal:<menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>A</keycap></keycombo></shortcut> <guimenu>Editar</guimenu><guimenuitem>Selección</guimenuitem><guimenuitem>Todo</guimenuitem> </menuchoice>
fr: Sélectionner entièrement la piste sonore : <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>A</keycap></keycombo></shortcut> <guimenu>Édition</guimenu><guimenuitem>Sélection</guimenuitem><guimenuitem>Tout</guimenuitem> </menuchoice>

source: remove any selection and select "nothing": <menuchoice> <shortcut><keycombo><keycap>N</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Selection</guimenuitem><guimenuitem>Nothing</guimenuitem> </menuchoice>
cs: odstranit všechen výběr a vybrat "nic": <menuchoice> <shortcut><keycombo><keycap>N</keycap></keycombo></shortcut> <guimenu>Úpravy</guimenu><guimenuitem>Výběr</guimenuitem><guimenuitem>Nic</guimenuitem> </menuchoice>
de: entfernen der Auswahl und markieren von "nichts": <menuchoice> <shortcut><keycombo><keycap>N</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Auswahl</guimenuitem><guimenuitem>Nichts</guimenuitem> </menuchoice>
es: eliminar cualquier selección y no seleccionar nada: <menuchoice> <shortcut><keycombo><keycap>N</keycap></keycombo></shortcut> <guimenu>Editar</guimenu><guimenuitem>Selección</guimenuitem><guimenuitem>Nada</guimenuitem> </menuchoice>
fr: Retirer la sélection et ne « rien » sélectionner : <menuchoice><shortcut><keycombo><keycap>N</keycap></keycombo></shortcut><guimenu>Édition</guimenu><guimenuitem>Sélection</guimenuitem><guimenuitem>Rien</guimenuitem></menuchoice>

source: the currently visible area: <menuchoice> <shortcut><keycombo><keycap>V</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Selection</guimenuitem><guimenuitem>Visible</guimenuitem> </menuchoice>
cs: v současnosti viditelná oblast: <menuchoice> <shortcut><keycombo><keycap>V</keycap></keycombo></shortcut> <guimenu>Úpravy</guimenu><guimenuitem>Výběr</guimenuitem><guimenuitem>Viditelná oblast</guimenuitem> </menuchoice>
de: die aktuell sichtbare Fläche: <menuchoice> <shortcut><keycombo><keycap>V</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Auswahl</guimenuitem><guimenuitem>Sichtbarer Bereich</guimenuitem> </menuchoice>
es: área visible: <menuchoice> <shortcut><keycombo><keycap>V</keycap></keycombo></shortcut> <guimenu>Editar</guimenu><guimenuitem>Selección</guimenuitem><guimenuitem>Área visible</guimenuitem> </menuchoice>
fr: La zone visible courante : <menuchoice> <shortcut><keycombo><keycap>V</keycap></keycombo></shortcut> <guimenu>Édition</guimenu><guimenuitem>Sélection</guimenuitem><guimenuitem>Région visible</guimenuitem></menuchoice>

source: the next block of samples, starting one sample after the end of the current selection and with the same length: <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>+</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Selection</guimenuitem><guimenuitem>Next</guimenuitem> </menuchoice>
cs: další blok vzorků, počínaje prvním vzorkem po konci nynějšího výběru a se stejnou délkou: <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>+</keycap></keycombo></shortcut> <guimenu>Úpravy</guimenu><guimenuitem>Výběr</guimenuitem><guimenuitem>Další</guimenuitem> </menuchoice>
de: den nächsten Sample-Block, beginnend ein Sample nach dem Ende der aktuellen Auswahl und mit der gleichen Länge: <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>+</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Auswahl</guimenuitem><guimenuitem>Nächste</guimenuitem> </menuchoice>
es: el siguiente bloque de muestras comenzando una muestra después del final de la selección actual y con la misma longitud: <menuchoice> <shortcut><keycombo><keycap>Mayúsculas</keycap><keycap>+</keycap></keycombo></shortcut> <guimenu>Editar</guimenu><guimenuitem>Selección</guimenuitem><guimenuitem>Siguiente</guimenuitem> </menuchoice>
fr: Le prochain bloc d'échantillons, commençant au premier échantillon après la fin de la sélection courante et avec la même largeur : <menuchoice><shortcut><keycombo><keycap>Shift</keycap><keycap>+</keycap></keycombo></shortcut><guimenu>Édition</guimenu><guimenuitem>Sélection</guimenuitem><guimenuitem>Suivant</guimenuitem></menuchoice>

source: (Hint: use the "<keycap>+</keycap>" key from the numeric keypad!)
cs: (Rada: použijte klávesu "<keycap>+</keycap>" na numerické klávesnici!)
de: (Hinweis: benutzen Sie die "<keycap>+</keycap>" Taste vom numerischen Ziffernblock!)
es: (Pista: use la tecla "<keycap>+</keycap>" del teclado numérico!)
fr: (Astuce : utiliser la touche « <keycap>+</keycap> » du pavé numérique !)

source: the previous block of samples, ending one sample before the start of the current selection and with the same length: <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>-</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Selection</guimenuitem><guimenuitem>Previous</guimenuitem> </menuchoice>
cs: předchozí blok vzorků, konče prvním vzorkem před začátkem nynějšího výběru a se stejnou délkou: <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>-</keycap></keycombo></shortcut> <guimenu>Úpravy</guimenu><guimenuitem>Výběr</guimenuitem><guimenuitem>Předchozí</guimenuitem> </menuchoice>
de: den vorhergehenden Sample-Block, bis ein Sample vor dem Anfang der aktuellen Auswahl und mit der gleichen Länge: <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>-</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Auswahl</guimenuitem><guimenuitem>Vorherige</guimenuitem> </menuchoice>
es: el anterior bloque de muestras terminando una muestra antes del comienzo de la selección actual y con la misma longitud: <menuchoice> <shortcut><keycombo><keycap>Mayúsculas</keycap><keycap>-</keycap></keycombo></shortcut> <guimenu>Editar</guimenu><guimenuitem>Selección</guimenuitem><guimenuitem>Anterior</guimenuitem> </menuchoice>
fr: Le précédent bloc d'échantillons, finissant au premier échantillon avant le début de la sélection courante et avec la même largeur : <menuchoice><shortcut><keycombo><keycap>Shift</keycap><keycap>-</keycap></keycombo></shortcut><guimenu>Édition</guimenu><guimenuitem> Sélection</guimenuitem><guimenuitem>Précédent</guimenuitem></menuchoice>

source: (Hint: use the "<keycap>-</keycap>" key from the numeric keypad!)
cs: (Rada: použijte klávesu "<keycap>-</keycap>" na numerické klávesnici!)
de: (Hinweis: benutzen Sie die "<keycap>+</keycap>" Taste vom numerischen Ziffernblock!)
es: (Pista: use la tecla "<keycap>-</keycap>" del teclado numérico!)
fr: (Astuce : utiliser la touche « <keycap>-</keycap> » du pavé numérique !)

source: expand the selection to the start of the signal (first sample): <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>Home</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Selection</guimenuitem><guimenuitem>to start</guimenuitem> </menuchoice>
cs: rozšířit výběr po začátek signálu (po první vzorek): <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>Home</keycap></keycombo></shortcut> <guimenu>Úpravy</guimenu><guimenuitem>Výběr</guimenuitem><guimenuitem>Po začátek</guimenuitem> </menuchoice>
de: erweitern der Auswahl bis zum Anfang des Signals (erstes Sample): <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>Pos1</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Auswahl</guimenuitem><guimenuitem>bis zum Anfang</guimenuitem> </menuchoice>
es: expandir la selección al principio de la señal (primera muestra): <menuchoice> <shortcut><keycombo><keycap>Mayúsculas</keycap><keycap>Inicio</keycap></keycombo></shortcut> <guimenu>Editar</guimenu><guimenuitem>Selección</guimenuitem><guimenuitem>al principio</guimenuitem> </menuchoice>
fr: Étendre la sélection jusqu'au début de la piste sonore (premier échantillon) : <menuchoice><shortcut><keycombo><keycap>Shift</keycap><keycap>Home</keycap></keycombo></shortcut><guimenu>Édition</guimenu><guimenuitem>Sélection</guimenuitem><guimenuitem>Au début</guimenuitem></menuchoice>

source: expand the selection to the end of the signal (last sample): <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>End</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Selection</guimenuitem><guimenuitem>to end</guimenuitem> </menuchoice>
cs: rozšířit výběr po konec signálu (po poslední vzorek): <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>End</keycap></keycombo></shortcut> <guimenu>Úpravy</guimenu><guimenuitem>Výběr</guimenuitem><guimenuitem>Po konec</guimenuitem> </menuchoice>
de: erweitern der Auswahl bis zum Ende des Signals (letztes Sample): <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>Ende</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Auswahl</guimenuitem><guimenuitem>bis zum Ende</guimenuitem> </menuchoice>
es: expandir la selección al final de la señal (última muestra): <menuchoice> <shortcut><keycombo><keycap>Mayúsculas</keycap><keycap>Fin</keycap></keycombo></shortcut> <guimenu>Editar</guimenu><guimenuitem>Selección</guimenuitem><guimenuitem>al final</guimenuitem> </menuchoice>
fr: Étendre la sélection jusqu'à la fin de la piste sonore (dernier échantillon) : <menuchoice><shortcut><keycombo><keycap>Shift</keycap><keycap>End</keycap></keycombo></shortcut><guimenu>Édition</guimenu><guimenuitem>Sélection</guimenuitem><guimenuitem>A la fin</guimenuitem></menuchoice>

source: expand the current selection left and right up to the next label (or start/end of the signal if there is none), starting at the current cursor position: <menuchoice> <shortcut><keycombo><keycap>E</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Selection</guimenuitem><guimenuitem>Expand to labels</guimenuitem> </menuchoice>
cs: rozšířit výběr nalevo a napravo k dalšímu štítku (nebo po začátek/konec signálu, pokud zde žádný štítek není): <menuchoice> <shortcut><keycombo><keycap>E</keycap></keycombo></shortcut> <guimenu>Úpravy</guimenu><guimenuitem>Výběr</guimenuitem><guimenuitem>Roztáhnout k štítkům</guimenuitem> </menuchoice>
de: Erweitern der Auswahl links und rechts bis zum nächsten Marker (oder Start / Ende des Signals falls keiner vorhanden), ausgehend von der aktuellen Cursor-Position: <menuchoice> <shortcut><keycombo><keycap>E</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Auswahl</guimenuitem><guimenuitem>auf Marker erweitern</guimenuitem> </menuchoice>
es: expandir la selección actual a la izquierda y a la derecha hasta el siguiente marcador (o al principio/final si no existe ninguno en la señal), comenzando en la posición actual del cursor: <menuchoice> <shortcut><keycombo> <keycap>E</keycap></keycombo></shortcut> <guimenu>Editar</guimenu> <guimenuitem>Selección</guimenuitem><guimenuitem>Expandir a marcadores </guimenuitem> </menuchoice>

source: select the area between the next two labels that are right from the current selection or up to the end of the signal: <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>Ctrl</keycap><keycap>N</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Selection</guimenuitem><guimenuitem>to next labels</guimenuitem> </menuchoice>
cs: vybrat oblast mezi dalšími dvěma štítky, které jsou napravo od nynějšího výběru, nebo až po konec signálu: <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>Ctrl</keycap><keycap>N</keycap></keycombo></shortcut> <guimenu>Úpravy</guimenu><guimenuitem>Výběr</guimenuitem><guimenuitem>Mezi dalšími štítky</guimenuitem> </menuchoice>
de: Auswahl des Bereiches zwischen den nächsten beiden Marker die rechts von der aktuellen Auswahl liegen oder bis zum Ende des Signals:<menuchoice><shortcut><keycombo><keycap>Shift</keycap><keycap>Strg</keycap><keycap>N</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Auswahl</guimenuitem><guimenuitem>zu den nächsten Markern</guimenuitem> </menuchoice>
es: seleccionar el área entre los siguientes dos marcadores que están a la derecha de la selección actual o hasta el final de la señal: <menuchoice> <shortcut><keycombo><keycap>Mayúsculas</keycap><keycap>Ctrl</keycap><keycap>N</keycap></keycombo></shortcut> <guimenu>Editar</guimenu><guimenuitem>Selección</guimenuitem><guimenuitem>a los siguientes marcadores</guimenuitem> </menuchoice>

source: select the area between the previous two labels that are left from the current selection or up to the start of the signal: <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>Ctrl</keycap><keycap>P</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Selection</guimenuitem><guimenuitem>to previous labels</guimenuitem> </menuchoice>
cs: vybrat oblast mezi předchozími dvěma štítky, které jsou nalevo od nynějšího výběru, nebo až po začátek signálu: <menuchoice> <shortcut><keycombo><keycap>Shift</keycap><keycap>Ctrl</keycap><keycap>P</keycap></keycombo></shortcut> <guimenu>Úpravy</guimenu><guimenuitem>Výběr</guimenuitem><guimenuitem>Mezi předchozími štítky</guimenuitem> </menuchoice>
de: Auswahl des Bereiches zwischen den vorhergehenden beiden Markern die links von der aktuellen Auswahl liegen oder bis zum Anfang des Signals:<menuchoice><shortcut><keycombo><keycap>Shift</keycap><keycap>Strg</keycap><keycap>P</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Auswahl</guimenuitem><guimenuitem>zu den vorhergehenden Markern</guimenuitem> </menuchoice>
es: seleccionar el área entre los anteriores dos marcadores que están a la izquierda de la selección actual o hasta el comienzo de la señal: <menuchoice> <shortcut><keycombo><keycap>Mayúsculas</keycap><keycap>Ctrl</keycap><keycap>P</keycap></keycombo></shortcut> <guimenu>Editar</guimenu><guimenuitem>Selección</guimenuitem><guimenuitem>a los anteriores marcadores</guimenuitem> </menuchoice>

source: Clipboard
cs: Schránka
de: Zwischenablage
es: Portapapeles
fr: Le presse-papiers

source: &kwave; since v0.8.1 uses the clipboard of KDE. This way it is possible to exchange audio data between different &kwave; windows. It might be possible as well to exchange data between &kwave; and other audio applications, depending on their ability to use the KDE clipboard.
cs: &kwave; od v0.8.1 se používá schránka KDE. Tímto způsobem lze vyměňovat data mezi různými &kwave; okny. Mělo by být možné stejně tak vyměňovat data mezi &kwave; a jinými programy pracujícími se zvukem v závislosti na jejich schopnosti používat schránku KDE.
de: &kwave; verwendet seit v0.8.1 die Zwischenablage von KDE. Damit ist es möglich Audio-Daten zwischen verschiedenen &kwave;-Fenstern auszutauschen. Ausserdem lassen sich möglicherweise Daten zwischen &kwave; und anderen Audio-Programmen austauschen, abhängig von deren Fähigkeit die KDE-Zwischenablage zu nutzen.
es: &kwave; usa desde la versión 0.8.1 el portapapeles de KDE. De esta manera es posible intercambiar datos de audio entre diferentes ventanas de &kwave;. También puede ser posible intercambiar datos entre &kwave; y otras aplicaciones dependiendo de la habilidad de las aplicaciones para usar el portapapeles de KDE.

source: When copying data to the clipboard through the <literal>copy</literal> function &kwave; uses the mime type <literal>audio/vnd.wave</literal> as data format, conforming to <ulink url="&url_rfc2361;">RFC 2361</ulink> which is the same as the well known <literal>wav</literal> format. When pasting from the clipboard into &kwave; all data formats that are available as file import formats are supported, like for example Ogg/Vorbis, FLAC and so on.
cs: Při kopírování dat do schránky přes činnost <literal>Kopírovat</literal> &kwave; používá mime typ <literal>audio/vnd.wave</literal> jako datový formát, odpovídající <ulink url="&url_rfc2361;">RFC 2361</ulink>, který je stejný jako dobře známý <literal>wav</literal>
de: Beim kopieren in die Zwischenablage über die <literal>Kopieren</literal>-Funktion verwendet &kwave; den Medientyp <literal>audio/vnd.wave</literal>, gemäss <ulink url="&url_rfc2361;">RFC 2361</ulink>, wie in dem bekannten <literal>wav</literal>-Format. Beim Einfügen von der Zwischenablage in &kwave; werden alle Datenformate unterstützt die als Datei-Import-Formate verfügbar sind, wie beispielsweise Ogg/Vorbis, FLAC und andere.
es: Al copiar datos al portapapeles a través de la función de <literal>copiar</literal>, &kwave; usa el tipo MIME <literal>audio/vnd.wave</literal> como formato de datos, conforme a <ulink url="&url_rfc2361;">RFC 2361</ulink> que es lo mismo que el conocido formato <literal>wav</literal>. Al pegar desde el portapapeles en &kwave; todos los formatos de datos que están disponibles como importación de archivos están soportados como por ejemplo Ogg/Vorbis, FLAC y demás.

source: &kwave; supports the KDE Drag and Drop protocol. This enables you to open files just by picking them up in a <command>konqueror</command> window or the Desktop and let them drop into a window of &kwave;.
cs: &kwave; podporuje KDE táhni a pusť protokol. Tento vám umožňuje otevřít soubory jejich pouhým vybráním v okně <command>Konqueroru</command> nebo na ploše a nechat je spustit do okna &kwave;.
de: &kwave; unterstützt das KDE Drag and Drop-Protokoll. Dies ermöglicht Ihnen, Dateien einfach mittels der Maus in einem <command>konqueror</command>- Fenster oder vom Desktop aufzunehmen und sie über einem Fenster von &kwave; fallen zu lassen, um sie zu öffnen.
es: &kwave; soporta el protocolo de arrastrar y soltar de KDE. Esto le permite abrir archivos simplemente seleccionándolos en una ventana de <command>konqueror </command> o del escritorio y soltándolos en la ventana de &kwave;

source: Please note that if you drop a file into a &kwave; window that already contains an opened file, the currently opened file will be closed first and then the file you dropped will be opened in it. If you don't want that, you should open a new empty &kwave; window first.
cs: Povšimněte si, prosím, že pokud soubor pustíte na okno &kwave;, které již obsahuje otevřený soubor, bude v současnosti otevřený soubor zavřen a pak soubor, který jste upustil, v něm bude otevřen. Pokud zrovna toto nechcete, měl byste nejprve otevřít nové prázdné okno &kwave;.
de: Bitte beachten Sie, dass wenn eine Datei über einen &kwave; Fenster fallen gelassen wird, welches bereits eine geöffnete Datei enthält, diese zuerst geschlossen wird und dann erst die losgelassene Datei geöffnet wird. Wenn Sie dies nicht wollen, sollten Sie zuerst ein neues leeres &kwave; Fenster öffnen.
es: Dese cuenta que si suelta un archivo en la ventana de &kwave; que ya cotinene un archivo abierto, el archivo actual será cerrado y sólo entonces se abrirá el archivo que ha soltado. Si no desea esto debería abrir una ventana vacía de &kwave; primero.

source: You can also select a range of samples and drag or drop them into a &kwave; window. Per default the drag operation is done in <emphasis>move</emphasis> mode where the selected range is deleted from the original place and inserted at the drop position. By pressing the <keycap moreinfo="none">Ctrl</keycap> key you can modify this and drag in <emphasis>copy</emphasis> mode instead.
cs: Také můžete vybrat řadu vzorků a táhnout a pustit je na okno &kwave;. Ve výchozím nastavení je operace táhnutí hotova v režimu <emphasis>posunu</emphasis>, v němž je vybraná oblast smazána v původním umístění a vložena v poloze upuštění. Stisknutím klávesy <keycap moreinfo="none">Ctrl</keycap> můžete tento způsob pozměnit a táhnout místo toho v režimu <emphasis>kopírování</emphasis>.
de: Sie können auch einen Bereich von Samples auswählen und per Drag und Drop in ein anderes &kwave;-Fenster verschieben. Standardmässig wird der Vorgang im <emphasis>Verschieben</emphasis>-Modus durchgeführt, wobei der ausgewählte Bereich von seiner ursprünglichen Stelle gelöscht und an der Position des Fallenlassens eingefügt wird. Durch Drücken der <keycap moreinfo="none">Strg</keycap>-Taste können Sie dieses Verhalten ändern und stattdessen den <emphasis>Kopieren</emphasis>-Modus verwenden.
es: También puede seleccionar un rango de muestras y arrastrarlos o soltarlos en una ventana de &kwave;. Por defecto la operación de arrastre se realiza en modo <emphasis>mover</emphasis> lo que provoca que el rango seleccionado sea eliminado del lugar original e insertado en la posición donde se ha soltado. Mediante la pulsación de la tecla <keycap moreinfo="none">Ctrl</keycap> puede modificar esto y provocar que el arrastre se realice en modo de <emphasis>copia</emphasis>.

source: Automization and Scripting with &kwave;
de: Automatisieren und Skripten mit &kwave;

source: &kwave; since it's first version uses an internal text command language. This command language is used internally for menu handling, GUI control, builtin effects and plugin invocations. The commands will be described later in the section <link linkend="kwave_commands">Command Reference</link>.
de: &kwave; verwendet seit der ersten Version intern Text-Befehle. Diese werden verwendet um das Menü aufzubauen, die graphische Oberfläche zu steuern, eingebaute Effekte und Erweiterungen zu steuern. Die einzelnen Befehle werden später im Kapitel <link linkend="kwave_commands">Befehlsreferenz</link> beschrieben.

source: General Syntax
de: Allgemeine Syntax

source: All commands consist of a <emphasis>command name</emphasis> and an optional <emphasis>parameter list</emphasis> in round brackets, depending on the command.
de: Alle Befehle bestehen aus einem <emphasis>Befehls-Namen</emphasis> und einer optionalen <emphasis>Parameterliste</emphasis> in runden Klammern, je nach Befehl.

source: Allowed characters for command names are <emphasis>letters</emphasis>, <emphasis>digits</emphasis> and <emphasis>colon</emphasis>. Commands are case sensitive and are always in lower case.
de: Zulässige Zeichen für Befehls-Namen sind <emphasis>Buchstaben</emphasis>, <emphasis>Ziffern</emphasis> und <emphasis>Doppelpunkt</emphasis>. Groß-/Kleinschreibung wird unterschieden, alle Befehle sind in Kleinschreibung.

source: Parameters within a parameter list are separated by <emphasis>comma</emphasis>.
de: Parameter innerhalb einer Parameterliste werden durch <emphasis>Komma</emphasis> getrennt.

source: Numerical parameters can be given as fixed point numbers or as floating point numbers, using a dot as decimal separator.
de: Numerische Parameter können als Festkomma- oder als Gleitkomma-Zahlen angegeben werden, als Dezimaltrennzeichen wird ein Punkt verwendet.
