Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: under construction
cs: ve výstavbě
de: in Arbeit
es: en construcción
fr: Ce chapitre est en cours de rédaction.

source: Sorry, this chapter is still to be written... At the moment the source code is nearly completely documented with tags suitable with the KDE documentation tools. We currently prefer using <ulink url="&url_doxygen;">doxygen</ulink>. Maybe some day we will spend some time for writing a tool that converts the doxygen output into something we can include into the docbook source (the source this page has been built of).
cs: Promiňte, ale tato kapitola se musí teprve napsat... V tuto chvíli je zdrojový kód téměř úplně zdokumentován se značkami vhodnými pro KDE dokumentační nástroje. V současnosti dáváme přednost používání <ulink url="&url_doxygen;">doxygen</ulink>. Možná jednoho dne strávíme více času při psaní nástroje, který převede výstup doxygenu do něčeho, co budeme moci začlenit do zdroje docbooku (zdrojový kód této stránky z něj byl postaven).
de: Sorry, leider muss dieses Kapitel noch geschrieben werden ... im Moment ist der Quellcode fast vollständig mit Tags passend zu den KDE- Dokumentationswerkzeugen dokumentiert. Aktuell bevorzugen wir die Benutzung von <ulink url="&url_doxygen;">doxygen</ulink>. Vielleicht werden wir eines Tages etwas Zeit erübrigen können, um ein Tool zu schreiben, dass die doxygen Ausgabe in etwas umwandelt, was man in irgendeiner Art und Weise in die Docbook-Quellen (die Quellen, aus denen diese Seite erzeugt wurde) einbinden könnte.
es: Lo lamento, este capítulo todavía necesita ser escrito...Por el momento el código fuente está casi completamente documentado con etiquetas para las herramientas de documentación de KDE. Actualmente preferimos usar <ulink url="&url_doxygen;">doxygen</ulink>. Quizá más adelante dediquemos tiempo a escribir una herramienta que convierta la salida de doxygen en algo que podamos incluir en la fuente de docbook (la fuente con la que esta página ha sido construida).

source: If you want to write a plugin, contribute something to this project (or maybe write the converter mentioned above), please feel free to contact one of the authors directly and / or subscribe to the &kwave; <link linkend="mailing-list">mailing list</link>. Help is always welcome!
cs: Pokud chcete napsat přídavný modul, přispět něčím tomuto projektu (nebo snad napsat převodník zmíněný výše), pociťujte, prosím, svobodu spojit se přímo s jedním z autorů a/nebo se přihlásit k &kwave; <link linkend="mailing-list">mejlovacímu seznamu</link>. Pomoc je vždy vítána!
de: Wenn Sie ein Plugin schreiben und etwas zu diesem Projekt beitragen (oder vielleicht den oben erwähnten Konverter schreiben) wollen, dann scheuen Sie sich nicht, einem der Autoren direkt zu schreiben und / oder der &kwave; <link linkend="mailing-list">Mailing-Liste</link> beizutreten. Hilfe ist immer willkommen!
es: Si quiere escribir un complemento, contribuir a este proyecto (o quizá escribir el convertidor arriba mencionado), por favor, no dude en contactar a alguno de los autores directamente y/o suscribirse a la <link linkend="mailing-list">lista de correo</link> de &kwave;. Toda ayuda siempre es bienvenida!

source: Creating API documentation
de: API-Dokumentation erzeugen
es: Creando documentacion API

source: If you are interested in the internal of &kwave; and you have <ulink url="&url_doxygen;">doxygen</ulink> installed, then you can type:
de: Wenn Sie an den Internas von &kwave; interessier sind, und <ulink url="&url_doxygen;">doxygen</ulink> installiert haben, dann können Sie folgendes eingeben:
es: Si está interesado en el funcionamiento interno de &kwave; y dispone de <ulink url="&url_doxygen;">doxygen</ulink> instalado puede teclear:

source: to get a directory <filename><replaceable>apicod/html</replaceable></filename>, with documentation of the source and the internal API in your current build directory.
de: um in Ihrem Generierverzeichnis ein Unterverzeichnis <filename><replaceable>apicod/html</replaceable></filename> zu erhalten das die Dokumentation des Quellcodes und der internen Schnittstellen zu enthält.
es: para obtener un directorio <filename><replaceable>apicod/html</replaceable></filename> con la documentación de las fuentes y de la API interna en su directorio de compilación:

source: Starting in a test environment
de: Start in einer Testumgebung
es: Comenzando en un entorno de pruebas

source: If you are developing or testing &kwave;, then you do not necessarily need to uninstall/install &kwave; after every build. Instead you can use the application from where it is built by using a wrapper script. This wrapper script can be built with the following command:
de: Wenn Sie &kwave; mit entwickeln oder testen, brauchen Sie &kwave; nicht unbedingt nach jedem Generieren installieren. Stattdessen können Sie die Anwendung mit Hilfe eines Wrapper-Skriptes dort nutzen wo sie generiert wurde. Das Wrapper-Skript kann mit diesem Befehl generiert werden:

source: The script will be named <filename><replaceable>kw</replaceable></filename>, feel free to modify it to match your system if needed.
de: Das Skript hat den Namen <filename><replaceable>kw</replaceable></filename>, ändern Sie es ruhig um es Ihrem System anzupassen falls es notwendig sein sollte.
es: El script será nombrado <filename><replaceable>kw</replaceable></filename>, siéntase libre para ajustarlo a su sistema si lo necesita.

source: For this to work, you must <emphasis>not</emphasis> have &kwave; installed on your system. If so, please uninstall the package before!
de: Damit dies funktioniert dürfen Sie &kwave; <emphasis>nicht</emphasis> in Ihrem System installiert haben. Sollte das der Fall sein deinstallieren Sie das bitte das Paket zuerst!
es: Para que esto funcione <emphasis>no</emphasis> debe tener instalado &kwave; en su sistema. Si lo tiene, por favor desinstale el paquete antes!

source: Adding support for a new Language
cs: Přidání podpory pro nový jazyk
de: Unterstützung einer neue Sprache hinzufügen
es: Añadir soporte para un nuevo idioma

source: make system:
cs: Systém provedení:
de: Generiersystem:
es: Generar sistema:

source: Edit the toplevel <filename>CMakeLists.txt</filename> and add a new entry to the list of languages. Look for the variable <literal><symbol>KWAVE_LINGUAS</symbol></literal> and add a line for the new language. Each entry consists of a pair with a language <emphasis>code</emphasis> and language <emphasis>name</emphasis>, like this: <command><replaceable>&lt;code&gt;</replaceable><literal>:</literal><replaceable>&lt;name&gt;</replaceable></command>. Example:
cs: Upravit na nejvyšší úrovni<filename>CMakeLists.txt</filename> a přidat nový záznam k seznamu s jazyky. Hledejte proměnnou <literal><symbol>KWAVE_LINGUAS</symbol></literal> a přidejte řádek s novým jazykem. Každý záznam se skládá z dvojice jazykového <emphasis>kódu</emphasis> a <emphasis>názvu</emphasis> jazyka, jako je tento: <command><replaceable>&lt;code&gt;</replaceable><literal>:</literal><replaceable>&lt;název&gt;</replaceable></command>. Příklad:
de: Bearbeiten Sie die Datei <filename>CMakeLists.txt</filename> im Hauptverzeichnis und fügen Sie einen neuen Eintrag zu der Liste der Sprachen hinzu. Suchen Sie dazu die Variable <literal><symbol>KWAVE_LINGUAS</symbol></literal> und fügen Sie eine Zeile für die neue Sprache hinzu. Jeder Eintrag besteht aus einem Paar von einem Sprach-<emphasis>Code</emphasis> und einem Sprach-<emphasis>Name</emphasis>, nach folgendem Schema: <command><replaceable>&lt;code&gt;</replaceable><literal>:</literal><replaceable>&lt;name&gt;</replaceable></command>. Beispiel:
es: Edite el archivo <filename>CMakeLists.txt</filename> del directorio raiz y añada una nueva entrada en la lista de lenguajes. Busque la variable <literal><symbol> KWAVE_LINGUAS</symbol></literal> y añada una línea para el nuevo idioma. Cada entrada consiste de una pareja formada por un <emphasis>código</emphasis> y un <emphasis>nombre</emphasis> de idioma, como este:like this: <command> <replaceable>&lt;código&gt;</replaceable><literal>:</literal><replaceable> &lt;nombre&gt;</replaceable></command>. Ejemplo:

source: The language code is a 2-letter code which is used for directories and filenames, as it is also used in KDE. The language name is used internally for the docbook online documentation and the online help only. For a list of available language codes and names, please refer to the documentation of the international standard <ulink url="&url_iso639;">ISO 639.2</ulink>.
cs: Jazykový kód je kód složený ze dvou písmen, který se používá pro adresáře a názvy souborů, jak se také používají v KDE. Název jazyka se uvnitř používá pouze pro docbook dokumentaci a nápovědu, které jsou přístupnému přímým připojením k internetu. Kvůli seznamu s dostupnými kódy jazyků a názvy se, prosím, podívejte na dokumentaci s mezinárodním standardem <ulink url="&url_iso639;">ISO 639-2</ulink>.
de: Der Sprach-Code ist ein 2-Buchstaben-Code der für Verzeichnisse und Dateinamen verwendet wird, genau so wie in KDE selbst. Der Name der Sprache wir nur intern benutzt für die Online-Hilfe im docbook-Format. Für eine Liste verfügbarer Sprachen-Codes und Namen sei auf den internationalen Standard <ulink url="&url_iso639;">ISO 639.2</ulink> verwiesen.
es: El código de idioma está constituido por 2 letras que son usadas para directorios y nombres de archivo, como se ve en KDE. El nombre del idioma es usado internamente por la documentación online docbook y la ayuda en línea sólamente. Para una lista de códigos y nombres de idioma disponibles, por favor, dirígase a la documentación del estandar internacional <ulink url="&url_iso639;"> ISO 639.2</ulink>.

source: user interface:
cs: uživatelské rozhraní:
de: Benutzerschnittstelle:
es: Interfaz de usuario:

source: Go to the source directory of &kwave; (not the build directory), change into the subdirectory <filename>po</filename> and copy the file <filename>kwave.pot</filename> to the corresponding <filename>.po</filename> file of the language you want to add: <filename>"<replaceable>&lt;code&gt;</replaceable>.po"</filename>. After that you can translate the file using your favorite tool, like <filename>Lokalize</filename>. Example:
cs: Jděte do zdrojového adresáře &kwave; (není to adresář se sestavením), přepněte se na podadresář <filename>po</filename> a zkopírujte soubor <filename>kwave.pot</filename> do odpovídajícího <filename>.po</filename> souboru s jazykem, který chcete přidat: <filename>"<replaceable>&lt;code&gt;</replaceable>.po"</filename>. Poté už můžete překládat soubor s pomocí svého oblíbeného nástroje, jakým je třeba <filename>Lokalize</filename>. Příklad:
de: Wechseln Sie in das Quellenverzeichnis von &kwave; (nicht das Generierverzeichnis), wechseln Sie dann in das Unterverzeichnis <filename>po</filename> und kopieren Sie die Datei <filename>kwave.pot</filename> in die entsprechende <filename>.po</filename>-Datei der Sprache die Sie hinzufügen wollen: <filename>"<replaceable>&lt;code&gt;</replaceable>.po"</filename>. Danach können Sie diese Datei mit ihrem hierfür bevorzugten Programm übersetzen, vorzugsweise mit <filename>Lokalize</filename>. Beispiel:
es: Diríjase al directorio fuente de &kwave; (no al directorio donde se ha generado el ejecutable) y cambie al subdirectorio <filename>po</filename>, cree una copia del archivo <filename>kwave.pot</filename> con el nombre del idioma que desea añadir: <filename>"<replaceable>&lt;código&gt;</replaceable> .po"</filename>. Después de esto puede traducir el archivo usando su herramienta preferida, como <filename>Lokalize</filename>. Ejemplo:

source: online help:
cs: nápověda po internetu:
de: Online-Hilfe:
es: Ayuda en línea:

source: screenshots:
cs: Snímky obrazovky:
de: Bildschirmfotos:
es: Capturas de pantalla:

source: For the online documentation you also need screenshots that use the translated messages. This requires a built and installed &kwave; package, so you should follow the steps mentioned in the section about <link linkend="manual_compilation">Manual Compilation and installation</link>. Of course you <emphasis>must not</emphasis> pass the build option <literal>WITH_DOC=no</literal> or any other build option that removes functionality, otherwise you would not be able to get screenshots of components that you have disabled.
cs: Pro nápovědu po internetu rovněž potřebujete snímky obrazovky, jež využívají přeložená sdělení. Toto vyžaduje sestavený a nainstalovaný balíček &kwave;, takže byste měl sledovat kroky zmíněné v oddíle o <link linkend="manual_compilation">Vlastnoruční kompilace a instalace</link>. Samozřejmě, že <emphasis>nesmíte</emphasis> přejít volbu pro sestavení <literal>WITH_DOC=no</literal> nebo jakoukoli jinou volbu pro sestavení, která odstraňuje funkčnost, jinak nebudete moci získat snímky obrazovky částí, které jste zakázal.
de: Für die Online-Hilfe benötigen Sie auch noch Screenshots die die übersetzten Texte enthalten. Dies erfordert ein generiertes und installiertes &kwave;-Paket, Sie sollten also die in den Anweisungen im Abschnitt <link linkend="manual_compilation">Kompilierung und Installation</link>. Natürlich dürfen Sie <emphasis>nicht</emphasis> die Generier-Option<literal>WITH_DOC=no</literal> verwenden, eben sowenig eine andere Option die Funktionalität entfernt; von den deaktivierten Komponenten könnten Sie sonst keine Screenshots anfertigen.
es: Para la documentación en línea también necesita capturas de pantalla que usan los mensajes traducidos. Esto requiere un paquete de &kwave; compilado e instalado, por lo que debería seguir los pasos indicados en la sección sobre <link linkend="manual_compilation">Compilación manual e instalación</link>. Por supuesto, <emphasis>no debe</emphasis> pasar la opción de compilación <literal>WITH_DOC=no</literal> o cualquier otra opción de compilación que elimine funcionalidad, de otra manera no sería capaz de obtener capturas de pantalla de los componentes que hubiera desactivado.

source: For a list of screenshots you can look into one of the existing directories in the source tree, for example in <filename>$HOME/doc/de</filename>. All screenshots are in <emphasis><filename>.png</filename></emphasis> and should follow the <ulink url="&url_kde_screenshots;">KDE Documentation Screenshots Requirements</ulink>. Here in short:
cs: Pro seznam se snímky obrazovky se můžete podívat do jednoho ze jsoucích adresářů ve zdrojovém stromě, například v <filename>$HOME/doc/de</filename>. Všechny snímky obrazovky jsou v <emphasis><filename>.png</filename></emphasis> a měly by vyplývat z <ulink url="&url_kde_screenshots;"> KDE požadavků na snímky obrazovky (KDE Documentation Screenshots Requirement)</ulink>. Zde ve zkratce:
de: Für eine Liste bereits existierender Screenshots können Sie in eines der bereits existierenden Quellen-Verzeichnisse nachsehen, beispielsweise in<filename>$HOME/doc/de</filename>. Alle Screenshots sind im <emphasis><filename>.png</filename></emphasis>-Format und sollten sich an die <ulink url="&url_kde_screenshots;">KDE Documentation Screenshots Requirements</ulink> halten. Hier kurz zusammengefasst:
es: Para una lista de capturas de pantalla puede mirar dentro de uno de los directorios existentes en el directorio fuente, por ejemplo en <filename>$HOME/doc/de </filename>. Todas las capturas de pantalla están en <emphasis><filename>.png </filename></emphasis> y debería seguir los <ulink url="&url_kde_screenshots;"> requerimientos sobre capturas de pantalla en la documentación KDE</ulink>. Aquí tiene un resumen:

source: Window decoration: Oxygen
cs: Výzdoba okna: Oxygen
de: Fensterdekoration: Oxygen
es: Decoración de ventanas: Oxygen

source: Widget style: Oxygen
de: Stil: Oxygen
es: Estilo de ventanas: Oxygen

source: Colors: Oxygen
cs: Barvy: Oxygen
de: Farben: Oxygen
es: Colores: Oxygen

source: Background: Flat color - Color must be white
cs: Pozadí: Uhlazená barva - Barva musí být bílá
de: Hintergrund: Einfache Farbe -muss "weiss" sein
es: Fondo: color plano - el color debe ser blanco

source: Run X11 in 72dpi mode
cs: Spustit X11 v režimu 72dpi
de: verwenden Sie X11 im 72dpi-Modus
es: X11 funcionando en modo de 72dpi.

source: Save the files in 8bpp
cs: Soubory ukládat v 8bpp
de: Speichern Sie die Dateien in 8 Bit/Pixel
es: Guardar los archivos en 8bpp

source: Try to keep the size of each file below 20kB
cs: Pokusit se udržet velikost každého souboru pod 20kB
de: Versuchen Sie die Dateien kleiner als 20kB zu halten
es: Intentar mantener el tamaño de los archivos por debajo de 20kB

source: desktop file:
cs: soubor na ploše:
de: .desktop-Datei:
es: Archivo de escritorio:

source: Add a <emphasis>Comment</emphasis> line for the new language to the file <filename>kwave/kwave.desktop.in</filename>. Please note that this file is UTF-8 encoded! Example:
cs: Přidat řádek s <emphasis>poznámkou</emphasis> pro nový jazyk k souboru <filename>kwave/kwave.desktop.in</filename>. Všimněte si, prosím, že tento soubor je zakódován v UTF-8! Příklad:
de: Fügen Sie eine <emphasis>Comment</emphasis>-Zeile für die neue Sprache zu der Datei <filename>kwave/kwave.desktop.in</filename> hinzu. Bitte beachten Sie dass diese Datei in UTF-8 kodiert ist! Beispiel:
es: Añada una línea con <emphasis>Comment</emphasis> para el nuevo idioma al archivo <filename>kwave/kwave.desktop.in</filename>. Por favor, dese cuenta que este archivo está codificado en UTF-8! Ejemplo:

source: Useful links:
cs: Užitečné odkazy:
de: Hilfreiche Links:
es: Enlaces útiles:

source: <ulink url="&url_rfc3066;">RFC 3066</ulink> Tags for the Identification of Languages
cs: <ulink url="&url_rfc3066;">RFC 3066</ulink> Značky pro určení jazyků
de: <ulink url="&url_rfc3066;">RFC 3066</ulink> Bezeichner für die Identifikation von Sprachen
es: <ulink url="&url_rfc3066;">RFC 3066</ulink> Etiquetas para la identificación de los idiomas.

source: <ulink url="&url_kde_l10n;">KDE Localization</ulink> contains a lot of useful links for KDE translators.
cs: <ulink url="&url_kde_l10n;">KDE Localization</ulink>obsahuje mnoho užitečných odkazů pro překladatele KDE.
de: <ulink url="&url_kde_l10n;">KDE Localization</ulink> enthält eine Menge nützlicher Links für KDE-Übersetzer.
es: <ulink url="&url_kde_l10n;">KDE Localization</ulink> contiene gran cantidad de enlaces útiles para traductores de KDE.

source: <ulink url="&url_kde_localize;">Lokalize</ulink> is <emphasis>the</emphasis> standard tool that helps you translating <filename>.po</filename> files.
cs: <ulink url="&url_kde_localize;">Lokalize</ulink> je <emphasis>standardní</emphasis> nástroj, který vám pomůže s překládáním <filename>.po</filename> souborů.
de: <ulink url="&url_kde_localize;">Lokalize</ulink> ist <emphasis>das</emphasis> Standard-Programm das Ihnen bei der Übersetzung von <filename>.po</filename>-Dateien hilft.
es: <ulink url="&url_kde_localize;">Lokalize</ulink> es <emphasis>la</emphasis> herramienta estandar para traducir archivos <filename>.po</filename>.

source: <ulink url="&url_kde_screenshots;">KDE Documentation Screenshots Requirements</ulink>.
cs: <ulink url="&url_kde_screenshots;">Požadavky na snímky obrazovky pro KDE (KDE Documentation Screenshots Requirements)</ulink>.
de: <ulink url="&url_kde_screenshots;">KDE Documentation Anforderungen für die Erstellung von Bildschirmfotos</ulink>.

source: Questions and Answers
cs: Otázky a odpovědi
de: Fragen und Antworten
es: Preguntas y respuestas
fr: Foire aux questions

source: What do I need to compile &kwave;?
cs: Co potřebuji, abych mohl dát dohromady &kwave;?
de: Was brauche ich um &kwave; zu kompilieren?
es: ¿Qué necesito para compilar &kwave;?

source: Read in the <link linkend="requirements">chapter</link> mentioned before.
cs: Přečtěte si o tom v <link linkend="requirements">kapitole</link>, která byla již zmiňována.
de: Lesen Sie im vorhergehenden <link linkend="requirements">Kapitel</link> nach.
es: Lea el <link linkend="requirements">capítulo</link> mencionado anteriormente.

source: Which sound cards does &kwave; support?
cs: Které zvukové karty &kwave; podporuje?
de: Welche Soundkarten unterstützt &kwave;?
es: ¿Qué tarjetas de sonido soporta &kwave;?

source: &kwave; does not need support for any special sound card. The sound card only has to be supported by your operating system and &kwave; uses it's interface to the operating system's sound driver through a OSS or ALSA interface. So &kwave; can play on any sound card that KDE is able to play on.
cs: &kwave; nepotřebuje podporu pro nějaké zvláštní zvukové karty. Zvuková karta musí být jen podporována vaším operačním systémem a &kwave; používá svoje rozhraní k ovladači zvuku operačního systému prostřednictvím OSS nebo ALSA rozhraní. Takže &kwave; může hrát na jakékoli zvukové kartě, na které dokáže hrát KDE.
de: &kwave; braucht keine Unterstützung für irgendeine besondere Soundkarte. Die Soundkarte muss nur von Ihrem Betriebssystem unterstützt werden und &kwave; nutzt dann sein Interface zum Betriebssystem-Soundkarten-Treiber mit Hilfe von OSS oder ALSA. Deshalb kann &kwave; jede Soundkarte benutzen, die unter KDE einsetzbar ist.
es: &kwave; no necesita soportar ninguna tarjeta de sonido en particular. La tarjeta de sonido solo tiene que ser soportada por su sistema operativo para que &kwave; pueda utilizarla a través del interfaz del sistema de sonido del sistema operativo, sea este el interfaz OSS o ALSA. Asi que &kwave; puede funcionar sobre cualquier tarjeta de sonido sobre la que KDE es capaz de funcionar.

source: Why does &kwave; consume more memory than it can be expected from the size of the opened file?
cs: Proč &kwave; spotřebovává více paměti, než se dá očekávat vzhledem k velikosti otevřeného souboru?
de: Warum verbraucht &kwave; mehr Speicher als es die Grösse der geöffneten Datei erwarten lässt?
es: ¿Por qué &kwave; consume más memoria de la que puede ser esperada para el tamaño del archivo abierto?

source: The reason for this is that &kwave; internally stores all samples in 32-bit integers. This was easy to program, made the application faster and a bit more reliable. So if you load an 8-bit file with about one megabyte it will consume about four megabytes. Maybe we will change this somewhere in the future...
cs: Důvodem je, že &kwave; uvnitř ukládá všechny vzorky v 32 bitových celých číslech. Bylo to snadné pro program, zrychlilo jej a zvětšilo jeho spolehlivost. Takže, pokud nahrajete 8 bitový soubor, který bude mít přes jeden MB, bude potřebovat asi čtyři MB. Snad tuto záležitost změníme někdy v budoucnosti...
de: Der Grund dafür liegt im internen Speichersystem von &kwave;, in dem alle Samples in 32-bit Ganzzahlen (Integers) gespeichert werden. Dies war einfach zu programmieren, machte die Anwendung schneller und ein bisschen betriebsicherer. Deshalb werden 8-Bit Dateien mit rund einem Megabyte um die vier Megabyte im Speicher belegen. Vielleicht werden wir das irgendwann in der Zukunft ändern...
es: La razón para esto es que &kwave; internamente almacena todas las muestras en enteros de 32 bits. Esto fue más fácil de programar, hizo la aplicación más rápida y un poco más fiable. Asi que si carga un archivo de 8 bits de un mega consumirá sobre 4 megabytes. Quizá cambiemos esto en algún momento en el futuro...

source: Which sound formats does &kwave; support?
cs: Které zvukové formáty &kwave; podporuje?
de: Welche Soundformate unterstützt &kwave;?
es: ¿Qué formatos de sonido soporta &kwave;?
