Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: If you are runnig a system with RPM support, the preferred way to install &kwave; on your system will be the creation of a nice RPM package. First you should get the current source of &kwave;, either as a tar.bz2 archive from the &kwave; download page or check out an up-to-date copy via <link linkend="git-repository">GIT</link> (like described in the <link linkend="git_checkout">chapter about GIT</link>) and read the <link linkend="building_rpm_from_git">next</link> chapter.
cs: Jestliže používáte systém s podporou RPM, bude upřednostňovaným způsobem &kwave; instalace na vašem systému vytvoření hezkého RPM balíčku. Nejprve byste měl získat aktuální zdrojový soubor z &kwave;, buď jako archiv tar.bz2 ze stránky &kwave; určené pro stahování, nebo se mrknout na nejnovější kopii prostřednictvím <link linkend="git-repository">Git</link> (jak je to popsáno v <link linkend="git_checkout">kapitole o Git</link>) a přečíst si <link linkend="building_rpm_from_git">další</link> kapitolu.
es: Si está ejecutando un sistema con soporte RPM el método preferido para instalar &kwave; en su sistema será la creación de un paquete RPM. Primero debe obtener el código fuente de &kwave;, bien como un archivo tar.bz2 desde la página de descarga de &kwave; o descargar una copia actualizada a través de <link linkend="git-repository">GIT</link> (como se describió en el <link linkend="git_checkout">capítulo sobre GIT</link>) y leer el <link linkend="building_rpm_from_git">siguiente</link> capítulo.

source: or you can check out a specific release with the following commands: <screen width="70" format="linespecific"> <prompt>% </prompt><command>git clone &url_git_master; kwave</command> <prompt>% </prompt><command>cd kwave</command> <prompt>% </prompt><command>git checkout tags/<replaceable>[release-tag]</replaceable> </command> </screen> You can look up the names of the release tags in the git web page at <ulink url="&url_git_list_tags;"> &url_git_list_tags;</ulink>. The release tags are always built out of the word <literal>Release-</literal> and the version number of the release, with underscores instead of dots. For example "<literal>Release-&version_tag;</literal>" for v&version;.
es: o puede obtener un versión específica con los siguientes comandos: <screen width="70" format="linespecific"> <prompt>% </prompt><command>git clone &url_git_master; kwave</command> <prompt>% </prompt><command>cd kwave</command> <prompt>% </prompt><command>git checkout tags/<replaceable>[release-tag]</replaceable> </command> </screen> Puede consultar los nombres de las versiones en la página git en <ulink url="&url_git_list_tags;"> &url_git_list_tags;</ulink>. Las etiquetas de las versiones siempre está compuestas por la palabra <literal>Release-</literal> y el número de versión con guiones bajos en vez de puntos. Por ejemplo "<literal>Release-&version_tag;</literal>" for v&version;.

source: The procedure described in the previous section is only necessary once. For further updates it is much easier. Just change into the directory where you have the checked out sources and do the following to update to the latest version: <screen width="40" format="linespecific"> <prompt>% </prompt><command>git pull</command> </screen> Then go on to the next section and compile as usual.
cs: Postup popsaný v předchozím oddíle je nezbytné provést pouze jednou. Při dalších aktualizacích je celá ta věc mnohem jednodušší. Pouze se přesuňte do adresáře, ve kterém máte stažené zdroje a proveďte následující kroky: <screen width="40" format="linespecific"> <prompt>% </prompt><command>git pull</command> </screen> Pak přejděte k dalšímu oddílu a kompilujte jako obvykle.
es: El procedimiento descrito en la sección anterior es solo necesario una vez. Para futuras actualizaciones es mucho más fácil cambiar al directorio donde descargó las fuentes y hacer lo siguiente para obtener la última versión: <screen width="40" format="linespecific"> <prompt>% </prompt><command>git pull</command> </screen> Continuar en la siguiente sección y compilar.

source: If you are developing or testing &kwave;, then you do not necessarily need to uninstall/install &kwave; after every build. Instead you can use the application from where it is built by using a wrapper script. This wrapper script can be built with the follwing command:
es: Si está desarrolando o probando &kwave; entonces no es necesario que instale/desinstale después de cada compilación. Puede utilizar la aplicación desde donde fue compilada usando un script. Este script puede ser creado con el siguiente comando:

source: This is similar to the procedure for the user interface, but requires some extra steps because the master file is in <literal>docbook</literal> format and the <filename>.pot</filename> template is a generated file. Go to the source directory of &kwave; (not the build directory), change into the subdirectory <filename>doc</filename> and create an empty <filename>.po</filename> file: <screen> <prompt>% </prompt><command>cd <parameter><replaceable>$HOME/src/kwave</replaceable></parameter></command> <prompt>% </prompt><command>cd <parameter>doc</parameter></command> <prompt>% </prompt><command>touch <parameter><replaceable>help_fr.po</replaceable></parameter></command> </screen> Then change to your build directory (e.g. somewhere in <filename>/tmp</filename>), prepare for building and then generate the <filename>.pot</filename> template (you can safely ignore the error messages that come out at this stage). This template has to be copied to the <filename>.po</filename> file in the source directory of the online help. Example: <screen> <prompt>% </prompt><command>mkdir <parameter>/tmp/kwave-build</parameter></command> <prompt>% </prompt><command>cd <parameter>/tmp/kwave-build</parameter></command> <prompt>% </prompt><command>cmake <parameter><replaceable>$HOME/src/kwave</replaceable></parameter></command> <prompt>% </prompt><command>make doc</command> <prompt>% </prompt><command>cp <parameter>doc/help_en.pot</parameter> <parameter><replaceable>$HOME/src/kwave/doc/help_fr.po</replaceable></parameter></command> </screen> Now you can translate the <filename>.po</filename> file, like above:
es: Esto es similar al procedimiento usado para la interfaz gráfica pero requiere algunos pasos de más debido a que el archivo maestro está en formato <literal>docbook</literal> y la plantilla <filename>.pot</filename> es un archivo generado. Diríjase al directorio fuente de &kwave; (no al directorio donde se ha generado el ejecutable), cambie al subdirectorio <filename>doc </filename> y cree un archivo <filename>.po</filename> vacio: <screen> <prompt>% </prompt><command>cd <parameter><replaceable>$HOME/src/kwave</replaceable></parameter></command> <prompt>% </prompt><command>cd <parameter>doc</parameter></command> <prompt>% </prompt><command>touch <parameter><replaceable>help_fr.po</replaceable></parameter></command> </screen> Después cambie al directorio donde se ha generado el ejecutable (por ejemplo en <filename>/tmp</filename>), prepare la compilación y entonces genere la plantilla <filename>.pot</filename> (puede ignorar los mensajes de error que se muestran). Esta plantilla tiene que ser copiada al directorio fuente con el nombre adecuado al idioma que contendrá. Por ejemplo: <screen> <prompt>% </prompt><command>mkdir <parameter>/tmp/kwave-build</parameter></command> <prompt>% </prompt><command>cd <parameter>/tmp/kwave-build</parameter></command> <prompt>% </prompt><command>cmake <parameter><replaceable>$HOME/src/kwave</replaceable></parameter></command> <prompt>% </prompt><command>make doc</command> <prompt>% </prompt><command>cp <parameter>doc/help_en.pot</parameter> <parameter><replaceable>$HOME/src/kwave/doc/help_fr.po</replaceable></parameter></command> </screen> Ahora ya puede comenzar la traducción del archivo <filename>.po</filename> como hizo anteriormente:

source: The list of labels/markers.
es: La lista de etiquetas/marcadores.

source: Qt-4.5.0 or higher (normally comes with KDE4)
cs: qt ve verzi 4.5.0 nebo vyšší (normálně je k dispozici s KDE4)

source: flac-1.1.0 or higher (for FLAC import/export)
cs: flac ve verzi 1.1.0 nebo vyšší (kvůli importu FLAC)

source: about 64 MB memory for starting &kwave; (but this may vary depending on your platform and configuration)
cs: asi 64 MB paměti pro spuštění programu &kwave; (ale toto se může lišit v závislosti na vaší platformě a nastavení)

source: A C/C++ compiler. GCC-3.4 works fine, some older and any newer version (like gcc-4.1 and newer) work too.
cs: C/C++ kompilátor. GCC-3.4 pracuje dobře, některé starší a některé novější verze (jako gcc-4.1 a novější) pracují rovněž.

source: pulseaudio-0.9.16 or newer
cs: pulseaudio-0.9.16 nebo vyšší

source: flac-devel-1.1.0 newer
cs: flac-devel-1.1.0 nebo vyšší

source: <literal>WITH_OGG</literal> enable support for ogg files [<literal>on</literal>/<literal>off</literal>, default=<literal>on</literal>]
cs: <literal>WITH_OGG</literal> povolit podporu souborů ogg [<literal>on: zapnuto</literal>/<literal>off: vypnuto</literal>, default=: výchozí=<literal>on: zapnuto</literal>]

source: <literal>WITH_PULSEAUDIO</literal> enable playback via PulseAudio [<literal>on</literal>/<literal>off</literal>, default=<literal>on</literal>]
cs: <literal>WITH_PULSEAUDIO</literal> povolit přehrávání/nahrávání prostřednictvím PulseAudio [<literal>on: zapnuto</literal>/<literal>off: vypnuto</literal>, default=: výchozí=<literal>on: zapnuto</literal>]

source: <literal>WITH_SAMPLERATE</literal> enable sample rate conversion [<literal>on</literal>/<literal>off</literal>, default=<literal>on</literal>]
cs: <literal>WITH_SAMPLERATE</literal> povolit převod kmitočtu [<literal>on: zapnuto</literal>/<literal>off: vypnuto</literal>, default=: výchozí=<literal>on: zapnuto</literal>]

source: <prompt>% </prompt><command>cp <replaceable>/somewhere/kwave-XXX.tar.bz2</replaceable> SOURCES</command>
cs: <prompt>% </prompt><command>cp <replaceable>/kdekoli/kwave-XXX.tar.bz2</replaceable> SOURCES</command>

source: <prompt>% </prompt><command>tar -xOjf SOURCES/<replaceable>kwave-XXX.tar.bz2</replaceable> \*.spec > SPECS/kwave.spec</command>
cs: <prompt>% </prompt><command>tar -xOzf SOURCES/<replaceable>kwave-XXX.tar.bz2</replaceable> \*.spec > SPECS/kwave.spec</command>

source: or you can check out a specific release with the following commands: <screen width="70" format="linespecific"> <prompt>% </prompt><command>git clone &url_git_master;</command> <prompt>% </prompt><command>cd kwave</command> <prompt>% </prompt><command>git checkout tags/<replaceable>[release-tag]</replaceable> </command> </screen> You can look up the names of the release tags in the git web page at <ulink url="&url_git_list_tags;"> &url_git_list_tags;</ulink>. The release tags are always built out of the word <literal>Release-</literal> and the version number of the release, with underscores instead of dots. For example "<literal>Release-&version_tag;</literal>" for v&version;.
cs: nebo můžete následujícím příkazem stáhnout určité vydání: <screen width="70" format="linespecific"> <prompt>% </prompt><command>git clone &url_git_master;</command> <prompt>% </prompt><command>cd kwave</command> <prompt>% </prompt><command>git checkout tags/<replaceable>[release-tag]</replaceable> </command> </screen> Můžete vyhledat názvy jmenovek vydání na internetových stránkách svn <ulink url="&url_git_list_tags;"> &url_git_list_tags;</ulink>. Jmenovky vydání jsou vždy složeny ze slova <literal>Release-</literal> a čísla verze vydání s podtržítky namísto teček. Například "<literal>Release-&version_tag;</literal>" pro v&version;.

source: <prompt>% </prompt><command>CFLAGS="-O4 -march=athlon-xp -mcpu=athlon-xp -pipe" \ CXXFLAGS="-O4 -march=athlon-xp -mcpu=athlon-xp -pipe" \ cmake <replaceable>[source directory]</replaceable></command>
cs: <prompt>% </prompt><command>CFLAGS="-O4 -march=athlon-xp -mcpu=athlon-xp -pipe" \ CXXFLAGS="-O4 -march=athlon-xp -mcpu=athlon-xp -pipe" \ cmake <replaceable>[zdrojový adresář]</replaceable></command>

source: When using &kwave; for the first time, you should go to the memory setup dialog an modify the settings to be suitable for yor needs and the installed memory of your computer. You can reach it under <menuchoice> <guimenu>Options</guimenu><guimenuitem>Memory...</guimenuitem> </menuchoice>.
cs: Při prvním použití &kwave; byste měl jít do dialogu s nastavením paměti a upravit nastavení tak, aby byla vhodná pro vaše potřeby a přiměřená vzhledem k nainstalované paměti vašeho počítače. Najdete jej pod <menuchoice> <guimenu>Volby</guimenu><guimenuitem>Paměť...</guimenuitem> </menuchoice>.

source: If you start &kwave; from the command line, you can specify a list of files that should be opened. The first specified file will be opened first, then the other files. Each file will be opened in an own new window of the same &kwave; instance. If you specify wildcards, you can open a large number of files at once.
cs: Pokud začnete &kwave; z příkazové řádky, můžete určit seznam se soubory, které se mají otevřít. Soubor, který je určen jako první, bude jako první otevřen. Pak budou otevřeny ostatní soubory. Každý soubor se otevře ve vlastním novém okně té samé &kwave; úrovně. Pokud určíte divoké karty, můžete otevřít velký počet souborů ihned.

source: For example, the following command starts a &kwave; and opens all sounds of the KDE window manager, each in a new window:
cs: Například následující příkaz začíná &kwave; a otevře všechny zvuky KDE okenního správce, každý v novém okně.

source: For example, the following command starts a &kwave; window with an initial width of 600 pixels and a height of 400 pixels, with the right border positioned 30 pixels away from the right and 0 pixels away form the top of the screen.
cs: Například následující příkaz spustí &kwave; okno s počáteční šířkou 600 pixelů a výškou 400 pixelů, s pravým okrajem umístěným 30 pixelů od pravého okraje obrazovky a 0 pixelů od horního okraje obrazovky

source: The second format that &kwave; supports is "ASCII". You can export to ASCII, but currently not import from it (this is currently not implemented). Please be aware that storing in this format might produce very large files! The file format will be described <link linkend="ascii_format">below</link>.
cs: Druhým formátem, který &kwave; podporuje je "ASCII". Můžete vyvést soubor do ASCII, ale v současnosti z něj nelze soubor zavést (toto nyní není v programu uskutečněno). Buďte si, prosím, vědom, že ukládání do tohoto formátu může vytvořit velmi rozsáhlé soubory! Tento souborový formát bude popsán <link linkend="ascii_format">níže</link>.

source: Values can be are given in any format that the C library of your system is able to read and interprete as a floating point or integer number. But when saving, &kwave; will save as in signed integer format with a 24 bit range.
cs: Hodnoty mohou být vkládány v jakémkoli formátu, který je schopna knihovna C vašeho systému číst a překládat jako číslo s pohyblivou řádovou čárkou nebo celé číslo. Ale při ukládání bude &kwave; ukládat jako ve formátu celé číslo se znaménkem s 24 bitovým rozsahem.

source: All values are expected to be in signed format. So if you import a file with only positive values, you will only see samples that are above the zero line.
cs: Očekává se, že všechny hodnoty budou ve formátu se znaménkem. Takže pokud zavádíte soubor, který má pouze kladné hodnoty, uvidíte jen vzorky, které jsou nad nulovou čárou.

source: When importing, values can be specified in any range, &kwave; always does a first pass over the file to get the highest absolute value and defines that value as "100%" before really reading in the file and scaling it.
cs: Při zavádění mohou být hodnoty stanoveny v jakémkoli rozsahu, &kwave; vždy napoprvé přejde soubor, aby získal největší absolutní hodnotu, a určí tu hodnotu jako "100%" předtím, než skutečně začne soubor číst a měřit.

source: Internally all values are stored with 24 bit precision (signed).
cs: Uvnitř jsou všechny hodnoty ukládány s 24 bitovou přesností (se znaménkem).

source: This is similar to the procedure for the user interface, but requires some extra steps because the master file is in <literal>docbook</literal> format and the <filename>.pot</filename> template is a generated file. Go to the source directory of &kwave; (not the build directory), change into the subdirectory <filename>doc</filename> and create an empty <filename>.po</filename> file: <screen> <prompt>% </prompt><command>cd <parameter><replaceable>$HOME/src/kwave</replaceable></parameter></command> <prompt>% </prompt><command>cd <parameter>doc</parameter></command> <prompt>% </prompt><command>touch <parameter><replaceable>help_fr.po</replaceable></parameter></command> </screen> Then change your build directory (e.g. somewhere in <filename>/tmp</filename>), prepare for building and then generate the <filename>.pot</filename> template (you can safely ignore the error messages that come out at this stage). This themplate has to be copied to the <filename>.po</filename> file in the source directory of the online help. Example: <screen> <prompt>% </prompt><command>mkdir <parameter>/tmp/kwave-build</parameter></command> <prompt>% </prompt><command>cd <parameter>/tmp/kwave-build</parameter></command> <prompt>% </prompt><command>cmake <parameter><replaceable>$HOME/src/kwave</replaceable></parameter></command> <prompt>% </prompt><command>make doc</command> <prompt>% </prompt><command>cp <parameter>doc/help_en.pot</parameter> <parameter><replaceable>$HOME/src/kwave/doc/help_fr.po</replaceable></parameter></command> </screen> Now you can translate the <filename>.po</filename> file, like above:
cs: Je to podobné jako postup u uživatelského rozhraní, ale vyžaduje to některé kroky navíc, protože hlavní soubor je v <literal>docbook</literal> formátu a <filename>.pot</filename> šablona je vytvářeným souborem. Jděte do zdrojového adresáře &kwave; (není to adresář pro sestavení), přepněte se do podadresáře <filename>doc</filename> a vytvořte prázdný <filename>.po</filename> soubor: <screen> <prompt>% </prompt><command>cd <parameter><replaceable>$HOME/src/kwave</replaceable></parameter></command> <prompt>% </prompt><command>cd <parameter>doc</parameter></command> <prompt>% </prompt><command>touch <parameter><replaceable>help_fr.po</replaceable></parameter></command> </screen> Potom změňte svůj adresář pro sestavení (např. někam do <filename>/tmp</filename>), připravte se na sestavení a pak vytvořte <filename>.pot</filename> šablonu (bezpečně si nemusíte všímat chybových hlášekkteré v této době přicházejí). Tuto šablonu je potřeba zkopírovat do <filename>.po</filename> souboru ve zdrojovém adresáři nápovědy po internetu. Příklad: <screen> <prompt>% </prompt><command>mkdir <parameter>/tmp/kwave-build</parameter></command> <prompt>% </prompt><command>cd <parameter>/tmp/kwave-build</parameter></command> <prompt>% </prompt><command>cmake <parameter><replaceable>$HOME/src/kwave</replaceable></parameter></command> <prompt>% </prompt><command>make doc</command> <prompt>% </prompt><command>cp <parameter>doc/help_en.pot</parameter> <parameter><replaceable>$HOME/src/kwave/doc/help_fr.po</replaceable></parameter></command> </screen> Nyní můžete překládat <filename>.po</filename> soubor, jak to bylo vysvětleno výše:

source: <literal>Comment[</literal><replaceable>fr</replaceable><literal>]=</literal><replaceable>Un éditeur de sons pour KDE</replaceable>
cs: <literal>Comment[</literal><replaceable>cs</replaceable><literal>]=</literal><replaceable>Zvukový editor pro KDE</replaceable>

source: visualization plugins
cs: Vizualizační přídavné moduly

source: <emphasis role="bold"> Andreas Schneider <email>mail@cynapses.org</email> </emphasis><emphasis>[historic]</emphasis>
cs: <emphasis role="bold"> Andreas Schneider <email>mail@cynapses.org</email> </emphasis><emphasis>[historický]</emphasis>

source: <emphasis role="bold"> Stichting Mathematisch Centrum, Amsterdam </emphasis><emphasis>[historic]</emphasis>
cs: <emphasis role="bold"> Stichting Mathematisch Centrum, Amsterdam </emphasis><emphasis>[historický]</emphasis>

source: <emphasis role="bold"> Sun Microsystems, Inc. </emphasis><emphasis>[historic]</emphasis>
cs: <emphasis role="bold"> Sun Microsystems, Inc. </emphasis><emphasis>[historisch]</emphasis>

source: beta tester
cs: Zkoušeč

source: T.H.F. Klok and Cedric Tefft
cs: T.H.F. Klok a Cedric Tefft
