Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: &kwave; currently supports .wav files with 8, 16 and 24 bits per sample, with any number of channels (of course including mono and stereo). Additionally it can import all file types that libaudiofile supports and some other formats like Ogg/Vorbis and MP3.
de: &kwave; unterstützt zur Zeit .wav Dateien mit 8, 16 und 24 bits pro Sample, mit beliebiger Anzahl von Spuren (einschließlich Mono und Stereo natürlich). Zusätzlich unterstützt es alle Dateiformate von libaudiofile sowie andere wie Ogg/Vorbis und MP3.
es: &kwave; soporta actualmente archivos .wav con 8, 16 y 24 bits por muestra, con cualquier número de canales (por supuesto incluyendo mono y estéreo). Adicionalmente puede importar todos los tipos de archivos que libaudiofile soporta y otros formatos como Ogg/Vorbis y MP3.

source: What if I have files with a format not supported by &kwave;?
cs: A co když mám soubory ve formátu nepodporovaném &kwave;?
de: Was ist, wenn ich Dateien habe die &kwave; nicht unterstützt?
es: ¿Qué pasa si tengo archivos con un formato no soportado por &kwave;?

source: If you have to work on a different format, you can convert it into .wav format. A good set of tools for this is in the <ulink url="&url_sox;">SoX</ulink> package, they have also some nice documentation!
cs: Pokud už musíte pracovat s jinými formáty, můžete je převést do formátu .wav. Dobrou sadou nástrojů pro toto použití je balíček <ulink url="&url_sox;">SoX</ulink>, pro který rovněž existuje hezká dokumentace!
de: Wenn Sie mit einem anderen Format arbeiten müssen, dann können Sie dieses in das .wav Format konvertieren. Eine gute Auswahl an Werkzeugen bietet das <ulink url="&url_sox;">SoX</ulink> Paket, das auch umfangreiche Dokumentationen enthält!
es: Si tiene que trabajar con diferentes formatos puede convertirlos a formato .wav. Un buen conjunto de herramientas para este propósito es el paquete <ulink url="&url_sox;">SoX</ulink>, el cual tiene una buen documentación.

source: I get errors when I want to do playback?
cs: Objeví se chyby, když chci přehrávat?
de: Ich bekomme Fehler wenn ich versuche die Wiedergabe zu starten?
es: Obtengo errores al intentar reproducir
fr: J'obtiens des erreurs quand je veux lire des pistes sonores. Pourquoi ?

source: Maybe you have chosen a combination of playback rate and sample size that is not supported by your sound driver and / or sound hardware. Try playback with 8 bits per sample and mono first, this should always work. Then try to increase the bits per sample and stereo playback step by step. Note that some playback rates are not at all supported by some sound hardware.
cs: Je možné, že jste zvolil spojení rychlosti přehrávání a velikosti vzorku, která není podporována vaší zvukovou kartou a/nebo zvukovou technikou. Nejprve vyzkoušejte přehrávání s 8 bity na vzorek a mono. Potom vyzkoušejte zvýšení počtu bitů na vzorek a přehrávání stereo krok za krokem. Všimněte si, že některé rychlosti přehrávání vůbec nejsou podporovány některou zvukovou technikou.
de: Vielleicht haben Sie eine Kombination von Wiedergaberate und Sample-Grösse gewählt, die nicht von ihrem Sound-Treiber und / oder ihrer Soundkarte unterstützt wird. Versuchen Sie zuerst Playback mit 8 bits pro Sample und Mono, dies sollte immer funktionieren. Dann versuchen Sie die Bits pro Sample und die Stereo-Wiedergabe schrittweise zu erhöhen. Beachten Sie dabei aber, dass einige Wiedergaberaten nicht vollständig von einigen Soundkarten unterstützt werden.
es: Quiza a escogido una combinación de frecuencia de reproducción y tamaño de muestra que no es soportado por su controlador de sonido y/o hardware. Intente reproducir con 8 bits por muestra y en mono, esto debería funcionar siempre. Luego intente incrementar el número de bits por muestra y cambie a estéreo paso a paso. Dese cuenta que ciertas frecuencias de reproducción no están soportadas por algunas tarjetas de sonido.

source: The playback seems to do something but I hear nothing?
cs: Zdá se, že probíhá přehrávání, ale já neslyším nic?
de: Die Wiedergabe scheint etwas zu tun, aber ich höre nichts?
es: La reproducción parece funcionar pero no oigo nada
fr: La lecture d'une piste sonore semble fonctionner mais je n'entends rien. Pourquoi ?

source: Maybe you have forgotten to increase the volume of the playback channel. &kwave; is not responsible for changing the playback volume.
cs: Možná jste zapomněl zvýšit úroveň hlasitosti přehrávaného kanálu.&kwave; není odpovědný za změnu hlasitosti přehrávání.
de: Vielleicht haben Sie vergessen die Lautstärke des Wiedergabe-Kanals zu erhöhen. Für das Ändern der Wiedergabelautstärke ist &kwave; nicht verantwortlich.
es: Quiza haya olvidado incrementar el volumen del canal de reprodución. &kwave; no es responsable de cambiar el volumen de reproducción.

source: Some files are played with half-speed?
cs: Některé soubory jsou hrány při poloviční rychlosti?
de: Einige Dateien werden mit halber Geschwindigkeit wiedergegeben?
es: Algunos archivos son reproducidos a la mitad de su velocidad normal
fr: Quelques fichiers sont joués avec une vitesse réduite de moitié. Pourquoi ?

source: Try choosing a different sound playback device.
cs: Zkuste výběr jiného zařízení pro přehrávání zvuku.
de: Versuchen Sie ein anderes Device zur Soundwiedergabe auszuwählen.
es: Intente escoger otro dispositivo de reproducción.
fr: Essayer de choisir un autre périphérique de lecture sonore.

source: The playback sometimes is disturbed and interrupted?
cs: Přehrávání je někdy nevyrovnané a přerušované?
de: Die Wiedergabe wird manchmal gestört und unterbrochen?
es: La reproducción es algunas veces alterada e interrumpida
fr: Quelques fichiers sont joués avec des coupures ou des perturbations. Pourquoi ?

source: You should increase the size of the playback buffer to get a "smoother" playback (this also makes the playback control reacting a bit slower).
cs: Měl byste zvětšit velikost vyrovnávací paměti pro přehrávání, abyste získal "plynulejší" přehrávání (tímto rovněž bude ovládání přehrávání odpovídat o něco pomaleji).
de: Sie sollten die Grösse des Wiedergabepuffers erhöhen um eine "glattere" Wiedergabe zu bekommen (dies führt auch zu einer langsameren Reaktion der Wiedergabe- Kontrolle).
es: Debería incrementar el tamaño del buffer de reproducción para obtener una reproducción más "fluida" (esto también hace que los controles de reproducción respondan un poco más lentos).
fr: Vous devez augmenter le buffer de lecture pour obtenir une lecture plus « fluide » (cela peut générer un contrôle sur la lecture un peu plus lent).

source: The playback does not stop if I immediately press the stop button?
cs: Přehrávání není zastaveno, když okamžitě stisknu tlačítko pro zastavení?
de: Die Wiedergabe hält nicht an, wenn ich sofort die Stop-Taste drücke?
es: La reproducción no se detiene inmediatamente al pulsar el botón de detener
fr: La lecture ne s'arrête pas immédiatement si j'appuie sur le bouton STOP. Pourquoi ?

source: The reason for this is that the sound driver already has received some playback data from &kwave; at the moment when you press the stop button. Decrease the size of the playback buffer and it should react faster (but makes interruptions more probable).
cs: Důvodem je to, že ovladač zvuku již ve chvíli, kdy jste stiskl tlačítko pro zastavení, od &kwave; obdržel nějaká data pro přehrávání. Zmenšete velikost vyrovnávací paměti pro přehrávání a odpověď by měla být rychlejší (ale je tu větší pravděpodobnost přerušování)
de: Der Grund dafür ist, dass der Soundtreiber, in dem Moment in dem Sie die Stop-Taste drücken, bereits Wiedergabedaten von &kwave; erhalten hat. Verringern Sie die Grösse des Wiedergabe Puffers und die Reaktion sollte schneller einsetzen (dabei werden aber Aussetzer wahrscheinlicher).
es: La razón de esto es que el controlador de sonido ya ha recibido datos de reproducción de &kwave; en el momento en el que pulsa el botón de detener. Disminuyendo el tamaño del buffer de reproducción debería provocar una respuesta más rápida (si bien puede provocar interrupciones en la reproducción).

source: Is ALSA supported?
cs: Je podporována ALSA?
de: Wird ALSA unterstützt?
es: ¿Es ALSA soportado?
fr: Les drivers ALSA sont ils supportés ?

source: Yes, since v0.7.4 for playback and recording
cs: Ano. Od verze 0.7.4 pro přehrávání a nahrávání
de: Ja, seit v0.7.4 für Aufnahme und Wiedergabe
es: Sí, desde la versión 0.7.4 tanto para reproducir como para grabación.

source: What about playback with 18, 20, 24 or 32 bits per sample or more than two channels?
cs: A co tak přehrávání s 18, 20, 24 nebo 32 bity na vzorek nebo s více než dvěma kanály?
de: Wie steht es mit der Wiedergabe von 18, 20, 24 oder 32 bits pro Sample oder mehr als zwei Spuren?
es: ¿Es posible reproducir con 18, 20, 24 o 32 bits por muestra en más de dos canales?

source: This is possible through the ALSA interface, since v0.7.4.
cs: Je to možné přes rozhraní ALSA od verze 0.7.4.
de: Dies ist seit v0.7.4 möglich mit Hilfe von ALSA.
es: Esto es posible a través de la interfaz ALSA desde la versión 0.7.4.

source: What about MP3 support?
cs: A co se dá říct o podpoře MP3?
de: Wie steht es mit MP3 Unterstützung?
es: ¿Existe soporte MP3?
fr: Qu'en est-il du support des fichiers MP3 ?

source: Well, as long as there are patent issues, we support only MP3 import through the mad library and export via the external program <ulink url="&url_lame;">lame</ulink>. Additionally you need to have the permission to use code covered by the MP3 patents when generating a Kwave package for distributing!
de: Solange es noch Patent-Probleme mit MP3 gibt, unterstützen wir nur den Import mit Hilfe der "mad"-Bibliothek und den Export über das externe Programm <ulink url="&url_lame;">lame</ulink>. Ausserdem müssen Sie die Berechtigung haben Programmcode zu verwenden der von den MP3-Patenten geschützt ist wenn Sie ein Kwave-Paket für eine Distribution erstellen wollen!
es: Puesto que existen temas de patentes sólo soportamos importación MP3 a través de la biblioteca mad y exportación a través del programa externo <ulink url="&url_lame;">lame</ulink>. Adicionalmente necesitará tener permiso para usar código cubierto por patentes MP3 al generar un paquete de Kwave para distribuir.

source: Credits and License
cs: Zásluhy a licence
de: Credits und Lizenz
es: Créditos y Licencia
fr: Crédits et Licence

source: Program copyright from 1998-2000 Martin Wilz <email>martin@wilz.de</email>
cs: Autorské právo k programu 1998-2000 Martin Wilz <email>martin@wilz.de</email>
de: Programm Copyright von 1998-2000 Martin Wilz <email>martin@mwilz.de</email>
es: Derechos de autor desde 1998-2000 Martin Wilz <email>martin@wilz.de</email>

source: Program copyright since 2000 Thomas Eschenbacher <email>thomas.eschenbacher@gmx.de</email>
cs: Autorské právo (C) k programu drží od roku 2000 Thomas Eschenbacher <email>thomas.eschenbacher@gmx.de</email>
de: Dokumentation copyright (C) seit 2000 Thomas Eschenbacher <email>thomas.eschenbacher@gmx.de</email>
es: Derechos de autor desde 2000 Thomas Eschenbacher <email>thomas.eschenbacher@gmx.de</email>
fr: Programme sous copyright depuis 2000 Thomas Eschenbacher <email>thomas.eschenbacher@gmx.de</email>

source: For a complete list of authors and licenses of all files, please refer to the <ulink url="&url_licenses;"><filename>LICENSES</filename></ulink> file, which is included in the sources. There also is a file with the name <ulink url="&url_authors;"><filename>AUTHORS</filename></ulink> that lists all authors and contributors of &kwave;.
cs: Úplný seznam autorů a licencí všech souborů: podívejte se, prosím, na <ulink url="&url_licenses;"><filename>LICENSES</filename></ulink>, který je zahrnut ve zdrojových souborech. Na internetu je taktéž dostupný soubor s názvem <ulink url="&url_authors;"><filename>AUTHORS</filename></ulink>, který uvádí všechny autory a přispěvatele &kwave;.
de: Für eine vollständige Liste der Autoren und Lizenzen lesen Sie bitte die Datei <ulink url="&url_licenses;"><filename>LICENSES</filename></ulink>, die in der Quellcode-Distribution enthalten ist. Weiterhin gibt es eine Datei namens <ulink url="&url_authors;"><filename>AUTHORS</filename></ulink>, die alle Autoren von &kwave; auflistet;.
es: Para una lista completa de autores y licencias de todos los archivos, por favor, diríjase al archivo <ulink url="&url_licenses;"><filename>LICENSES</filename></ulink> el cual es incluido en las fuentes. También existe un archivo con el nombre <ulink url="&url_authors;"><filename>AUTHORS</filename></ulink> que lista a todos los autores y colaboradores de &kwave;

source: Documentation copyright (C) &version_year; Thomas Eschenbacher <email>thomas.eschenbacher@gmx.de</email>
cs: Copyright (C) k dokumentaci &version_year; Thomas Eschenbacher <email>thomas.eschenbacher@gmx.de</email>
de: Dokumentation Copyright (C) &version_year; Thomas Eschenbacher <email>thomas.eschenbacher@gmx.de</email>

source: Main Authors
cs: Hlavní autoři
de: Haupt-Autoren
es: Autores principales

source: creator of the project, active development 1998-2000
cs: Tvůrce projektu, aktivní vývoj 1998-2000
de: Urheber des Projekts, Entwicklung von 1998-2000
es: creador del proyecto, activo en el desarrollo entre 1998-2000

source: maintainer since 2000, core development
cs: Správce od roku 2000, hlavní vývojář
de: Leiter des Projekts seit 2000, Kern-Entwicklung
es: responsable desde el año 2000, desarrollo principal

source: Major Contributors
cs: Hlavní přispěvatelé
de: Haupt-Beitragende
es: Colaboradores principales

source: <ulink url="&url_debian;">debian</ulink> packager, patches
cs: <ulink url="&url_debian;">tvůrce balíčků pro debian</ulink>, záplaty
de: <ulink url="&url_debian;">debian</ulink> Pakete, Patches
es: Empaquetado y parches para <ulink url="&url_debian;">debian</ulink>

source: spanish translation
de: Spanische Übersetzung
es: Traducción español

source: Notch Filter plugin
cs: Přídavný modul vroubkový filtr
de: Kerbfilter Plugin
es: Complemento filtro suprime banda

source: i18n, french translations, splashscreen, beta tester
cs: i18n, překlad do francouzštiny, úvodní obrazovka, beta tester
de: Französische Übersetzungen, Startbild, Beta-Tester
es: i18n, traducciones al francés, pantalla de inicio, beta tester

source: Czech translation
cs: Překlad do češtiny
de: Tschechische Übersetzung
es: Traducción al checo

source: Help/About plugin
cs: Nápověda/Přídavný modul "O programu"
de: Hilfe/Über-Plugin
es: Complemento de ayuda/acerca de

source: homepage, german translation
cs: Domovská stránka, překlad do němčiny
de: Homepage, deutsche Übersetzung
es: Traducción al alemán, página principal

source: Minor contributors, copyright holders and others
cs: Další přispěvatelé, držitelé autorských práv a jiní
de: Weitere Beitragende, Copyright-Halter und andere
es: Otros colaboradores, propietarios de derechos de autor y otros

source: <emphasis role="bold"> Bertrand Songis <email>bsongis@gmail.com</email> </emphasis><emphasis>[historic]</emphasis>
cs: <emphasis role="bold"> Bertrand Songis <email>bsongis@gmail.com</email> </emphasis><emphasis>[historický]</emphasis>
de: <emphasis role="bold"> Bertrand Songis <email>bsongis@gmail.com</email> </emphasis><emphasis>[historisch]</emphasis>

source: french translation fixes, substitutes for patented libaudiofile code, debian bug 419124
cs: Opravy ve francouzském překladu, náhrada za patentovaný kód v libaudiofile, chyba v Debianu 419124
de: Fehlerbehebungen in der französischen Übersetzung, Ersatz von patentiertem Code in libaudiofile, debian bug 419124
es: Correcciones de la traducción al francés, sustitutos para código patentado en libaudiofile, debian bug 419124

source: svn r2163, patch for libaudiofile detection
cs: svn r2163, záplata pro detekci libaudiofile
de: svn r2163, Patch zur Detektion von libaudiofile
es: svn r2163, parche para la detección de libaudiofile

source: code base for the normalize plugin
cs: Kód pro přídavný modul normalizace
de: Codebasis des Normalisierer-Plugins
es: Código base para el complemento de normalización

source: packaging for Crux Linux
cs: Balíčkování pro Crux Linux
de: Pakete für Crux-Linux
es: Empaquetado para Crux Linux

source: K3AboutContainer, base of KwaveAboutContainer
cs: K3AboutContainer, základ KwaveAboutContainer
de: K3AboutContainer, Grundlage von KwaveAboutContainer
es: K3AboutContainer, base de KwaveAboutContainer

source: the crystal icon theme http://www.everaldo.com/crystal/
cs: Sada ikon crystal http://www.everaldo.com/crystal/
de: das crystal Icon-Thema ttp://www.everaldo.com/crystal/
es: Tema crystal icon http://www.everaldo.com/crystal/

source: parts of plugins/playback/PlayBack-ALSA.cpp
cs: Části plugins/playback/PlayBack-ALSA.cpp
de: Teile von plugins/playback/PlayBack-ALSA.cpp
es: partes de plugins/playback/PlayBack-ALSA.cpp

source: parts of plugins/pitch_shift/PitchShiftFilter.{h,cpp}
cs: Části plugins/pitch_shift/PitchShiftFilter.{h,cpp}
de: Teile von plugins/pitch_shift/PitchShiftFilter.{h,cpp}
es: partes de plugins/pitch_shift/PitchShiftFilter.{h,cpp}

source: svn r1370, fix for debian bug#288781, compilation for amd64
cs: svn r1370, oprava chyby pro Debian-Bug#288781, sestavení pro amd64
de: svn r1370, Fehlerbehebung für Debian-Bug#288781, Generierung für amd64
es: svn r1370, solución para debian bug#288781, compilación para amd64

source: some icons and bitmaps for toolbar and GUI
cs: Několik ikon a obrázků pro nástrojový pruh a rozhraní
de: einige Icons und Bilder für Werkzeugleiste und GUI
es: algunos iconos y mapas de bits para la barra de herramientas y la interfaz gŕafica.

source: Matrix class
cs: Třída Matrix
de: Matrix-Klasse
es: Clase matrix

source: parts of libkwave/memcpy.c
cs: Části libkwave/memcpy.c
de: Teile von libkwave/memcpy.c
es: partes de libkwave/memcpy.c

source: level meter
cs: Měřič úrovně
de: Aussteuerungsanzeige
es: Medidor de señal

source: Thanks To
cs: Poděkování
de: Dank an
es: Gracias a

source: packaging for SuSE Linux
cs: Balíčkování pro SuSE Linux
de: Pakete für SuSE Linux
es: empaquetador para SUSE Linux

source: packaging for Arch Linux
cs: Balíčkování pro Arch Linux
de: Pakete für Arch Linux
es: empaquetador para Arch Linux

source: for information about RPM optimization
cs: Za informace o optimalizaci RPM
de: für Informationen zum Optimieren von RPM-Paketen
es: por la información sobre optimización en RPM

source: maintainers of the <ulink url="&url_id3lib;"> id3lib</ulink> library
cs: Udržovatelé knihovny <ulink url="&url_id3lib;"> id3lib</ulink>
de: Betreuer der <ulink url="&url_id3lib;"> id3lib</ulink> Bibliothek
es: responsables de la biblioteca <ulink url="&url_id3lib;"> id3lib</ulink>

source: author of the <ulink url="&url_libmad;">mad</ulink> mp3 decoder library
cs: Autor knihovny dekodéru MP3 <ulink url="&url_libmad;">mad</ulink>
de: Autor der <ulink url="&url_libmad;">mad</ulink> mp3-Decoder-Bibliothek
es: autor de la biblioteca <ulink url="&url_libmad;">mad</ulink> responsable de decodificar MP3

source: packaging for Mandrake / X86_64
cs: Balíčkování pro Mandrake / X86_64
de: Pakete für Mandrake / X86_64
es: empaquetador para Mandrake/X86_64

source: author of the <ulink url="&url_libsndfile;">sndfile</ulink> library
cs: Autor knihovny <ulink url="&url_libsndfile;">sndfile</ulink>
de: Autor der <ulink url="&url_libsndfile;">sndfile</ulink>-Bibliothek
es: autor de la biblioteca <ulink url="&url_libsndfile;">sndfile</ulink>

source: author of the <ulink url="&url_libaudiofile;">audiofile</ulink> library
cs: Autor knihovny <ulink url="&url_libaudiofile;">audiofile</ulink>
de: Autor der <ulink url="&url_libaudiofile;">audiofile</ulink> Bibliothek
es: autor de la biblioteca <ulink url="&url_libaudiofile;">audiofile</ulink>

source: File Info
de: Datei-Informationen
es: Información del archivo

source: List of File Info Identifiers
de: Liste der Datei-Info-Schlüsselworte

source: Keyword
de: Schlüsselwort

source: Description
de: Beschreibung

source: Name of the album if the source is an album that consist of more medias.
de: Name des Albums wenn es sich um ein Album handelt das aus mehreren Medien besteht.

source: Provides general comments about the file or the subject of the file. If the comment is several sentences long, end each sentence with a period. Do not include newline characters!
de: Enthält allgemeine Kommentare über die Datei oder den Inhalt der Datei. Bei mehrzeiligen Kommentaren sollte jede Zeile mit einem Punkt enden. Keine Zeilenumbrücke einfügen!

source: Indicates where the subject of the file is archived.
de: Gibt an wo der Inhalt der Datei archiviert wird.
es: Indica donde es archivado el sujeto del archivo.

source: Identifies the name of the author of the original subject of the file. Example: 'van Beethoven, Ludwig'
de: Benennt den Namen des Autors des ursprünglichen Werkes oder der Datei.Beispiel: 'van Beethoven, Ludwig'

source: Specifies the lower limit in a VBR bitstream.
de: Setzt die Untergrenze für die Bitrate in einem VBR-Bitstrom.
es: Especifica el límite mínimo en un flujo VBR.

source: Bitrate Mode (ABR, VBR, CBR, etc...)
de: Bitraten-Modus (ABR, VBR, CBR, etc...)
es: Tasa de bits (ABR, VBR, CBR, etc...)

source: Nominal bitrate of the audio stream in bits per second
de: Nominale Bitrate des Audio-Stroms in Bits pro Sekunde
es: Tasa de bits nominal del flujo de audio en bits por segundo

source: Specifies the upper limit in a VBR bitstream.
de: Setzt die Obergrenze der Bitrate in einem VBR-Bitstrom.
es: Especifica el límite superior en un flujo VBR

source: Specifies the number of bits per sample.
de: Setzt die Anzahl der Bits pro Sample.
es: Especifica el numero de bits por muestra

source: Number of the CD, if the source is an album of more CDROMs
de: Nummer der CD, wenn es sich um ein Album aus mehreren CDs handelt
es: Número de CD, si la fuente es un álbum de más de un CD.

source: Number of CDs, if the source is an album of more CDROMs
de: Anzahl der CDs, wenn es sich um ein Albumaus mehreren CDs handelt
es: Número de CDs, si la fuente es un álbum de más de un CD.

source: Specifies the number of channels of the signal.
de: Setzt die Anzahl der Spuren des Signals.
es: Especifica el número de canales de la señal.

source: Lists the name of the person or organization that commissioned the subject of the file.
de: Enthält den Namen der Person oder Organisation, die das Thema der Datei genehmigt hat.

source: Sets a mode for compressing the audio data to reduce disk space.
de: Wählt die Komprimierungs-Methode für Audio-Daten zur Reduktion des Speicherplatz-Bedarfs.

source: Contact information for the creators or distributors of the track. This could be a URL, an email address, the physical address of the producing label.
de: Kontaktinformation für die Ersteller oder Distributoren des Stücks. Dies kann ein URL, eine E-Mail Adresse, oder eine Adresse des Hersteller-Labels sein.

source: Records the copyright information for the file. If there are multiple copyrights, separate them by a semicolon followed by a space. Example: 'Copyright Linux community 2002'
de: Hält die Copyright-Informationen der Datei fest. Sind mehrere Copyright-Angaben vorhanden, sind diese durch Semikolon und Leerzeichen zu trennen. Beispiel: 'Copyright Linux-Gemeinschaft 2002'

source: Indicates whether the file is protected by copyright or not.
de: Gibt an ob der Inhalt der Datei urheberrechtlich geschützt ist oder nicht.
es: Indica si el archivo está sujeto a derechos de autor o no.

source: Specifies the date the subject of the file was created. Example: '2001-12-24'
de: Gibt das Datum an zu dem der ursprüngliche Titel erzeugt wurde. Beispiel: '2001-12-24'
