Repository: KDE/kwave
Catalog: doc/help_*.po
Languages: cs, de, es, fr

source: ALSA (Advanced Linux Sound Architecture): Supercedes OSS, supports more features and more hardware. Might collide with KDE or other applications like OSS does, but has a plugin called "dmix" as a way out. Newer versions of ALSA use a dmix like plugin per default, so this should the best choice for you!
cs: ALSA (Advanced Linux Sound Architecture): Nahrazuje OSS, podporuje více funkcí a větší množství technického vybavení počítače. Může být v rozporu s KDE a dalšími programy, jako OSS, ale má přídavný modul nazývaný "dmix" jako východisko. Novější verze ALSy používají dmix jako přídavný modul již ve výchozím nastavení. Takže ALSA je pro vás tou nejlepším volbou!
de: ALSA (Advanced Linux Sound Architecture): Löst OSS ab, unterstützt mehr Features und mehr Hardware als OSS. Kann mit KDE oder anderen Sound-Applikationen kollidieren, hat aber ein Plugin namens "DMIX" als Ausweg. Diese Wiedergabe-Methode sollte für Sie die beste Wahl sein!
es: ALSA (Advanced Linux Sound Architecture): Reemplaza a OSS, soporta más características y más hardware. Puede colisionar con KDE u otras aplicaciones como lo hace OSS pero dispone de un complemento llamado "dmix" como solución. Las nuevas versiones de ALSA usan dmix como complemento por defecto por lo que esta debería ser su mejor elección.

source: OSS (Open Sound System): The oldest linux implementation, capable of mono and stereo output. Deprecated since linux kernel 2.6, but still wide spread. Might collide with KDE or other sound applications, only one application at a time can use OSS playback !
cs: OSS (Open Sound System): Nejstarší linuxové provedení umožňující monofonní a stereofonní výstup. Odmítáno od linuxového jádra 2.6 ale dosud široce rozšířeno. Může být v rozporu s KDE nebo dalšími zvukovými programy. Pouze jedna aplikace může používat OSS přehrání ve stejném okamžiku!
de: OSS (Open Sound System): Die älteste Linux-Implementierung, Wiedergabe in Mono und Stereo. Veraltet seit Linux-Kernel 2.6, aber immer noch weit verbreitet. Kann mit KDE und anderen Sound-Applikationen kollidieren, es können nicht mehrere Applikationen gleichzeitig OSS-Wiedergabe nutzen !
es: OSS (Open Sound System): La antigua implementación para linux, capaz de salida estéreo y mono. Reemplazada desde el kernel 2.6 pero todavía ampliamente usada. Puede colisionar con KDE y otras aplicaciones de sonido, además sólo una aplicación al mismo tiempo puede utilizar la reproducción OSS.

source: Before trying to play sounds, you should take a look on the playback configuration dialog:
cs: Předtím, než se pokusíte přehrát nějaké zvuky, byste se měl podívat na dialog pro nastavení přehrávání:
de: Bevor Sie erstmals Dateien abspielen, sollten Sie den Dialog der Wiedergabe-Einstellungen ansehen:
es: Antes de intentar reproducir sonidos debería echar un vistazo a la ventana de reproducción.

source: Here's a screenshot of &kwave;'s playback setup dialog
cs: Tady je snímek dialogu pro nastavení přehrávání v &kwave;
de: Das ist ein Screenshot von &kwave;'s Wiedergabe-Einstellungen
es: Aquí una captura de pantalla de la ventana de reproducción de &kwave;

source: Screenshot of the Playback Setup Dialog
cs: Snímek dialogu pro nastavení přehrávání
de: Screenshot der Wiedergabe-Einstellungen
es: Captura de pantalla de la ventana de reproducción

source: Currently &kwave; supports only 8 and 16 bit playback, with mono or stereo output through the OSS interface, but many also all modes your sound hardware supports through the ALSA interface.
cs: Nyní &kwave; podporuje pouze 8 a 16 bitové přehrávání s mono a stereo výstupem prostřednictvím OSS rozhraní, ale mnoho, také všechny režimy, podporuje vaše zvuková karta prostřednictvím rozhraní ALSA.
de: Momentan unterstützt &kwave; die Wiedergabe mit 8 und 16 Bits, mit Mono und Stereo via OSS, sowie alle andern Modi die von Ihrer Sound-Hardware unterstützt werden mit Hilfe des ALSA-Systems.
es: Actualmente &kwave; soporta solo reproducción de 8 y 16 bits con salida mono o estéreo a través de la interfaz OSS, pero muchos más modos pueden ser soportados por su hardware a través del interfaz ALSA.

source: If your sound file uses more or less channels than the playback allows, all channels will be mixed together during playback. For example if you have a file with three channels and you use stereo playback, the left channel will play channel 0 (upper) and half of channel 1 (middle), the right channel will play the half of channel 1 (middle) and channel 2 (lower).
cs: Pokud váš hudební soubor používá více či méně kanálů, než přehrávání umožňuje, všechny kanály budou během přehrávání smíchány dohromady. Například, jestliže máte soubor se třemi kanály a používáte přehrávání stereo, levý kanál bude přehrávat kanál 0 (horní) a polovinu kanálu 1 (střední), pravý kanál bude přehrávat polovinu kanálu 1 (střední) a kanál 2 (dolní).
de: Wenn Ihre Datei mehr Spuren besitzt als Ihre Wiedergabe-Hardware erlaubt, werden alle Kanäle zur Wiedergabe zusammengemischt. Wenn Sie beispielsweise eine Datei mit drei Spuren abspielen wollen, so wird am linken Kanal die Spur 0 (oben) und die Hälfte von Spur 1 (mitte) abgespielt, am rechten Kanal die andere Hälfte von Spur 1 und der Spur 2 (unten).
es: Si su archivo de sonido usa más o menos canales que los que la reproducción permitetodos los canales serán mezclados durante la reproducción. Por ejemplo, si tiene un archivo con tres canales y usa una reproducción estéreo, el canal izquierdo reproducirá el canal 0 (superior) y la mitad del canal 1 (medio), el canal derecho reproducirá la mitad del canal 1 (medio) y el canal 2 (inferior).

source: For getting a smooth playback without interruptions, you should also set the buffer size to an appropriate value. If you encounter problems with interrupted playback, you should increase the buffer size here. But the bigger you set the buffer, the bigger is the latency between the audible sound and the display of the playback position in the signal display.
cs: Abyste získal hladké přehrávání bez přerušení, měl byste také nastavit velikost vyrovnávací paměti na vhodnou hodnotu. Pokud se setkáte s potížemi s přerušovaným přehráváním, měl byste v tomto případě zvýšit velikost vyrovnávací paměti. Ale čím větší je velikost vyrovnávací paměti, kterou nastavíte, tím větší je latence mezi slyšitelným zvukem a zobrazením polohy přehrávání při zobrazení signálu (latence: "prodleva", časový úsek, dokud se zobrazení již přehrané polohy neobjeví).
de: Um eine saubere Wiedergabe ohne Unterbrechungen zu erreichen, sollten Sie die Puffer-Grösse auf einen sinnvollen Wert einstellen. Wenn Sie Probleme mit Unterbrechungen während der Wiedergabe haben, sollten Sie hier den Puffer vergrössern. Je grösser Sie jedoch den Puffer einstellen, desto grösser wird die Verzögerung zwischen dem hörbaren Sound und der angezeigten Wiedergabe-Position im Hauptfenster.
es: Para obtener una reproducción fluida sin interrumpciones debería también fijar el tamaño del buffer a un valor apropiado. Si encuentra problemas con una reproducción interrumpida debería incrementar el tamaño del buffer aquí. Cuanto mayor sea el buffer, mayor será la latencia entre el sonido audible y la visualización de la posición de la reproducción en la ventana principal.

source: The playback settings dialog also provides a button for playing a simple test sound. You should hear a 440Hz tone that wanders over all speakers, from one to the next.
cs: Dialog pro nastavení přehrávání rovněž poskytuje tlačítko pro přehrávání jednoduchého zkušebního zvuku. Měl byste slyšet tón o kmitočtu 440Hz, který postupně putuje všemi tlampači od jednoho k druhému.
de: Der Dialog der Wiedergabe-Einstellungen enthält auch einen Knopf um einen einfachen Test-Ton abzuspielen. Sie sollten einen 440Hz-Ton hören, der der Reihe nach über alle Lautsprecher wandert.
es: La ventana de opciones de reproducción proporciona también un botón para reproducir un sonido de muestra. Debería oir un tono de 440Hz de altavoz en altavoz.

source: Once you have configured playback, you can use the playback controls of the &kwave; main window or through the <menuchoice><guimenu>Play</guimenu></menuchoice> menu or with keyboard shortcuts:
cs: Když už máte nastaveno přehrávání, můžete použít ovladače přehrávání v hlavním okně &kwave; nebo prostřednictvím nabídky hlavní lišty <menuchoice><guimenu>Přehrát</guimenu></menuchoice> nebo přes klávesové zkratky:
de: Sobald Sie die Wiedergabe konfiguriert haben, können Sie die Wiedergabe-Kontrollelemente des &kwave;-Hauptfensters aus dem <menuchoice><guimenu>Wiedergabe</guimenu></menuchoice>-Menü oder mit Tastaturkürzel verwenden:
es: Una vez que haya configurado la reproducción puede usar los controles de reproducción de la ventana principal de &kwave;, o a través de el menú <menuchoice><guimenu> Reproducción</guimenu></menuchoice> o con los atajos de teclado:

source: <menuchoice> <shortcut><keycombo><keycap>P</keycap></keycombo></shortcut> <guimenu>Play</guimenu><guimenuitem>Start</guimenuitem> </menuchoice>: Start playback of the current selection from it's beginning or the whole file from the current cursor position if nothing was selected. Play only once.
cs: <menuchoice> <shortcut><keycombo><keycap>P</keycap></keycombo></shortcut> <guimenu>Hraní</guimenu><guimenuitem>Spustit</guimenuitem> </menuchoice>: Spustí přehrávání současného výběru od jeho začátku nebo celého souboru od nynější polohy ukazatele, pokud nebylo nic vybráno. Přehraje pouze jednou.
de: <menuchoice> <shortcut><keycombo><keycap>P</keycap></keycombo></shortcut> <guimenu>Wiedergabe</guimenu><guimenuitem>Start</guimenuitem> </menuchoice>: Startet die Wiedergabe vom Anfang der aktuellen Auswahl an, oder von der aktuellen Cursorposition wenn nichts ausgewählt wurde. Es wird nur ein mal abgespielt.
es: <menuchoice> <shortcut><keycombo><keycap>P</keycap></keycombo></shortcut> <guimenu>Reproducción</guimenu><guimenuitem>Comenzar</guimenuitem> </menuchoice>: Comienza la reproducción de la selección actual desde su comienzo o la reproducción del archivo completo desde la posición actual del cursor si no se ha seleccionado nada. Reproduce una sola vez.

source: <menuchoice> <guimenu>Play</guimenu><guimenuitem>Loop</guimenuitem> </menuchoice>: Like before, but repeat in a loop.
cs: <menuchoice> <guimenu>Hraní</guimenu><guimenuitem>Smyčka</guimenuitem> </menuchoice>: Jako předtím, ale s opakováním ve smyčce.
de: <menuchoice> <guimenu>Wiedergabe</guimenu><guimenuitem>Schleife</guimenuitem> </menuchoice>: wie zuvor, jedoch mit Wiederholung in einer Schleife.
es: <menuchoice> <guimenu>Reproducción</guimenu><guimenuitem>Bucle</guimenuitem> </menuchoice>: Como el anterior, a excepción de que repite en bucle.

source: <menuchoice> <shortcut><keycombo><keycap>Space</keycap></keycombo></shortcut> <guimenu>Play</guimenu><guimenuitem>Pause</guimenuitem> </menuchoice>: Pause the playback at the current position. Only available when the playback is running.
cs: <menuchoice> <shortcut><keycombo><keycap>Mezerník</keycap></keycombo></shortcut> <guimenu>Hraní</guimenu><guimenuitem>Pozastavit</guimenuitem> </menuchoice>: Pozastaví přehrávání v úrovni nynější polohy. Funkce je dostupná pouze tehdy, když je spuštěno přehrávání.
de: <menuchoice> <shortcut><keycombo><keycap>Space</keycap></keycombo></shortcut> <guimenu>Wiedergabe</guimenu><guimenuitem>Pause</guimenuitem> </menuchoice>: Hält die Wiedergabe an der aktuellen Position an. Nur verfügbar während die Wiedergabe läuft.
es: <menuchoice> <shortcut><keycombo><keycap>Espacio</keycap></keycombo></shortcut> <guimenu>Reproducción</guimenu><guimenuitem>Pausar</guimenuitem> </menuchoice>: Pausa la reproducción en la posición actual. Sólo disponible cuando la reproducción están en marcha.

source: <menuchoice> <shortcut><keycombo><keycap>Space</keycap></keycombo></shortcut> <guimenu>Play</guimenu><guimenuitem>Continue</guimenuitem> </menuchoice>: Continue the playback from the position where it has been paused. Only available if the playback is paused.
cs: <menuchoice> <shortcut><keycombo><keycap>Mezerník</keycap></keycombo></shortcut> <guimenu>Hraní</guimenu><guimenuitem>Pokračovat</guimenuitem> </menuchoice>: Pokračuje se s přehrávání od polohy, kde bylo pozastaveno. Funkce je dostupná pouze tehdy, když je přehrávání pozastaveno.
de: <menuchoice> <shortcut><keycombo><keycap>Space</keycap></keycombo></shortcut> <guimenu>Wiedergabe</guimenu><guimenuitem>Fortsetzen</guimenuitem> </menuchoice>: Setzt die Wiedergabe an der Stelle fort an der sie angehalten wurde. Nur verfügbar wenn die Wiedergabe angehalten wurde.
es: <menuchoice> <shortcut><keycombo><keycap>Espacio</keycap></keycombo></shortcut> <guimenu>Reproducir</guimenu><guimenuitem>Continuar</guimenuitem> </menuchoice>: Continua la reproducción desde la posición donde ha sido pausada. Sólo disponible si la reproducción ha sido pausada.

source: <menuchoice> <shortcut><keycombo><keycap>Esc</keycap></keycombo></shortcut> <guimenu>Play</guimenu><guimenuitem>Stop</guimenuitem> </menuchoice>: Stop the playback, go back to the start of the selection.
cs: <menuchoice> <shortcut><keycombo><keycap>Esc</keycap></keycombo></shortcut> <guimenu>Hraní</guimenu><guimenuitem>Zastavit</guimenuitem> </menuchoice>: Zastaví přehrávání, přejde na začátek výběru.
de: <menuchoice> <shortcut><keycombo><keycap>Esc</keycap></keycombo></shortcut> <guimenu>Wiedergabe</guimenu><guimenuitem>Stop</guimenuitem> </menuchoice>: Beendet die Wiedergabe, geht zurück an den Start der Auswahl.
es: <menuchoice> <shortcut><keycombo><keycap>Esc</keycap></keycombo></shortcut> <guimenu>Reproducción</guimenu><guimenuitem>Detener</guimenuitem> </menuchoice>: Detiene la reproducción regresando al comienzo de la selección.

source: File Properties
cs: Vlastnosti souboru
de: Datei-Eigenschaften
es: Propiedades de archivo

source: &kwave; is able to handle several meta information that is stored within an audio file. It tries to import and export as much of that information as possible. For example, if you import an MP3 file with ID3 tags, you can keep that information when exporting to a Wave file. If &kwave; would lose meta information when saving, it shows a warning.
cs: &kwave; je schopen si poradit s několika meta informacemi, jež jsou uloženy uvnitř zvukového souboru. Pokouší se zavést a vyvést tolik z těchto údajů, kolik je jen možné. Například, pokud zavedete soubor MP3 se značkami ID3, můžete uchovat tyto údaje i při vyvedení do souboru wav. Pokud by &kwave; ztratil meta informace, když je ukládá, ukáže varování.
de: &kwave; kann verschiedene Zusatzinformationen verwalten, die mit in einer Audio-Datei gespeichert wurden. Es versucht, so viele dieser Informationen wie möglich zu importieren und zu exportieren. Wenn Sie zum Beispiel MP3-Dateien mit ID3-Tags importieren, bleiben diese beim Speichern als Wave-Datei nicht erhalten. Wenn &kwave; Zusatzinformationen beim Speichern verlieren würde, erscheint eine Warnung.
es: &kwave; es capaz de gestionar los metadatos que están almacenados dentro de un archivo de audio e intenta importar y exportar tanta de esa información como sea posible. Por ejemplo, si importa un archivo MP3 con etiquetas ID3, puede mantener esa importación al exportar a un archivo Wave. Si &kwave; perdiera metadatos al guardar mostraría una advertencia.

source: You can view and modify the meta information under <menuchoice> <guimenu>Edit</guimenu><guimenuitem>File Properties...</guimenuitem> </menuchoice>. There you can also change things like sample format, resolution and compression.
cs: Můžete si prohlížet a upravovat meta informace v nabídce hlavní lišty <menuchoice> <guimenu>Úpravy</guimenu><guimenuitem>Vlastnosti souboru...</guimenuitem> </menuchoice>. Zde můžete trovněž měnit věci, jako jsou vzorkovací formát, rozlišení a zhuštění.
de: Datei-Informationen können Sie ansehen und bearbeiten unter <menuchoice> <guimenu>Bearbeiten</guimenu><guimenuitem>Datei-Informationen...</guimenuitem> </menuchoice>. Hier können auch Sie Dinge wie das Sample-Format, Auflösung, und Kompression einstellen.
es: Puede ver y modificar los metadatos desde el menú <menuchoice> <guimenu>Editar</guimenu><guimenuitem>Propiedades del archivo... </guimenuitem> </menuchoice>. Ahí puede también cambiar aspectos como el formato de muestreo, resolución o compresión.

source: Here's a screenshot of &kwave;'s file properties dialog
cs: Tady je snímek obrazovky &kwave; s dialogem pro vlastnosti souboru
de: Das ist ein Screenshot von &kwave;'s Dialog der Datei-Informationen
es: Aquí una captura de pantalla de la ventana de propiedades del archivo.

source: Screenshot of the File Properties Dialog
cs: Snímek obrazovky s dialogem pro vlastnosti souboru
de: Screenshot des Dialogs mit Datei-Informationen
es: Captura de pantalla de la ventana de propiedades del archivo

source: Zooming and navigating
cs: Přibližování a oddalování a pohyb po souboru
de: Zoomen und Navigieren
es: Zum y navegación

source: &kwave; provides several ways to zoom and navigate, using keyboard shortcuts, menu commands, toolbar buttons and by using the mouse. The following sections should give an overview on how to use all of these functions.
cs: &kwave; poskytuje několik způsobů pro přibližování a oddalování a pohyb po souboru za použití klávesových zkratek, příkazů hlavní lišty, nástrojových tlačítek a s využitím myši. Následující oddíly by měly podat přehled způsobů, jak používat všechny tyto funkce.
de: &kwave; ermöglicht es auf verschiedene Arten und Weisen zu zoomen und zu navigieren: über Tastaturkürzel, Werkzeugleiste und mit der Maus. Die folgenden Abschnitte geben eine Übersicht wie diese Funktionen verwendet werden.
es: &kwave; proporciona varias maneras para hacer zum y navegar usando atajos de teclado, comandos de menú, botones de la barra de herramientas o usando el ratón. Las siguientes secciones dan una visión general de cómo usar todas estas funciones.

source: Zooming in and out
cs: Přibližování a oddalování
de: Hinein- und Heraus-zoomen
es: Acercar y alejar

source: <emphasis>zoom to whole signal:</emphasis> selects a zoom factor that makes the whole signal visible in the current window.
cs: <emphasis>Najet na celý signál:</emphasis> vybere násobek zvětšení, který předvede celý signál jako viditelný v nynějším okně.
de: <emphasis>Auf das ganze Signal zoomen:</emphasis> Wählt einen Vergrößerungsfaktor der das gesamte Signal in der aktuellen Ansicht sichtbar macht.
es: <emphasis>Zum a toda la señal:</emphasis> selecciona un factor de zum que hace toda la señal visible en la ventana actual.

source: menu entry: <menuchoice> <guimenu>View</guimenu><guimenuitem>Zoom to whole signal</guimenuitem> </menuchoice>
cs: položka hlavní lišty: <menuchoice> <guimenu>Pohled</guimenu><guimenuitem>Najet na celý signál</guimenuitem> </menuchoice>
de: Menü-Eintrag: <menuchoice> <guimenu>Ansicht</guimenu><guimenuitem>Zoom auf das gesamte Signal</guimenuitem> </menuchoice>
es: entrada de menú: <menuchoice> <guimenu>Vista</guimenu><guimenuitem>Zum a todala señal</guimenuitem> </menuchoice>

source: toolbar button:
cs: tlačítko nástrojové lišty:
de: Werkzeugleisten-Schaltfläche:
es: botón de la barra de herramientas:

source: zoom all button
cs: tlačítko najet na vše
de: auf alles vergrössern
es: botón de zum a todo

source: <emphasis>zoom to 100%:</emphasis> zooms in up to a scale where on sample is represented by on pixel on the screen.
cs: <emphasis>Najet na 100%:</emphasis> přiblíží obraz až do takového měřítka, kdy vzorek je na obrazovce představován podle pixelu.
de: <emphasis>Auf 100% vergrössern:</emphasis> vergrössert auf einen Massstab bei dem ein Sample einem Pixel auf dem Bildschirm entspricht.
es: <emphasis>zum al 100%:</emphasis> acerca hasta una escala en donde una muestra es representada por los píxeles en la pantalla.

source: menu entry: <menuchoice> <guimenu>View</guimenu><guimenuitem>Zoom to 100%</guimenuitem> </menuchoice>
cs: položka hlavní lišty: <menuchoice> <guimenu>Pohled</guimenu><guimenuitem>Najet na 100%</guimenuitem> </menuchoice>
de: Menü-Eintrag: <menuchoice> <guimenu>Ansicht</guimenu><guimenuitem>auf 100% vergrössern</guimenuitem> </menuchoice>
es: entrada de menú: <menuchoice> <guimenu>Vista</guimenu><guimenuitem>Zum al 100%</guimenuitem> </menuchoice>

source: zoom to 100% button
cs: tlačítko Najet na 100 %
de: auf 100% vergrössern
es: botón de zum al 100%

source: <emphasis>zoom in:</emphasis> zooms in to see more details, magnifies by factor 3.
cs: <emphasis>Přiblížit:</emphasis> přiblíží pro pohled na více podrobností, zvětšuje podle násobku 3.
de: <emphasis>Vergrössern:</emphasis> vergrössert die Ansicht um mehr Details darzustellen, vergrössert um Faktor 3.
es: <emphasis>acercar:</emphasis> acerca para ver más detalles. Aumenta por un factor de 3.

source: menu entry / keyboard shortcut: <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>+</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Zoom In</guimenuitem> </menuchoice>
cs: položka hlavní lišty/klávesová zkratka: <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>+</keycap></keycombo></shortcut> <guimenu>Pohled</guimenu><guimenuitem>Přiblížit</guimenuitem> </menuchoice>
de: Menü-Eintrag / Tastenkürzel: <menuchoice> <shortcut><keycombo><keycap>Strg</keycap><keycap>+</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu><guimenuitem>Vergrössern</guimenuitem> </menuchoice>
es: entrada de menú / atajo de teclado:<menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>+</keycap></keycombo></shortcut> <guimenu>Vista</guimenu><guimenuitem>Acercar</guimenuitem> </menuchoice>

source: zoom in button
cs: tlačítko Přiblížit
de: Vergrössern-Taste
es: botón de acercar

source: <emphasis>zoom out:</emphasis> zooms in to see less details, shrinks by factor 3.
cs: <emphasis>Oddálitt:</emphasis> Oddaluje pro pohled na méně podrobností, zmenšuje podle násobku 3.
de: <emphasis>Verkleinern:</emphasis> verkleinert die aktuelle Ansicht um weniger Details darzustellen, verkleinert um Faktor 3.
es: <emphasis>alejar:</emphasis> aleja para ver menos detalles. Disminuye por un factor de 3.

source: menu entry / keyboard shortcut: <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>-</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Zoom Out</guimenuitem> </menuchoice>
cs: položka hlavní lišty/klávesová zkratka: <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>+</keycap></keycombo></shortcut> <guimenu>Pohled</guimenu><guimenuitem>Oddálit</guimenuitem> </menuchoice>
de: Menü-Eintrag / Tastenkürzel: <menuchoice> <shortcut><keycombo><keycap>Strg</keycap><keycap>-</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu><guimenuitem>Verkleinern</guimenuitem> </menuchoice>
es: entrada de menú / atajo de teclado: <menuchoice> <shortcut><keycombo><keycap>Ctrl</keycap><keycap>-</keycap></keycombo></shortcut> <guimenu>Vista</guimenu><guimenuitem>Alejar</guimenuitem> </menuchoice>

source: zoom out button
cs: tlačítko Oddálit
de: Verkleinern
es: botón de alejar

source: <emphasis>zoom selection:</emphasis> zooms to a factor where the current selection is completely visible in the current view.
cs: <emphasis>Najet na výběr:</emphasis> zvětší na násobek, kdy je současný výběr zcela viditelný v nynějším pohledu.
de: <emphasis>Zoom auf Auswahl:</emphasis> wählt den Vergrößerungsfaktor so dass die aktuelle Auswahl vollständig ins die aktuelle Ansicht eingepasst wird.
es: <emphasis>zum a la selección:</emphasis> aplica un factor de zum para el cual la selección actual es completamente visible en la vista actual.
