Repository: KDE/kwave
Catalog: po/*/kwave.po
Languages: ar, eo

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
eo: Oliver Kellogg

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
eo: olivermkellogg@gmail.com

source: Reading configuration...
ar: يقرأ الإعدادات…
eo: Legante agordon...

source: Opening main window...
ar: يفتح النافذة الرئيسة…
eo: Malfermante ĉefan fenestron...

source: Startup done
ar: انتهى التشغيل
eo: Ekfunkciigo farita

source: Scanning plugins...
ar: يكتشف الملحقات…
eo: Skanante kromaĵojn...

source: Loading plugins...
ar: يحمل الملحقات…
eo: Ŝargante kromaĵojn...

source: Failed
ar: فشل
eo: Malsukcesis

source: Kwave has not been properly installed. No plugins found!
ar: لم يُثبّت موجّة بشكل صحيح. لم يُعثر على أيّ ملحقة!
eo: Kwave ne estis ĝuste instalita. Neniu kromaĵo trovita!

source: Ready
ar: جاهز
eo: Preta

source: Playback: %1
ar: تشغيل: %1
eo: Reproduktado: %1

source: Playback: %1 samples
ar: التشغيل: %1 عينة
eo: Reproduktado: %1 specimenoj

# %1 = Path to modified file
source: * %1 (modified)
ar: * %1 (معدّل)
eo: * %1 (modifita)

source: This file has been modified, changes will be lost. Do you want to continue?
ar: لقد عُدّل هذا الملف، ستضيع التغييرات. أتريد المتابعة؟
eo: Ĉi tiu dosiero estis modifita, ŝanĝoj estos perditaj. Ĉu vi volas daŭrigi?

source: Save As
ar: احفظ كَ‍
eo: Konservi kiel

source: The file '%1' already exists. Do you really want to overwrite it?
ar: الملف '%1' موجود مسبقًا. أتريد حقًا الاستبدال؟
eo: La dosiero '%1' jam ekzistas. Ĉu vi vere volas anstataŭigi ĝin?

source: This file has been modified. Do you want to save it?
ar: عُدل هذا الملف. أتريد حفظه؟
eo: Ĉi tiu dosiero estas modifita. Ĉu vi volas konservi ĝin?

source: Thomas Eschenbacher
ar: توماس إيشينباخر

source: Project leader since 2000, core development
ar: قائد المشروع منذ 2000، التطوير الأساسي
eo: Projektestro ekde 2000, kerna evoluo

source: Martin Wilz
ar: مارتن ويلز

source: Creator of the project, development 1998-2000
ar: مُنشئ المشروع، التطوير 1998-2000
eo: Kreinto de la projekto, evoluo 1998-2000

source: Ralf Waspe
ar: رالف فاسبيه

source: Creator of the Help/About dialog
ar: مُنشئ حوار المساعدة/عن
eo: Kreinto de la dialogo Helpo/Pri

source: Caulier Gilles
ar: كولير جيل

source: splashscreen, tests and bugfixes
ar: شاشة البداية، الاختبارات وإصلاح الأخطاء
eo: ŝprucekrano, testoj kaj korektoj

source: Dave Flogeras
ar: ديف فلوجيراس

source: Notch filter plugin
ar: ملحقة مرشح الشق
eo: Notch-filtrila kromaĵo

source: Rik Hemsley
ar: ريك هيمسلي

source: Level meter
ar: مستوى الصوت
eo: Nivelmezurilo

source: Joerg-Christian Boehme
ar: يورغ-كريستيان بومه

source: PulseAudio record plugin
ar: ملحقة تسجيل PulseAudio
eo: PulseAudio registra kromaĵo

source: Mark Penner
ar: مارك بينر

source: Stefan Westerfeld
ar: ستيفان ويسترفيلد

source: Author of aRts
ar: مؤلف aRts
eo: Aŭtoro de aRts

source: Sven-Steffen Arndt
ar: سفين-ستيفن أرندت

source: Kwave homepage and German online help
ar: الصفحة الرئيسة لموجة والمساعدة الألمانية على الإنترنت
eo: Kwave-hejmpaĝo kaj germana interreta helpo

source: Aurelien Jarno
ar: أورليان جارنو

source: Debian packager
ar: حزمة دبيان
eo: Debian-pakisto

source: Robert M. Stockmann
ar: روبرت م. ستوكمان

source: Packaging for Mandrake / X86_64
ar: التحزيم لـ Mandrake / X86_64
eo: Pakado por Mandrake / X86_64

source: Martin Kuball
ar: مارتن كوبال

source: Tester
ar: مختبر
eo: Testilo

source: Robert Leslie
ar: روبرت ليزلي

source: Author of the 'mad' MP3 decoder library
ar: مؤلف مكتبة فك ترميز MP3 'mad'
eo: Aŭtoro de la 'freneza' MP3-malĉifrilo-biblioteko

source: Maintainers of the 'id3lib' library
ar: القائمون على مكتبة 'id3lib'
eo: Prizorgantoj de la biblioteko 'id3lib'

source: Michael Pruett
ar: مايكل برويت

source: Author of the 'audiofile' library
ar: مؤلف مكتبة 'audiofile'
eo: Aŭtoro de la biblioteko 'sondosiero'

source: Carlos R.
ar: كارلوس ر.
eo: Karlo R.

source: Spanish translation
ar: الترجمة الأسبانية
eo: Hispana traduko

source: Erik de Castro Lopo
ar: إيريك دي كاسترو لوبو

source: Author of the 'sndfile' library
ar: مؤلف مكتبة 'sndfile'
eo: Aŭtoro de la biblioteko 'sndfile'

source: Pavel Fric
ar: بافيل فريك

source: Czech translation
ar: الترجمة التشيكية
eo: Ĉeĥa traduko

source: Panagiotis Papadopoulos
ar: باناجيوتيس بابادوبولوس

source: String and i18n updates
ar: تحديثات النصوص والتوطين (i18n)
eo: Signoĉenaj kaj i18n-ĝisdatigoj

source: Disable the Splash Screen.
ar: عطّل شاشة البداية.
eo: Malebligi la Salutŝildon.

source: Start Kwave iconified.
ar: ابدأ موجة مصغّرًا.
eo: Komenci Kwave piktogramigite.

# description of command line parameter
source: Log all commands into a file <file>.
ar: سجّل كل الأوامر في ملف <file>.
eo: Protokoli ĉiujn komandojn en dosiero <file>.

# placeholder of command line parameter
source: file
ar: ملف
eo: dosiero

# description of command line parameter
source: Select a GUI type: SDI, MDI or TAB mode.
ar: اختر نوع واجهة المستخدم: وضع SDI أو MDI أو TAB.
eo: Elektu GUI-tipon: SDI, MDI aŭ TAB-reĝimo.

# description of command line parameter
source: List of audio files, Kwave macro files or Kwave URLs to open (optionally)
ar: قائمة ملفات الصوت، أو ملفات ماكرو موجة، أو عناوين URL لموجة لفتحها (اختياري)
eo: Listo de sondosieroj, Kwave makrodosieroj aŭ Kwave-URL-oj por malfermi (laŭvole)

# placeholder of command line parameter
source: [files...]
ar: [ملفات...]
eo: [dosieroj...]

source: Kwave
ar: موجة

source: A sound editor built on KDE Frameworks 5
ar: محرر صوتي مبني على إطار كِيدِي 5
eo: Sonredaktilo konstruita sur KDE Frameworks 5

source: (c) 2016, Thomas Eschenbacher
ar: (ج) 2016، توماس إيشينباشر

source: Kwave label list
ar: قائمة تسميات موجة
eo: Kwave-etikedlisto

source: Add Label
ar: أضف لصيقة
eo: Aldoni Etikedon

source: Load Labels
ar: حمّل اللاصقات
eo: Ŝargi Etikedojn

source: Save Labels
ar: احفظ اللاصقات
eo: Konservi Etikedojn

source: There already is a label at the position you have chosen. Do you want to replace it?
ar: يوجد تسمية فعلاً في الموضع الذي اخترته. هل تريد استبدالها؟
eo: Jam estas etikedo ĉe la pozicio, kiun vi elektis. Ĉu vi volas anstataŭigi ĝin?

source: Modify Label
ar: عدّل اللصيقة
eo: Modifi Etikedon

# menu: /File
source: File
ar: ملف
eo: Dosiero

# menu: /File/New...
source: New...
ar: جديد...
eo: Nova...

# menu: /File/Open
source: Open
ar: افتح
eo: Malfermi

# menu: /File/Open Recent
source: Open Recent
ar: أحدث ملفات
eo: Malfermi Lastatempan

# menu: /File/Open Recent/Clear List
source: Clear List
ar: امحُ القائمة
eo: Viŝi Liston

# menu: /File/Record
source: Record
ar: سجّل
eo: Registri

# menu: /File/&Save
source: &Save
ar: ا&حفظ
eo: Kon&servi

# menu: /File/Save
source: Save
ar: احفظ
eo: Konservi

# menu: /File/Save/As...
source: As...
ar: كـ...
eo: Kiel...

# menu: /File/Save/Selection...
source: Selection...
ar: التحديد...
eo: Elekto...

# menu: /File/Save/Blocks...
source: Blocks...
ar: الكتل...
eo: Blokoj...

# menu: /File/Close
source: Close
ar: أغلق
eo: Fermi

# menu: /File/New Window
source: New Window
ar: نافذة جديدة
eo: Nova Fenestro

# menu: /File/Revert
source: Revert
ar: اعكس
eo: Malfari

# menu: /File/Quit
source: Quit
ar: أنهِ
eo: Forlasi

# menu: /Edit
source: Edit
ar: حرّر
eo: Redakti

# menu: /Edit/Undo
source: Undo
ar: تراجع
eo: Malfari

# menu: /Edit/Redo
source: Redo
ar: كرّر
eo: Refari

# menu: /Edit/Cut
source: Cut
ar: قصّ
eo: Tondi

# menu: /Edit/Copy
source: Copy
ar: انسخ
eo: Kopii

# menu: /Edit/Paste
source: Paste
ar: ألصق
eo: Alglui

# menu: /Edit/Crop
source: Crop
ar: اقتصّ
eo: Stuci

# menu: /Edit/Delete
source: Delete
ar: احذف
eo: Forigi

# menu: /Edit/Selection
source: Selection
ar: التحديد
eo: Elekto

# menu: /Edit/Selection/All
source: All
ar: الكلّ
eo: Ĉiuj

# menu: /Edit/Selection/Range
source: Range
ar: النطاق
eo: Gamo

# menu: /Edit/Selection/Visible Area
source: Visible Area
ar: المنطقة المرئية
eo: Videbla Areo

# menu: /Edit/Selection/Next
source: Next
ar: التالي
eo: Sekva

# menu: /Edit/Selection/Previous
source: Previous
ar: السابق
eo: Antaŭa

# menu: /Edit/Selection/Nothing
source: Nothing
ar: لا شيء
eo: Nenio

# menu: /Edit/Selection/To Start
source: To Start
ar: إلى البداية
eo: Al Komenco

# menu: /Edit/Selection/To End
source: To End
ar: إلى النهاية
eo: Al Fino

# menu: /Edit/Selection/Expand to Labels
source: Expand to Labels
ar: وسع التسمية
eo: Vastigi al Etikedoj

# menu: /Edit/Selection/To Next Labels
source: To Next Labels
ar: إلى التسمية التالية
eo: Al Sekvaj Etikedoj

# menu: /Edit/Selection/To Previous Labels
source: To Previous Labels
ar: إلى التسمية السابقة
eo: Al Antaŭaj Etikedoj

# menu: /Edit/Track/Add
source: Add
ar: أضف
eo: Aldoni

# menu: /Edit/Track
source: Track
ar: مسار
eo: Trako

# menu: /Edit/Track/Delete
source: Delete
ar: احذف
eo: Forigi

# menu: /Edit/Track/Select all
source: Select all
ar: حدّد الكلّ
eo: Elekti ĉiujn

# menu: /Edit/Track/Invert Selection
source: Invert Selection
ar: اعكس التّحديد
eo: Inverti Elekton

# menu: /Edit/Clipboard
source: Clipboard
ar: الحافظة
eo: Tondujo

# menu: /Edit/Clipboard/Flush
source: Flush
ar: أفرغ
eo: Elbufrigi

# menu: /Edit/Clipboard/Insert At...
source: Insert At...
ar: أدرج عند...
eo: Enmeti ĉe...

# menu: /Edit/File Properties...
source: File Properties...
ar: خصائص الملفّ...
eo: Dosieraj Proprecoj...

# menu: /View
source: View
ar: عرض
eo: Vido

# menu: /View/Go to Position...
source: Go to Position...
ar: ا&نتقل إلى موقع...
eo: Iri al Pozicio...

# menu: /View/Begin
source: Begin
ar: البداية
eo: Komenco

# menu: /View/End
source: End
ar: النهاية
eo: Fino

# menu: /View/Previous Page
source: Previous Page
ar: الصفحة السابقة
eo: Antaŭa Paĝo

# menu: /View/Next Page
source: Next Page
ar: الصفحة التالية
eo: Sekva Paĝo

# menu: /View/Scroll Right
source: Scroll Right
ar: مرر لليمين
eo: Rulumi Dekstren

# menu: /View/Scroll Left
source: Scroll Left
ar: مرر لليسار
eo: Rulumi Maldekstren

# menu: /View/Zoom In
source: Zoom In
ar: قرّب
eo: Zomi

# menu: /View/Zoom Out
source: Zoom Out
ar: بعّد
eo: Malzomi

# menu: /View/Zoom to Selection
source: Zoom to Selection
ar: كبّر للتحديد
eo: Zomi al Elekto

# menu: /View/Zoom to Whole Signal
source: Zoom to Whole Signal
ar: كبّر لكامل الإشارة
eo: Zomi al Tuta Signalo

# menu: /View/Zoom to 100%
source: Zoom to 100%
ar: قرّب إلى 100٪
eo: Zomi al 100%

# menu: /Play
source: Play
ar: شغّل
eo: Ludi

# menu: /Play/Previous
source: Previous
ar: السابق
eo: Antaŭa

# menu: /Play/Rewind
source: Rewind
ar: رجوع
eo: Rebobeni

# menu: /Play/Start
source: Start
ar: ابدأ
eo: Komenci

# menu: /Play/Loop
source: Loop
ar: حلقة
eo: Bukli

# menu: /Play/Pause
source: Pause
ar: ألبث
eo: Paŭzi

# menu: /Play/Continue
source: Continue
ar: تابع
eo: Daŭrigi

# menu: /Play/Stop
source: Stop
ar: أوقف
eo: Halti

# menu: /Play/Forward
source: Forward
ar: تقدّم
eo: Antaŭen

# menu: /Play/Next
source: Next
ar: التالي
eo: Sekva

# menu: /Record
source: Record
ar: سجّل
eo: Registri

# menu: /Record/Prepare...
source: Prepare...
ar: حضّر...
eo: Prepari...

# menu: /Record/Start Now!
source: Start Now!
ar: ابدأ الآن!
eo: Komenci Nun!

# menu: /Labels
source: Labels
ar: التسميات
eo: Etikedoj

# menu: /Labels/Add...
source: Add...
ar: أضف...
eo: Aldoni...

# menu: /Labels/Delete
source: Delete
ar: احذف
eo: Forigi

# menu: /Labels/Load...
source: Load...
ar: حمّل...
eo: Ŝargi...

# menu: /Labels/Save...
source: Save...
ar: احفظ...
eo: Konservi...

# menu: /Fx
source: Fx
ar: التأثيرات

# menu: /Fx/Volume
source: Volume
ar: الصوت
eo: Laŭteco

# menu: /Fx/Normalize
source: Normalize
ar: المساواة
eo: Normaligi

# menu: /Fx/Fade In
source: Fade In
ar: تلاشي للداخل
eo: Maldissolvi

# menu: /Fx/Fade Out
source: Fade Out
ar: تلاشي للخارج
eo: Dissolvi

# menu: /Fx/Amplify Free
source: Amplify Free
ar: تضخيم حر
eo: Amplifi Liberan

# menu: /Fx/Fade Intro
source: Fade Intro
ar: تتلاشى المقدمة
eo: Maldissolvi Enkondukon

# menu: /Fx/Fade Leadout
source: Fade Leadout
ar: تتلاشى الخاتمة
eo: Dissolvi Konkludon

# menu: /Fx/Low Pass
source: Low Pass
ar: منخفض التردد
eo: Malaltpasilo

# menu: /Fx/Notch Filter
source: Notch Filter
ar: مرشح الشق
eo: Noĉa Filtrilo

# menu: /Fx/Band Pass
source: Band Pass
ar: مرشح تمرير النطاق
eo: Bandpasilo

# menu: /Fx/Pitch Shift
source: Pitch Shift
ar: تغيير درجة الصوت
eo: Tonaltŝanĝo

# menu: /Fx/Reverse
source: Reverse
ar: اعكس
eo: Renversi

# menu: /Calculate
source: Calculate
ar: احسب
eo: Kalkuli

# menu: /Calculate/Silence
source: Silence
ar: الصمت
eo: Silento

# menu: /Calculate/Noise
source: Noise
ar: الضجيج
eo: Bruo

# menu: /Calculate/Sonagram
source: Sonagram
ar: السونوغرام
eo: Sonagramo

# menu: /Window
source: Window
ar: النافذة
eo: Fenestro

# menu: /Window/Next Window
source: Next Window
ar: النافذة التالية
eo: Sekva Fenestro

# menu: /Window/Previous Window
source: Previous Window
ar: النافذة السابقة
eo: Antaŭa Fenestro

# menu: /Window/Cascade Sub Windows
source: Cascade Sub Windows
ar: رتب النوافذ الفرعية بشكل متتالي
eo: Kaskadi Subfenestrojn

# menu: /Window/Tile Sub Windows
source: Tile Sub Windows
ar: رتب النوافذ الفرعية على شكل قطع
eo: Kaheli Subfenestrojn

# menu: /Window/Arrange Sub Windows Vertically
source: Arrange Sub Windows Vertically
ar: رتب النوافذ الفرعية رأسيًا
eo: Aranĝi Subfenestrojn Vertikale

# menu: /Settings
source: Settings
ar: إعدادات
eo: Agordoj

# menu: /Settings/Show Files in.../Separate Windows (SDI)
source: Separate Windows (SDI)
ar: نوافذ منفصلة (SDI)
eo: Apartaj Fenestroj (SDI)

# menu: /Settings/Show Files in...
source: Show Files in...
ar: اعرض الملفات في…
eo: Montri Dosierojn en...

# menu: /Settings/Show Files in.../Same Window (MDI)
source: Same Window (MDI)
ar: نفس النافذة (MDI)
eo: Sama Fenestro (MDI)

# menu: /Settings/Show Files in.../Tabs
source: Tabs
ar: الألسنة
eo: Langetoj

# menu: /Settings/Playback
source: Playback
ar: تشغيل
eo: Reproduktado

# menu: /Settings/Record
source: Record
ar: سجّل
eo: Registrado

# menu: /Settings/Record/Format
source: Format
ar: التنسيق
eo: Formato

# menu: /Settings/Record/Source
source: Source
ar: المصدر
eo: Fonto

# menu: /Settings/Reset Toolbar
source: Reset Toolbar
ar: صفّر شريط الأدوات
eo: Restarigi Ilobreton

# menu: /Settings/Re-enable all "Do not ask again" messages
source: Re-enable all "Do not ask again" messages
ar: أعد تمكين كل رسائل "لا تسأل مجددًا"
eo: Reŝalti ĉiujn mesaĝojn "Ne demandi denove".

# menu: /Help/Contents
source: Contents
ar: المحتويات
eo: Enhavo

# menu: /Help
source: Help
ar: مساعدة
eo: Helpo

# menu: /Help/About Kwave
source: About Kwave
ar: عن موجة
eo: Pri Kwave

# menu: /Help/About KDE
source: About KDE
ar: عن كِيدِي
eo: Pri KDE

source: Record
ar: سجّل
eo: Registri

source: Start playback
ar: ابدأ التشغيل
eo: Komenci reproduktadon

source: Stop playback or loop
ar: أوقف التشغيل أو الحلقة
eo: Ĉesi reproduktadon aŭ buklon

source: Start playback and loop
ar: ابدأ التشغيل أو الحلقة
eo: Komenci reproduktadon kaj buklon

source: Previous
ar: السابق
eo: Antaŭa

source: Rewind
ar: رجوع
eo: Rebobeni

source: Forward
ar: تقدّم
eo: Antaŭen

source: Next
ar: التالي
eo: Sekva

source: Continue playback
ar: تابع التشغيل
eo: Daŭrigi reproduktadon

source: Pause playback
ar: ألبث التّشغيل
eo: Paŭzi la reproduktadon

source: Loading main menu...
ar: يحمل القائمة الرئيسة…
eo: Ŝargante ĉefan menuon...

source: Initializing toolbar...
ar: يجهّز شريط الأدوات…
eo: Pravalorizante ilobreton...

source: Create a new empty file
ar: أنشئ ملفًا جديدًا فارغًا
eo: Krei novan malplenan dosieron

source: Open an existing file
ar: افتح ملفًا موجودًا
eo: Malfermi ekzistantan dosieron

source: Save the current file
ar: احفظ الملف الحالي
eo: Konservi la aktualan dosieron

source: Save the current file under a different name or file format...
ar: احفظ الملف الحالي باسم مختلف أو بصيغة ملف مختلفة…
eo: Konservi la aktualan dosieron sub malsama nomo aŭ dosierformato...

source: Close the current file
ar: أغلق الملف الحالي
eo: Fermi la aktualan dosieron

source: Undo
ar: تراجع
eo: Malfari

source: Redo
ar: كرّر
eo: Refari

source: Cut
ar: قصّ
eo: Tondi

source: Copy
ar: انسخ
eo: Kopii

source: Insert
ar: أدرج
eo: Enmeti

source: Mute selection
ar: اكتم التحديد
eo: Silentigi elekton

source: Delete selection
ar: امحُ المحدد
eo: Forigi elekton

source: Reset the toolbar to default settings?
ar: أتعيد تصفير ضبط شريط الأدوات إلى الإعدادات المبدئية؟
eo: Ĉu restarigi la ilobreton al defaŭltaj agordoj?

source: Re-enable all disabled notifications? All messages that you previously turned off by activating the "Do not ask again" checkbox will then be enabled again.
ar: أتعيد تمكين كل الإشعارات المعطّلة؟ ستُفعّل مجددًا كل الرسائل التي عطّلتها سابقًا بتفعيل خانة الاختيار "لا تسأل مجددًا".
eo: Reŝalti ĉiujn malŝaltitajn sciigojn? Ĉiuj mesaĝoj kiujn vi antaŭe malŝaltis per aktivigo de la markobutono "Ne demandi denove" tiam estos denove ebligitaj.

source: Executing command '%1'...
ar: ينفّذ الأمر '%1'…
eo: Plenumante komandon '%1'...

source: Executing Kwave script file '%1'...
ar: ينفّذ ملف سكربت موجة '%1'…
eo: Efektivigante Kwave-skriptodosieron '%1'...

source: Loading file '%1'...
ar: يحمل الملف '%1'…
eo: Ŝargante dosieron '%1'...

source: Out of memory
ar: نفذت الذّاكرة
eo: Sen memoro

# error message after opening a file failed
source: Unable to open '%1'
ar: تعذّر فتح الملفّ '%1'
eo: Ne eblas malfermi '%1'

# error message after opening a file failed
source: Invalid or unknown file type: '%1'
ar: نوع ملف غير صالح أو غير معروف: '%1'
eo: Nevalida aŭ nekonata dosiertipo: '%1'

source: Open
ar: افتح
eo: Malfermi

# Length, as in total duration of loaded song
source: Length: %1 (%2 samples)
ar: الطول: %1 (%2 عينة)
eo: Longo: %1 (%2 specimenoj)

source: Mode: %1 kHz @ %2 Bit
ar: الوضع: %1 كيلوهرتز @ %2 بت
eo: Reĝimo: %1 kHz @ %2 Bito

source: Selected: %1...%2 (%3 samples)
ar: المحدّد: %1...%2 (%3 عينة)
eo: Elektita: %1...%2 (%3 specimenoj)

source: Selected: %1...%2 (%3)
ar: محدّد: %1...%2 (%3)
eo: Elektita: %1...%2 (%3)

source: Position: %1
ar: الموقع: %1
eo: Pozicio: %1

# tooltip of the undo toolbar button if undo enabled
source: Undo (%1)
ar: تراجع (%1)
eo: Malfari (%1)

# tooltip of the undo toolbar button if undo disabled
source: Undo
ar: تراجع
eo: Malfari

# tooltip of the redo toolbar button, redo enabled
source: Redo (%1)
ar: كرّر (%1)
eo: Refari (%1)

# tooltip of the redo toolbar button, redo disabled
source: Redo
ar: كرّر
eo: Refari

# menu entry for undo if undo enabled
source: Undo (%1)
ar: تراجع (%1)
eo: Malfari (%1)

# menu entry for undo if undo disabled
source: Undo
ar: تراجع
eo: Malfari

# menu entry for redo if redo enabled
source: Redo (%1)
ar: كرّر (%1)
eo: Refari (%1)

# menu entry for redo if redo disabled
source: Redo
ar: كرّر
eo: Refari

# special entry in the list of labels to delete all
source: (All)
ar: (الكلّ)
eo: (Ĉiuj)

source: Zoom to selection
ar: كبر للتحديد
eo: Zomi al elekto

source: Zoom to 100%
ar: قرّب إلى 100٪
eo: Zomi al 100%

source: Zoom to all
ar: كبر للكل
eo: Zomi al ĉiuj

source: Select zoom factor
ar: حدد معامل التكبير
eo: Elekti zom-faktoron

source: %1 ms
ar: %1 م‌ث

source: %1 sec
ar: %1 ث
eo: %1 sek

source: %1 min
ar: %1 د

source: Interpolation
ar: استيفاء
eo: Interpolado

source: Transform
ar: حوّل
eo: Transformi

source: Flip horizontal
ar: اقلب أفقي
eo: Renversi horizontale

source: Flip vertical
ar: اقلب عمودي
eo: Renversi vertikale

source: Into first half
ar: إلى النصف الأول
eo: En la unuan duonon

source: Into second half
ar: إلى النصف الثاني
eo: En la duan duonon

source: Delete
ar: احذف
eo: Forigi

source: Fit In
ar: ناسب

source: Presets
ar: إعدادات مسبقة
eo: Antaŭagordoj

source: Save Preset
ar: احفظ إعداد مسبق
eo: Konservi Antaŭgordon

source: Currently Selected Point
ar: النقطة المحددة حاليًا
eo: Aktuale Elektitan Punkton

source: Every Second Point
ar: كل ثاني نقطة
eo: Ĉiun Duan Punkton

# Filter description for Kwave curve presets, for use in a FileDialog
source: Kwave curve preset (*.curve)
ar: إعداد مسبق لمنحى موجة (*.curve)
eo: Kwave-kurba antaŭdifino (*.curve)

source: Save Curve Preset
ar: احفظ الإعداد المسبق للمنحى
eo: Konservi Kurban Antaŭmeton

source: Applying '%1'...
ar: تطبيق'%1'...
eo: Aplikante '%1'...

source: h
ar: س

source: min
ar: دق

source: sec
ar: ث
eo: sek

# tooltip of a label, %1=index, %2=description/name
source: Label #%1 (%2)
ar: التسمية #%1 (%2)
eo: Etikedo #%1 (%2)

# tooltip of a label, without description, %1=index
source: Label #%1
ar: التسمية #%1
eo: Etikedo #%1

source: Label
ar: التسمية
eo: Etikedo

source: New
ar: جديد
eo: Nova

source: &Delete
ar: ا&حذف
eo: &Forigi

source: &Properties...
ar: &خصائص...
eo: &Proprecoj...

source: Move Label
ar: انقل التسمية
eo: Movi Etikedon

source: Label Properties...
ar: خصائص التسمية...
eo: Etikedaj Propraĵoj...

source: <b>label position:</b><br> Here you can set the position of the label, either by time, by percentage of the whole file or by an absolute sample position. However, internally Kwave always uses the position in samples.
ar: <b>موضع التسمية:</b><br> هنا يمكنك ضبط موضع التسمية، إما حسب الوقت، أو بالنسبة المئوية للملف بأكمله، أو بوضع عينة مطلق. ومع ذلك، يستخدم برنامج موجة داخليًا الموضع بالعينات دائمًا.
eo: <b>pozicio de la etikedo:</b><br> Ĉi tie vi povas agordi la pozicion de la etikedo, aŭ laŭ tempo, laŭ procento de la tuta dosiero aŭ laŭ absoluta specimena pozicio. Tamen interne Kwave ĉiam uzas la pozicion en specimenoj.

source: Description:
ar: الوصف:
eo: Priskribo:

source: some description of the label (optional)
ar: اكتب وصف للتسمية (اختياري)
eo: iu priskribo de la etikedo (laŭvola)

source: <b>label description:</b><br> Here you can enter some short text to describe the label.
ar: <b>وصف التسمية:</b><br> هنا يمكنك إدخال بعض النصوص القصيرة لوصف التسمية.
eo: <b>priskribo de la etikedo:</b><br> Ĉi tie vi povas enigi iom da mallonga teksto por priskribi la etikedon.

source: Position:
ar: الموضع:
eo: Pozicio:

source: Index:
ar: المؤشر:
eo: Indekso:

source: index of the label
ar: فهرس التسمية
eo: indekso de la etikedo

source: <b>label index</b><br> This is just a numeric index of the label, starting with zero, sorted by position. Lower index means 'left', higher index means 'right'. You cannot change the index itself, but change the label's position.
ar: <b>فهرس التسمية</b><br> هذا مجرد فهرس رقمي للتسمية، يبدأ من الصفر، ومرتب حسب الموضع. الفهرس الأقل يعني 'يسار'، والفهرس الأعلى يعني 'يمين'. لا يمكنك تغيير الفهرس نفسه، ولكن يمكنك تغيير موضع التسمية.
eo: <b>indekso de etikedo</b><br> Ĉi tio estas nur nombra indekso de la etikedo, komencante per nulo, ordigita laŭ pozicio. Malsupra indekso signifas 'maldekstre', pli alta indekso signifas 'dekstra'. Vi ne povas ŝanĝi la indekson mem, sed ŝanĝi la pozicion de la etikedo.

source: Selection, left border
ar: التحديد، الحد الأيسر
eo: Elekto, maldekstra bordo

source: Selection, right border
ar: التحديد، الحد الأيمن
eo: Elekto, dekstra bordo

source: Drag and Drop
ar: سحب وإفلات
eo: Treni kaj Faligi

source: frmLength
ar: الطول

source: Length
ar: الطول
eo: Longo

source: select by number of samples
ar: حدد بعدد العينات
eo: elekti laŭ nombro da specimenoj

source: &Samples
ar: &عينات
eo: &Specimenoj

source: select by time
ar: حدد بالوقت
eo: elekti laŭ tempo

source: &Time
ar: الو&قت
eo: &Tempo

source: select by percentage of the signal's length
ar: حدد بالنسبة المئوية لطول الإشارة
eo: elekti laŭ procento de la longo de la signalo

source: &Percent
ar: &نسبة مئوية
eo: &Procento

source: Minutes
ar: دقائق
eo: Minutoj

source: Milliseconds
ar: ملي ثانية
eo: Milisekundoj

source: Seconds
ar: ثوان
eo: Sekundoj

source: Hours
ar: ساعات
eo: Horoj

source: sets the selection by the percentage of the whole signal
ar: يضبط التحديد بالنسبة المئوية للإشارة بأكملها
eo: fiksas la elekton per la procento de la tuta signalo

source: &Undo
ar: ت&راجع
eo: &Malfari

source: &Redo
ar: أ&عِد
eo: &Refari

source: Cu&t
ar: ق&صّ
eo: &Tondi

source: &Copy
ar: ا&نسخ
eo: &Kopii

source: &Paste
ar: أ&لصق
eo: &Alglui

source: Selection
ar: التحديد
eo: Elekto

source: &Save...
ar: ا&حفظ...
eo: Kon&servi...

source: &Expand to Labels
ar: &وسع التسمية
eo: Vastigi al &Etikedoj
