Repository: KDE/kwave
Catalog: po/*/kwave.po
Languages: ar, eo

source: <b>chopper frequency</b><br>This setting determines how small the pieces of audio data are before they get processed by the pitch shift. If your audio data sounds interrupted, you might get better result with higher values.
ar: <b>تردد المقطّع</b><br>يحدد هذا الإعداد مدى صغر قطع بيانات الصوت قبل معالجتها بواسطة تغيير درجة الصوت. إذا بدت بيانات الصوت متقطعة، فقد تحصل على نتيجة أفضل بقيم أعلى.
eo: <b>haktilfrekvenco</b><br>Ĉi tiu agordo determinas kiom malgrandaj estas la aŭdaj datumoj antaŭ ol ili estas procesitaj de la tonalto. Se viaj sonaj datumoj sonas interrompitaj, vi eble ricevos pli bonan rezulton kun pli altaj valoroj.

source: Speed:
ar: السرعة:
eo: Rapido:

source: Speed
ar: السرعة
eo: Rapido

source: change speed by percentage
ar: تغيير السرعة بالنسبة المئوية
eo: ŝanĝi rapidecon je procento

source: Sets the speed to a relative percentage of the original speed. For example: "50 %", "75%" or "125%"
ar: يضبط السرعة إلى نسبة مئوية نسبية من السرعة الأصلية. على سبيل المثال: "50%"، "75%" أو "125%"
eo: Agordas la rapidon al relativa procento de la origina rapido. Ekzemple: "50 %", "75%" aŭ "125%"

source: by Percentage
ar: باستخدام النسبة المئوية
eo: per Procento

source: change speed by a factor
ar: تغيير السرعة بعامل
eo: ŝanĝi rapidecon je faktoro

source: Increments or decrements the speed by a factor. For example: "x1", "x2", "/ 4"
ar: يزيد أو ينقص السرعة بعامل. على سبيل المثال: "x1"، "x2"، "/ 4"
eo: Pliigas aŭ malpliigas la rapidon je faktoro. Ekzemple: "x1", "x2", "/ 4"

source: by Factor
ar: باستخدام العامل
eo: per Faktoro

source: Default device
ar: الجهاز المبدئي
eo: Defaŭlta aparato

source: Null device
ar: جهاز Null
eo: Nula aparato

source: I/O error. Maybe the driver is not present in your kernel or it is not properly configured.
ar: خطأ I/O. ربما برنامج التشغيل غير موجود في نواة نظامك أو أنه غير مكون بشكل صحيح.
eo: I/O-eraro. Eble la pelilo estas en via kerno aŭ ĝi ne estas ĝuste agordita.

source: The device is busy. Maybe some other application is currently using it. Please try again later. (Hint: you might find out the name and process ID of the program by calling: "fuser -v %1" on the command line.)
ar: الجهاز مشغول. ربما تطبيق آخر يستخدمه حاليًا. يرجى المحاولة مرة أخرى لاحقًا. (تلميح: يمكنك معرفة اسم ومعرف عملية البرنامج عن طريق استدعاء: "fuser -v %1" في سطر الأوامر.)
eo: La aparato estas okupata. Eble iu alia aplikaĵo nuntempe uzas ĝin. Bonvolu reprovi poste. (Konsilo: vi eble trovos la nomon kaj procezidentigilon de la programo per voko: "fuser -v %1" e la komandlinio.)

source: Opening the device '%1' failed: %2
ar: فشل فتح الجهاز '%1': %2
eo: Malfermo de la aparato '%1' malsukcesis: %2

source: Card %1:
ar: بطاقة %1:
eo: Karto %1:

source: Device %1:
ar: جهاز %1:
eo: Aparato %1:

source: Subdevice %1:
ar: جهاز فرعي %1:
eo: Subaparato %1:

source: DMIX plugin
ar: الملحقة DMIX
eo: DMIX kromaĵo

source: The device '%1' cannot be opened in the correct mode.
ar: لا يمكن فتح الجهاز '%1' في الوضع الصحيح.
eo: La aparato '%1' ne povas esti malfermita en la ĝusta reĝimo.

source: %1 bits per sample are not supported
ar: %1 بت لكل عينة غير متوفر
eo: %1 bitoj per specimeno ne estas subtenataj

source: %1 channels playback is not supported
ar: تشغيل %1 قنوات غير مدعوم
eo: La reproduktado de %1 kanaloj ne estas subtenata

source: Playback rate %1 Hz is not supported
ar: معدل التشغيل %1 هرتز غير مدعوم
eo: Reprodukta indico %1 Hz ne estas subtenata

source: Unusable buffer size: %1
ar: حجم المخزن المؤقت غير صالح: %1
eo: Neuzebla bufrograndeco: %1

source: OSS playback device (dsp*)
ar: جهاز تشغيل OSS (dsp*)
eo: OSS-reprodukta aparato (dsp*)

source: ALSA playback device (adsp*)
ar: جهاز تشغيل ALSA (adsp*)
eo: ALSA-reprodukta aparato (adsp*)

source: Any device (*)
ar: أي جهاز (*)
eo: Ajna aparato (*)

source: %1 channels are not supported, maximum is 255
ar: %1 قناة غير مدعومة، الحد الأقصى هو 255
eo: %1 kanaloj ne estas subtenataj, maksimumo estas 255

source: Connecting to the PulseAudio server failed.
ar: فشل الاتصال بخادم PulseAudio.
eo: Konekto al la PulseAudio-servilo malsukcesis.

source: The PulseAudio device '%1' is unknown or no longer connected
ar: جهاز PulseAudio '%1' غير معروف أو لم يعد متصلاً
eo: La PulseAudio-aparato '%1' estas nekonata aŭ ne plu konektita

source: playback...
ar: تشغيل...
eo: reproduktado...

source: Failed to create a PulseAudio stream (%1).
ar: فشل إنشاء دفق PulseAudio (%1).
eo: Malsukcesis krei PulseAudio-fluon (%1).

source: Failed to open a PulseAudio stream for playback (%1).
ar: فشل فتح دفق PulseAudio للتشغيل (%1).
eo: Malsukcesis malfermi PulseAudio-fluon por reproduktado (%1).

source: (Use server default)
ar: (استخدم الإعداد المبدئي للخادم)
eo: (Uzi servilan defaŭlton)

source: The audio device '%1' is unknown or no longer connected
ar: جهاز الصوت '%1' غير معروف أو لم يعد متصلاً
eo: La sona aparato '%1' estas nekonata aŭ ne plu konektita

source: format not supported
ar: التنسيق غير متاح
eo: formato ne subtenata

source: Opening the Qt Multimedia device '%1' failed
ar: فشل فتح جهاز Qt Multimedia '%1'
eo: Malfermo de la Qt Multimedia aparato '%1' malsukcesis

source: %1 Bytes
ar: %1 بايت
eo: %1 bajtoj

source: %1 kB
ar: %1 ك.بايت

source: (mono)
ar: (أحادي)

source: (stereo)
ar: (مجسمي)

source: (quadro)
ar: (رباعي)
eo: (kvadro)

source: Select Playback Device
ar: اختر جهاز التشغيل
eo: Elekti Reproduktan aparaton

source: Playback
ar: التشغيل
eo: Reproduktado

source: Playback Settings
ar: إعدادات التشغيل
eo: Agordoj de reprodukto

source: Playback device
ar: جهاز التشغيل
eo: Reprodukta aparato

source: <b>Device:</b><p>This list shows a selection of some known playback devices suitable for the chosen playback method. If your device is not listed here, you can enter a device name on your own or search through the filesystem.</p>
ar: <b>الجهاز:</b><p>تعرض هذه القائمة مجموعة من أجهزة التشغيل المعروفة المناسبة لطريقة التشغيل المختارة. إذا لم يكن جهازك مدرجًا هنا، يمكنك إدخال اسم جهاز بشكل مستقل أو البحث في نظام الملفات.</p>
eo: <b>Aparato:</b><p>Ĉi tiu listo montras elekton de kelkaj konataj reproduktaparatoj taŭgaj por la elektita reprodukta metodo. Se via aparato ne estas listigita ĉi tie, vi povas memstare enigi aparaton aŭ serĉi tra la dosiersistemo.</p>

source: Search on the filesystem for a device
ar: ابحث في نظام الملفات عن جهاز
eo: Serĉi en la dosiersistemo aparaton

source: <b>Select...</b><p>Choose a device name on the harddisk, if your device is not already listed in the list of devices.</p>
ar: <b>اختر...</b><p>اختر اسم جهاز على القرص الصلب، إذا لم يكن جهازك مدرجًا أصلاً في قائمة الأجهزة.</p>
eo: <b>Elekti...</b><p>Elektu aparaton nomon sur la malmola disko, se via aparato ne estas jam listigita en la listo de aparatoj.</p>

source: Method or system used for playback
ar: الطريقة أو النظام المستخدم للتشغيل
eo: Metodo aŭ sistemo uzata por reproduktado

source: <b>Playback Method:</b><p>Choose a method or system used for playback. Depending on the compilation options you can select one of the following methods:</p> <p><b><i>OSS (Open Sound System)</i></b>: The oldest linux implementation, capable of mono and stereo output. Deprecated since linux kernel 2.6, but still wide spread. Might collide with PulseAudio or other sound applications, only one application at a time can use OSS playback !</p> <p><b><i>ALSA (Advanced Linux Sound Architecture)</i></b>: Supercedes OSS, supports more features and more hardware. Might collide with other applications like OSS does, but has a plugin called <i>dmix</i> as a way out.</p> <p><b><i>PulseAudio</i></b>: The preferred way of doing playback in KDE. Multiple applications can play at the same time.</p>
ar: <b>طريقة التشغيل:</b><p>اختر طريقة أو نظامًا مستخدمًا للتشغيل. اعتمادًا على خيارات التجميع، يمكنك اختيار إحدى الطرق التالية:</p> <p><b><i>OSS (نظام الصوت المفتوح)</i></b>: أقدم تنفيذ لنظام لينكس، قادر على إخراج أحادي ومجسم. أصبح قديمًا منذ نواة لينكس 2.6، لكنه لا يزال منتشرًا على نطاق واسع. قد يتعارض مع PulseAudio أو تطبيقات الصوت الأخرى، فقط تطبيق واحد في كل مرة يمكنه استخدام تشغيل OSS!</p> <p><b><i>ALSA (هندسة الصوت المتقدمة لنظام لينكس)</i></b>: يحل محل OSS، يدعم ميزات أكثر وأجهزة أكثر. قد يتعارض مع التطبيقات الأخرى مثل OSS، لكن لديه ملحق يسمى <i>dmix</i> كحل.</p> <p><b><i>PulseAudio</i></b>: الطريقة المفضلة لإجراء التشغيل في كيدي. يمكن للتطبيقات المتعددة التشغيل في نفس الوقت.</p>
eo: <b>Reprodukta Metodo:</b><p>Elektu metodon aŭ sistemon uzatan por ludado. Depende de la kompilopcioj vi povas elekti unu el la jenaj metodoj:</p> <p><b><i>OSS (Malferma Sonsistemo)</i></b>: La plej malnova Linuksa efektivigo, kapabla de mono kaj stereo eligo. Malrekomendita ekde linuksa kerno 2.6, sed ankoraŭ vaste disvastigita. Eble kolizii kun PulseAudio aŭ aliaj sonaplikoj, nur unu aplikaĵo samtempe povas uzi OSS-reproduktadon !</p> <p><b><i>ALSA (Altnivela Linuksa Sona Arkitekturo)</i></b> : Anstataŭas OSS, subtenas pli da funkcioj kaj pli da aparataro. Eble kolizias kun aliaj aplikaĵoj kiel faras OSS, sed havas kromprogramon nomitan <i>dmix</i> kiel elirejo.</p> <p><b><i>PulseAudio</i></b>: La preferata maniero fari reproduktadon en KDE. Multoblaj aplikaĵoj povas ludi samtempe.</p>

source: Playback method:
ar: طريقة التشغيل:
eo: Reprodukta metodo:

source: Device:
ar: الجهاز:
eo: Aparato:

source: 256 Bytes
ar: 256 بايت
eo: 256 bajtoj

source: Size of the playback buffer in bytes
ar: حجم مخزن التشغيل المؤقت بالبايت
eo: Grandeco de la reprodukta bufro en bajtoj

source: <b>Buffer size:</b><p>Select a buffer size for the playback. You should set this number as small as possible to reduce the playback latency. The latency is the delay between user interface actions like starting/stopping playback, update of the playback position and the real sound output. If you encounter dropouts you should increase this setting a bit.</p>
ar: <b>حجم المخزن المؤقت:</b><p>اختر حجم مخزن مؤقت للتشغيل. يجب عليك تعيين هذا الرقم صغيرًا قدر الإمكان لتقليل زمن التأخير في التشغيل. زمن التأخير هو الفاصل بين إجراءات واجهة المستخدم مثل بدء/إيقاف التشغيل، تحديث موضع التشغيل وإخراج الصوت الفعلي. إذا واجهت انقطاعات، يجب عليك زيادة هذا الإعداد قليلاً.</p>
eo: <b>Bufrgrando:</b><p>Elektu bufrograndon por la reproduktado. Vi devus agordi ĉi tiun nombron kiel eble plej malgrandan por redukti la latentecon de reprodukto. La latenteco estas la prokrasto inter uzantinterfacaj agoj kiel komenci/ĉesigi la reproduktadon, ĝisdatigon de la reprodukta pozicio kaj la reala sonproduktado. Se vi renkontas forlasojn, vi devus iomete pliigi ĉi tiun agordon.</p>

source: Buffer size:
ar: حجم المخزن المؤقت:
eo: Bufrgrandeco:

source: Bits per sample:
ar: عدد البت في العينة:
eo: Bitoj per specimeno:

source: Playback resolution in bits per sample
ar: دقة التشغيل بعدد البتات في العينة
eo: Reprodukta distingivo en bitoj po specimeno

source: <b>Bits per sample:</b><p>Here you can select one of the bit resolutions your playback device supports. This is not necessarily the same resolution as in your audio file, Kwave dithers automatically from its internal resolution (24 bit) to the setting you specify. Higher resolutions mean better audio quality.</p>
ar: <b>البتات في العينة:</b><p>هنا يمكنك اختيار إحدى دقات البت التي يدعمها جهاز التشغيل الخاص بك. ليس بالضرورة أن تكون نفس الدقة الموجودة في ملفك الصوتي، حيث يقوم موجة آليًا بالتهدئة من دقته الداخلية (24 بت) إلى الإعداد الذي تحدده. الدقات الأعلى تعني جودة صوت أفضل.</p>
eo: <b>Bitoj per specimeno:</b><p>Ĉi tie vi povas elekti unu el la bitaj distingivoj, kiujn via reprodukta aparato subtenas. Ĉi tio ne nepre estas la sama distingivo kiel en via sondosiero, Kwave disiĝas aŭtomate de sia interna distingivo (24 bitoj) al la agordo, kiun vi specifis. Pli altaj distingivoj signifas pli bonan sonkvaliton.</p>

source: Number of channels: mono, stereo...
ar: عدد القنوات: أحادي، مجسم...
eo: Nombro da kanaloj: mono, stereo...

source: <b>Channels:</b><p>Number of channels used for playback. This does not necessarily have to be the same as the number of tracks in your current file. Kwave automatically mixes the tracks of your file to the channels you specify here. </p><p><i>For example:</i> If you have three tracks and set the playback to "stereo", the left channel will contain the first track + 50% of the second track, the right channel will also contain 50% of the second track and the third track.</p>
ar: <b>القنوات:</b><p>عدد القنوات المستخدمة للتشغيل.ليس بالضرورة أن يكون مطابقًا لعدد المسارات في ملفك الحالي. يقوم موجة آليًا بدمج مسارات ملفك إلى القنوات التي تحددها هنا. </p><p><i>على سبيل المثال:</i> إذا كان لديك ثلاثة مسارات وضبطت التشغيل على "مجسمي"، فستحتوي القناة اليسرى على المسار الأول + 50% من المسار الثاني، وستحتوي القناة اليمنى أيضًا على 50% من المسار الثاني والمسار الثالث.</p>
eo: <b>Kanaloj:</b><p>Nombro de kanaloj uzataj por reproduktado. Ĉi tio ne nepre devas esti la sama kiel la nombro da trakoj en via nuna dosiero. Kwave aŭtomate miksas la spurojn de via dosiero al la kanaloj, kiujn vi specifas ĉi tie. </p><p><i>Ekzemple:</i> Se vi havas tri trakojn kaj agordas la reproduktadon al "stereo", la maldekstra kanalo enhavos la unuan trakon + 50% de la dua trako, la dekstra kanalo ankaŭ enhavos 50% de la dua trako kaj la tria trako.</p>

source: Play a short test sound
ar: شغل صوت اختبار قصير
eo: Ludi mallongan testsonon

source: <b>Test</b><p>Try to play a short sound using the current settings.</p><p><i>(Sorry, not implemented yet!)</i></p>
ar: <b>اختبار</b><p>حاول تشغيل صوت قصير باستخدام الإعدادات الحالية.</p><p><i>(آسف، لم توفر بعد!)</i></p>
eo: <b>Provo</b><p>Provi ludi mallongan sonon uzante la nunajn agordojn.</p><p><i>(Pardonu, ankoraŭ ne efektivigita!)</i></p>

source: &Test...
ar: ا&ختبر...
eo: &Provo...

source: Please select a playback device first
ar: يرجى اختيار جهاز تشغيل أولاً
eo: Bonvolu unue elekti reproduktan aparaton

source: Playback Test
ar: اختبار التشغيل
eo: Reprodukta Testo

source: You should now hear a %1 Hz test tone.<br/><br/>(If you hear clicks or dropouts, please increase<br/>the buffer size and try again)
ar: يجب أن تسمع الآن نغمة اختبارية ترددها %1 هرتز.<br/><br/>(إذا سمعت نقرات أو انقطاعات، يرجى زيادة<br/>حجم المخزن المؤقتة والمحاولة مرة أخرى)
eo: Vi nun devus aŭdi %1 Hz-testan tonon.<br/><br/>(Se vi aŭdas klakojn aŭ forlasojn, bonvolu pliigi<br/>la bufrograndecon kaj provi denove)

source: %1 dB
ar: %1 دسب

source: DSNOOP plugin
ar: ملحقة DSNOOP
eo: DSNOOP kromaĵo

source: OSS recording device (audio*)
ar: جهاز تسجيل OSS (audio*)
eo: OSS registra aparato (aŭdio*)

source: OSS recording device (dsp*)
ar: جهاز تسجيل OSS (dsp*)
eo: OSS registra aparato (dsp*)

source: ALSA recording device (adsp*)
ar: جهاز تسجيل ALSA (adsp*)
eo: ALSA registra aparato (adsp*)

source: Kwave record
ar: تسجيل موجة
eo: Kwave-registrilo

source: &Done
ar: &تمّ
eo: &Farita

source: OSS record device (dsp*)
ar: جهاز تسجيل OSS (dsp*)
eo: OSS registra aparato (dsp*)

source: ALSA record device (adsp*)
ar: جهاز تسجيل ALSA (adsp*)
eo: ALSA registra aparato (adsp*)

source: Select Record Device
ar: اختر جهاز التسجيل
eo: Elekti Registran Aparaton

source: Mono
ar: أحادي

source: Stereo
ar: مجسمي

source: Quadro
ar: رباعي

source: %1 tracks
ar: %1 مسار(ات)
eo: %1 trakoj

source: %1 Hz
ar: %1 هرتز

source: %1 bit
ar: %1 بت
eo: %1 bito

source: Please check the source device settings...
ar: يرجى التحقق من إعدادات الجهاز المصدر...
eo: Bonvolu kontroli la agordojn de la fontaparato...

source: (empty)
ar: (فارغة)
eo: (malplena)

source: Buffering...
ar: جارٍ التخزين المؤقت...
eo: Bufrante...

source: Prerecording...
ar: تسجيل مسبق...
eo: Antaŭregistrante...

source: Waiting for trigger...
ar: في انتظار المشغل...
eo: Atendante la ekigilon...

source: Recording...
ar: يسجّل...
eo: Registrante...

source: Paused
ar: ملبثة
eo: Paŭzita

source: Done
ar: تمّ
eo: Farita

source: one day
ar: أقل عن يوم
eo: unu tago

source: one hour
ar: أقل عن ساعة
eo: unu horo

source: one minute
ar: أقل عن دقيقة
eo: unu minuto

source: %1 second
ar: ثانية
eo: %1 sekundo

# %1=days; %2=hours; %3=minutes; %4=seconds
source: Waiting for start in %1%2%3%4...
ar: في انتظار البدء خلال %1%2%3%4...
eo: Atendante komencon en %1%2%3%4...

source: Length: %1
ar: الطول: %1
eo: Longo: %1

source: (%1 samples)
ar: (%1 عينات)
eo: (%1 specimenoj)

source: Recording
ar: يسجّل
eo: Registrado

source: Record Control
ar: تحكم التسجيل
eo: Rego de Registrado

source: Enable Pre-recording
ar: مكّن التسجيل المسبق
eo: Ebligi Antaŭregistradon

source: When using <b>Pre-recording</b>, Kwave internally already records before the real recording starts. This feature is useful if you want to start recording already a few seconds before you press the record button. <i>(For example when recording from radio)</i>
ar: عند استخدام <b>التسجيل المسبق</b>، يقوم موجة داخليًا بالتسجيل بالفعل قبل بدء التسجيل الفعلي. هذه الميزة مفيدة إذا كنت تريد بدء التسجيل قبل بضع ثوانٍ من الضغط على زر التسجيل. <i>(على سبيل المثال عند التسجيل من الراديو)</i>
eo: Kiam oni uzas <b>Antaŭregistradon</b>, Kwave interne jam registras antaŭ ol la vera registrado komenciĝas. Ĉi tiu funkcio estas utila se vi volas komenci registri jam kelkajn sekundojn antaŭ ol vi premas la butonon de registrado. <i>(Ekzemple dum registrado de radio)</i>

source: Pre-record:
ar: تسجيل مسبق:
eo: Antaŭregistro:

source: Limit the recording time
ar: حدد وقت التسجيل
eo: Limigi la registran tempon

source: If checked, the <b>Record time</b> is limited and recording will automatically stop when the selected time is reached.
ar: إذا حددته، فإن <b>وقت التسجيل</b> محدود وسيتوقف التسجيل آليًا عند الوصول إلى الوقت المحدد.
eo: Se markite, la <b>Registra tempo</b> estas limigita kaj registrado aŭtomate ĉesos kiam la elektita tempo estas atingita.

source: Record &time:
ar: وقت الت&سجيل:
eo: Registra &tempo:

source: Trigger level
ar: مستوى المشغل
eo: Nivelo de ekigilo

source: If the <b>Record trigger</b> is enabled, recording will start as soon as the volume of the input signal goes over the selected level.
ar: إذا مُكّن <b>مشغل التسجيل</b>، سيبدأ التسجيل بمجرد تجاوز حجم إشارة الإدخال للمستوى المحدد.
eo: Se la <b>Registrado-eksigilo</b> estas ebligita, registrado komenciĝos tuj kiam la laŭteco de la eniga signalo superos la elektitan nivelon.

source: Record trigger:
ar: مشغل التسجيل:
eo: Registra ekigilo:

source: Stop Recording
ar: إيقاف التسجيل
eo: Ĉesi Registradon

source: Pause/Continue
ar: ألبث/تابع
eo: Paŭzi/Daŭrigi

source: s
ar: ث

source: Start at a given date and time
ar: ابدأ في تاريخ ووقت محددين
eo: Komenci je difinita dato kaj horo

source: When checked, the recording will be started at the given date and time. Please note that if the time is in the past, the recording will be started immediately or as soon as the defined trigger level is reached (if enabled).
ar: عند التحديد، سيبدأ التسجيل في التاريخ والوقت المحددين. يرجى ملاحظة أنه إذا كان الوقت في الماضي، فسيبدأ التسجيل فورًا أو بمجرد الوصول إلى مستوى المشغل المحدد (إذا كان ممكّنًا).
eo: Kiam ĝi estas markita, la registrado komenciĝos je la donita dato kaj horo. Bonvolu noti, ke se la tempo estas en la pasinteco, la registrado komenciĝos tuj aŭ tuj kiam la difinita ellasilnivelo estos atingita (se ebligita).

source: Start &at:
ar: ابدأ &من:
eo: Komenci &je:

source: Level
ar: المستوى
eo: Nivelo

source: Amplify:
ar: التضخيم:
eo: Plifortigi:

source: dB
ar: دسب

source: ms
ar: مث

source: Fading
ar: تلاش
eo: Forvelkanta

source: For&mat
ar: ال&تنسيق
eo: For&mato

source: <b>Sample rate</b><br>Here you can select one of the predefined well-known sample rates that your sound card supports.
ar: <b>معدل العينة</b><br>هنا يمكنك اختيار أحد معدلات العينة المعرفة مسبقًا والمعروفة التي تدعمها بطاقة الصوت الخاصة بك.
eo: <b>Specimeniga frekvenco</b><br>Ĉi tie vi povas elekti unu el la antaŭdifinitaj konataj specimenofrekvencoj kiujn via sonkarto subtenas.

source: <b>Number of channels</b><br>Select a number of channels, e.g. for mono or stereo recording.
ar: <b>عدد القنوات</b><br>اختر عددًا من القنوات، على سبيل المثال للتسجيل الأحادي أو المجسم.
eo: <b>Nombro da kanaloj</b><br>Elektu kelkajn kanalojn, ekz. por mono aŭ stereoregistrado.

source: Compression:
ar: الضغط:
eo: Kunpremo:

source: <b>Compression</b><br>Here you can select one of the compression types if your audio hardware supports it.
ar: <b>الضغط</b><br>هنا يمكنك اختيار أحد أنواع الضغط إذا كان جهاز الصوت الخاص بك يدعمه.
eo: <b>Kunpremado</b><br>Ĉi tie vi povas elekti unu el la kunpremadtipoj se via sona aparataro subtenas ĝin.

source: <b>Sample format</b><br>Here you can select one of the sample formats that your audio hardware supports. This normally has no big influence on the result, so you can just leave it as it is.
ar: <b>تنسيق العينة</b><br>هنا يمكنك اختيار أحد تنسيقات العينات التي يدعمها جهاز الصوت الخاص بك. عادة لا يكون لهذا تأثير كبير على النتيجة، لذا يمكنك تركه كما هو.
eo: <b>Ekzempla formato</b><br>Ĉi tie vi povas elekti unu el la ekzemplaj formatoj kiujn via sona aparataro subtenas. Ĉi tio kutime ne havas grandan influon sur la rezulto, do vi povas simple lasi ĝin kiel ĝi estas.

source: Sample format:
ar: تنسيق العينة:
eo: Ekzempla formato:

source: <b>Resolution</b><br>Select a resolution in bits in which the file will be recorded. Higher values give better quality but also more system load.
ar: <b>الدقة</b><br>اختر دقة بالبتات سيُسجل بها الملف. القيم الأعلى تعطي جودة أفضل ولكنها تزيد أيضًا من حمل النظام.
eo: <b>Distingivo</b><br>Elektu distingivon en bitoj en kiu la dosiero estos registrita. Pli altaj valoroj donas pli bonan kvaliton sed ankaŭ pli da sistema ŝarĝo.

source: Buffer count:
ar: عدد الذاكرة المؤقتة:
eo: Buffernombro:

source: Method or system used for recording
ar: الطريقة أو النظام المستخدم للتسجيل
eo: Metodo aŭ sistemo uzata por registri

source: <b>Recording method:</b><p>Choose a method or system used for recording. Depending on the compilation options you can select one of the following methods:</p> <p><b><i>OSS (Open Sound System)</i></b>: The oldest linux implementation, only capable of mono and stereo input. Deprecated since linux kernel 2.6, but still wide spread.</p> <p><b><i>ALSA (Advanced Linux Sound Architecture)</i></b>: Supercedes OSS, supports more features and more hardware.</p>
ar: <b>طريقة التسجيل:</b><p>اختر طريقة أو نظامًا مستخدمًا للتسجيل. اعتمادًا على خيارات الترجمة، يمكنك اختيار إحدى الطرق التالية:</p> <p><b><i>OSS (نظام الصوت المفتوح)</i></b>: أقدم تنفيذ لنظام لينكس، يدخل فقط بشكل أحادي مجسم. أصبح قديمًا منذ نواة لينكس 2.6، لكنه لا يزال منتشرًا على نطاق واسع.</p> <p><b><i>ALSA (هندسة الصوت المتقدمة لنظام لينكس)</i></b>: يحل محل OSS، ويدعم المزيد من الميزات والمزيد من الأجهزة.</p>
eo: <b>Registra metodo:</b><p>Elektu metodon aŭ sistemon uzatan por registrado. Depende de la kompilopcioj vi povas elekti unu el la sekvaj metodoj:</p> <p><b><i>OSS (Malferma Sonsistemo)</i></b>: La plej malnova Linuksa efektivigo, nur kapabla je mono kaj stereo enigo. Malrekomendita ekde linuksa kerno 2.6, sed ankoraŭ vaste disvastigita.</p> <p><b><i>ALSA (Altnivela Linuksa Son-Arkitekturo)</i></b>: Anstataŭigas OSS, subtenas pli da funkcioj kaj pli aparataro.</p>

source: Recording method:
ar: طريقة التسجيل:
eo: Registra metodo:

source: Recording device
ar: جهاز التسجيل
eo: Registra aparato

source: <b>Device:</b><p>This list shows a selection of some known recording devices suitable for the chosen recording method. If your device is not listed here, you can enter a device name on your own or search through the filesystem.</p>
ar: <b>الجهاز:</b><p>تعرض هذه القائمة مجموعة من أجهزة التسجيل المعروفة المناسبة لطريقة التسجيل المختارة. إذا لم يكن جهازك مدرجًا هنا، يمكنك إدخال اسم جهاز بشكل مستقل أو البحث في نظام الملفات.</p>
eo: <b>Aparato:</b><p>Ĉi tiu listo montras elekton de kelkaj konataj registraj aparatoj taŭgaj por la elektita registra metodo. Se via aparato ne estas listigita ĉi tie, vi povas memstare enigi aparaton aŭ serĉi tra la dosiersistemo.</p>

source: Selec&t...
ar: ا&ختر...
eo: Elek&ti...

source: Device
ar: الجهاز
eo: Aparato
