Repository: KDE/kwave
Catalog: po/*/kwave.po
Languages: ar, eo

source: Surround bitrate would be less than 32kBit/sec per channel, this file should be mixed down to mono.
ar: معدل البت المحيط سيكون أقل من 32 كيلوبت/الثانية لكل قناة، يجب دمج هذا الملف إلى أحادي.
eo: Ĉirkaŭa bitrate estus malpli ol 32kBit/sec per kanalo, ĉi tiu dosiero devus esti miksita al mono.

source: Surround bitrate would be less than 32kBit/sec per channel, this file should be mixed down to stereo.
ar: معدل البت المحيط سيكون أقل من 32 كيلوبت/الثانية لكل قناة، يجب دمج هذا الملف إلى مجسمي.
eo: Ĉirkaŭa bitrapideco estus malpli ol 32kBit/sek per kanalo, ĉi tiu dosiero estu miksita al stereo.

# %1=original bitrate, %2=new/limited bitrate
source: Bitrate %1 kBit/sec is out of range, limited to %2 kBit/sec
ar: معدل البت %1 كيلوبت/الثانية خارج النطاق، محدود إلى %2 كيلوبت/الثانية
eo: Bitrapideco %1 kBit/sec estas ekster intervalo, limigita al %2 kBit/sec

# %1=requested sample rate, %2=lowest supported, %3=highest supported
source: Sample rate %1 samples/sec is out of range, supported are %2 ... %3 samples/sec.
ar: معدل العينة %1 عينة/الثانية خارج النطاق، المتاح هو %2 ... %3 عينة/الثانية.
eo: Specimenfrekvenco %1 specimenoj/sek estas ekster intervalo, subtenataj estas %2 ... %3 specimenoj/sek.

source: Opus encoder failed
ar: فشل ترميز Opus
eo: Opus-kodilo malsukcesis

source: Opus encoder failed setting bitrate: '%1'
ar: فشل مرمز Opus في ضبط معدل البت: '%1'
eo: Opus-kodilo malsukcesis agordi bitrapidecon: '%1'

source: Opus encoder failed configuring VBR mode: '%1'
ar: فشل مرمز Opus في تكوين وضع VBR: '%1'
eo: Opus-kodilo malsukcesis agordi VBR-reĝimon: '%1'

source: Opus encoder failed configuring VBR constraint: '%1'
ar: فشل مرمز Opus في تكوين قيد VBR: '%1'
eo: Opus-kodilo malsukcesis agordi VBR-limon: '%1'

source: Opus encoder failed getting lookahead value: '%1'
ar: فشل مرمز Opus في الحصول على قيمة lookahead: '%1'
eo: Opus-kodilo malsukcesis ricevi antaŭrigardan valoron: '%1'

source: This Ogg bitstream does not contain any Vorbis audio data.
ar: دفق بتات Ogg هذا لا يحتوي على أي بيانات صوت Vorbis.
eo: Ĉi tiu Ogg-bitfluo enhavas neniujn Vorbis-sondatumojn.

source: Corrupt secondary header. Exiting.
ar: رأس ثانوي تالف. جاري الخروج.
eo: Koruptita sekundara kaplinio. Elirante.

source: End of file before finding all Vorbis headers.
ar: نهاية الملف قبل العثور على جميع رؤوس Vorbis.
eo: Fino de dosiero antaŭ trovi ĉiujn Vorbis-kapojn.

source: This codec supports only mono or stereo files, %1 channels are not supported.
ar: هذا الترميز يدعم فقط الملفات الأحادية أو المجسمة، %1 قنوات غير متوفرة.
eo: Ĉi tiu kodeko subtenas nur mono aŭ stereodosierojn, %1 kanaloj ne estas subtenataj.

source: You have not selected any bitrate for the encoding. Do you want to continue and encode with %1 kBit/s or cancel and choose a different bitrate?
ar: لم تحدد أي معدل بت للترميز. هل تريد المتابعة والترميز بمعدل %1 كيلوبت/ثانية أو إلغاء واختيار معدل بت مختلف؟
eo: Vi ne elektis iun ajn bitratecon por la kodigo. Ĉu vi volas daŭrigi kaj kodi per %1 kBit/s aŭ nuligi kaj elekti malsaman bitrapidecon?

source: One or more encoding parameters are not supported. Please change the settings and try again.
ar: معلمة ترميز واحدة أو أكثر غير مدعومة. يرجى تغيير الإعدادات والمحاولة مرة أخرى.
eo: Unu aŭ pluraj kodaj parametroj ne estas subtenataj. Bonvolu ŝanĝi la agordojn kaj provi denove.

source: Detecting endianness (standard search)...
ar: جاري اكتشاف endianness (بحث قياسي)...
eo: Detektante endianecon (norma serĉo)...

source: Detecting endianness (statistic search)...
ar: جاري اكتشاف endianness (بحث إحصائي)...
eo: Detektante endianecon (statistika serĉo)...

source: Searching for missing chunk '%1'...
ar: جاري البحث عن القطعة المفقودة '%1'...
eo: Serĉante mankantan pecon '%1'...

source: Auto Repair
ar: الإصلاح الآلي
eo: Aŭtomata Riparo

source: Reading...
ar: يقرأ...
eo: Legante...

source: The file has been structurally damaged or it is no WAV file. Should Kwave try to repair it?
ar: الملف تالف هيكليًا أو أنه ليس ملف WAV. هل يجب على برنامج موجة محاولة إصلاحه؟
eo: La dosiero estis strukture difektita aŭ ĝi ne estas WAV-dosiero. Ĉu Kwave devus provi ripari ĝin?

source: Kwave Auto Repair
ar: الإصلاح الآلي لموجة
eo: Kwave Aŭtomata Riparo

source: &Repair
ar: أ&صلح
eo: &Ripari

source: The opened file is no WAV file or it is damaged: There is not enough valid sound data. It makes no sense to continue now.
ar: الملف المفتوح ليس ملف WAV أو أنه تالف: لا توجد بيانات صوتية صالحة كافية. لا فائدة من المتابعة الآن.
eo: La malfermita dosiero ne estas WAV-dosiero aŭ ĝi estas difektita: Ne estas sufiĉe da validaj sondatenoj. Ne havas sencon daŭrigi nun.

source: The WAV file seems to be damaged: Some chunks are duplicate or missing. Kwave will only use the first ones and ignore the rest. This might lead to loss of data.
ar: يبدو أن ملف WAV تالف: بعض القطع مكررة أو مفقودة. سيستخدم موجة الأولى فقط ويتجاهل الباقي. قد يؤدي هذا إلى فقدان البيانات.
eo: La WAV-dosiero ŝajnas esti difektita: Kelkaj partoj estas duobligitaj aŭ mankas. Kwave uzos nur la unuajn kaj ignoros la ceterajn. Ĉi tio povus kaŭzi perdon de datumoj.

source: file header is damaged
ar: رأس الملف تالف
eo: dosierkapo estas difektita

source: internal libaudiofile error #%1: '%2'
ar: خطأ داخلي في libaudiofile #%1: '%2'
eo: interna libaudiofile-eraro #%1: '%2'

source: Sorry, the currently selected compression type cannot be used for saving. Do you want to use G711 ULAW compression instead?
ar: عذرًا، لا يمكن استخدام نوع الضغط المحدد حاليًا للحفظ. هل تريد استخدام ضغط G711 ULAW بدلاً من ذلك؟
eo: Pardonu, la nuntempe elektita kunprema tipo ne povas esti uzata por konservi. Ĉu vi volas uzi G711 ULAW-kunpremadon anstataŭe?

source: &Yes, use G711
ar: &نعم، استخدم G711
eo: &Jes, uzi G711

source: &No, store uncompressed
ar: لا، خزّن غير &مضغوط
eo: &Ne, konservi nekunpremita

source: File or selection too large
ar: الملف أو التحديد كبير جدًا
eo: Dosiero aŭ elekto tro granda

source: WAV audio
ar: صوت WAV
eo: WAV-aŭdio

source: Generate 50% DC Level
ar: توليد مستوى 50% تيار مستمر
eo: Generi 50% DC Nivelon

source: Generate 100% DC Level
ar: توليد مستوى 100% تيار مستمر
eo: Generi 100% DC Nivelon

source: MinMax Pattern
ar: نمط MinMax
eo: MinMax-Ŝablono

source: Generate Sawtooth Pattern
ar: توليد نمط سن المنشار
eo: Generi Segildentan Skemon

source: Verify Sawtooth Pattern
ar: التحقق من نمط سن المنشار
eo: Kontroli Segildentan Skemon

source: FM Sweep
ar: مسح FM
eo: FM Svingo

source: Labels at Stripe borders
ar: تسميات عند حدود الشريط
eo: Etikedoj ĉe Stripe-limoj

source: Dump Window Hierarchy
ar: تفريغ تسلسل النوافذ
eo: Elĵeti Fenestran Hierarkion

source: Dump Meta Data
ar: تفريغ البيانات الوصفية
eo: Elĵeti Metadatumojn

source: Debug (%1)
ar: نقّح (%1)
eo: Sencimigi (%1)

source: (auto detect)
ar: (مكتشف آليًّا)
eo: (aŭtomata detektado)

# file type filter when exporting to K3b
source: K3b project file (*.k3b)
ar: ملف مشروع كي٣بي (*.k3b)
eo: K3b-projektdosiero (*.k3b)

source: Please choose a K3b project file name
ar: يرجى اختيار اسم ملف مشروع كي٣بي
eo: Bonvolu elekti K3b-projektan dosiernomon

source: Please choose where to export the audio files
ar: يرجى اختيار مكان تصدير ملفات الصوت
eo: Bonvolu elekti kien elporti la sondosierojn

source: Input Settings
ar: إعدادات دخل
eo: Enigo-Agordoj

source: Format of Labels:
ar: تنسيق التسميات:
eo: Formato de Etikedoj:

source: <html><head/><body><p>Select a pattern for detecting title and artist from the text of a label.<br/>It currently understands the following placeholders:</p><ul style="margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; -qt-list-indent: 1;"><li style=" margin-top:12px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Courier New,courier'; font-weight:600;">[%title] </span>title of the song</li><li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Courier New,courier'; font-weight:600;">[%artist]</span> name of the artist</li></ul></body></html>
ar: <html><head/><body><p>حدد نمطًا لاكتشاف العنوان والفنان من نص التسمية.<br/>يفهم حاليًا العناصر النائبة التالية:</p><ul style="margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; -qt-list-indent: 1;"><li style=" margin-top:12px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Courier New,courier'; font-weight:600;">[%title] </span>عنوان الأغنية</li><li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Courier New,courier'; font-weight:600;">[%artist]</span> اسم الفنان</li></ul></body></html>
eo: <html><head/><body><p>Elektu ŝablonon por detekti titolon kaj artiston el la teksto de etikedo.<br/>Ĝi nuntempe komprenas la sekvajn anstataŭaĵojn:</p><ul style="margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; -qt-list-indent: 1;"><li style=" margin-op:12px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Courier New,courier'; font-weight:600;">[%title] </span>titolo de la kanto</li><li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Courier New,courier'; font-weight:600;">[%artist]</span> nomo de la artisto</li></ul></body></html>

source: If checked, <b>save only the blocks that overlap with the current selection</b>, otherwise the whole file. <br><i>Please note that this option is disabled if nothing is selected or the selection already covers the whole file.</i>
ar: إذا حُدد، <b>احفظ فقط الكتل التي تتداخل مع التحديد الحالي</b>، وإلا فسيحفظ الملف بأكمله. <br><i>يرجى ملاحظة أن هذا الخيار معطل إذا لم يحدد أي شيء أو إذا كان التحديد يغطي الملف بأكمله بالفعل.</i>
eo: Se markita, <b>konservi nur la blokojn kiuj interkovras kun la nuna elekto</b>, alie la tutan dosieron. <br><i>Bonvolu noti, ke ĉi tiu opcio estas malŝaltita se nenio estas elektita aŭ la elekto jam kovras la tutan dosieron.</i>

source: Use Selection only
ar: استخدم التحديد فقط
eo: Uzi nur Elekton

source: Output Settings
ar: إعدادات المخرجات
eo: Eligo-Agordoj

source: Overwrite Policy:
ar: سياسة الاستبدال:
eo: Anstataŭigi Politikon:

source: Select whether existing files are overwritten or new file names are used when exporting the files to use as tracks of the audio CD.
ar: حدد ما إذا كانت الملفات الموجودة ستستبدل أو سيستخدم أسماء ملفات جديدة عند تصدير الملفات لاستخدامها كمسارات للقرص الصوتي.
eo: Elektu ĉu ekzistantaj dosieroj estas anstataŭitaj aŭ novaj dosiernomoj estas uzataj dum eksportado de la dosieroj por uzi kiel spurojn de la son-KD.

source: Overwrite Existing Files
ar: اكتب فوق الملفات الموجودة
eo: Anstataŭigi Ekzistantajn dosierojn

source: Use new File Names
ar: استخدم أسماء ملفات جديدة
eo: Uzi novajn Dosiernomojn

source: Export Location:
ar: موقع التصدير:
eo: Eksporta Loko:

source: K3b Project File:
ar: ملف مشروع كي٣بي:
eo: K3b-Projektdosiero:

source: Location to save the K3b project file
ar: موقع حفظ ملف مشروع كي٣بي
eo: Loko al kiu konservi la K3b-projektdosieron

source: Project File
ar: ملف المشروع
eo: Projekta Dosiero

source: Location to export the audio files to
ar: موقع تصدير ملفات الصوت إليه
eo: Loko al kiu elporti la sondosieroj

source: Export Location
ar: موقع التصدير
eo: Elporta Loko:

# menu: /File/Save/Export to K3b Project...
source: Export to K3b Project...
ar: تصدير إلى مشروع كي٣بي...
eo: Eksporti al K3b-Projekto...

source: Only mono and stereo files can be used for an audio CD. You can either deselect some channels or export the file in a different file format that supports mono and stereo only (for example FLAC) and then try again.
ar: يمكن استخدام الملفات الأحادية والمجسمة فقط للقرص الصوتي. يمكنك إما إلغاء تحديد بعض القنوات أو تصدير الملف بتنسيق ملف مختلف يدعم الأحادي والمجسم فقط (مثل FLAC) ثم المحاولة مرة أخرى.
eo: Nur mono- kaj stereodosieroj povas esti uzataj por son-KD. Vi povas aŭ malelekti kelkajn kanalojn aŭ eksporti la dosieron en malsama dosierformato kiu subtenas nur monon kaj stereon (ekzemple FLAC) kaj poste provi denove.

source: A K3b project file has been created and audio files have been exported. Should I start K3b and open the audio CD project now?
ar: أُنشئ ملف مشروع كي٣بي وصُدرت ملفات الصوت. هل يجب أن أبدأ كي٣بي وأفتح مشروع القرص الصوتي الآن؟
eo: K3b-projektdosiero estis kreita kaj sondosieroj eksportitaj. Ĉu mi lanĉu K3b kaj malfermu la son-KD-projekton nun?

source: Average Bitrate Mode
ar: وضع معدل البت المتوسط
eo: Meza Bitrate-Reĝimo

source: <b>Average Bitrate Mode</b><br> Bitrate is set to an average value, with optional upper and lower limit.
ar: <b>وضع معدل البت المتوسط</b><br> يُضبط معدل البت على قيمة متوسطة، مع حد أعلى وأدنى اختياري.
eo: <b>Averaĝa Bitrata Reĝimo</b><be> Bitrato estas agordita al meza valoro, kun laŭvola supra kaj malsupra limo.

source: ABR:
ar: معدل بت متوسط:

source: lowest
ar: الأقل
eo: plej malalta

source: Variable Bitrate Mode
ar: وضع معدل البت المتغير
eo: Variebla Bitrata Reĝimo

source: <b>Variable Bitrate Mode</b><br> The bitrate is selected by an average quality.
ar: <b>وضع معدل البت المتغير</b><br> يعين معدل البت بناءً على جودة متوسطة.
eo: <b>Reĝimo de Variebla bitrateco</b><br> La bitrapideco estas elektita laŭ averaĝa kvalito.

source: VBR:
ar: معدل بت متغير:

source: highest
ar: الأقصى
eo: plej alta

source: Nominal Bitrate
ar: معدل البت الاسمي
eo: Nominala Bitfrekvenco

source: %1 bytes
ar: %1 بايت
eo: %1 bajtoj

source: %1 kB (%2 byte)
ar: %1 كيلوبايت (%2 بايت)
eo: %1 kB (%2 bajto)

source: %1 MB (%2 byte)
ar: %1 ميغابايت (%2 بايت)
eo: %1 MB (%2 bajto)

source: Sample rate:
ar: معدّل الإعتيان:
eo: Ekzempla indico:

source: Here you can select one of the predefined well-known sample rates or you can enter any sample rate on your own.
ar: هنا يمكنك اختيار أحد معدلات العينة المعروفة المحددة مسبقًا أو يمكنك إدخال أي معدل عينة بنفسك.
eo: Ĉi tie vi povas elekti unu el la antaŭdifinitaj bonkonataj specimenaj indicoj aŭ vi povas enmeti ajn specimenan indicon memstare.

source: Resolution:
ar: الدقّة:
eo: Distingivo:

source: Select a resolution in bits in which the file will be saved.
ar: حدد دقة بالبتات سيُحفظ الملف بها.
eo: Elektu distingivon en bitoj en kiu la dosiero estos konservita.

source: Tracks:
ar: المسارات:
eo: Trakoj:

source: Shows the number of tracks of the signal. You can add or delete tracks via the Edit menu.
ar: يعرض عدد مسارات الإشارة. يمكنك إضافة أو حذف المسارات عبر قائمة التحرير.
eo: Montras la nombron da trakoj de la signalo. Vi povas aldoni aŭ forigi trakojn per la Redakti menuo.

source: Length:
ar: الطول:
eo: Longo:

source: Shows the length of the file in samples and if possible as time.
ar: يعرض طول الملف بالعينات وإذا أمكن كوقت.
eo: Montras la longon de la dosiero en specimenoj kaj se eble kiel tempo.

source: %1 (%2 samples)
ar: %1 (%2 عينات)
eo: %1 (%2 specimenoj)

source: %1 samples
ar: %1 عينات
eo: %1 specimenoj

source: (Mono)
ar: (أحادي)

source: (Stereo)
ar: (مجسمي)

source: (Quadro)
ar: (رباعي)
eo: (Kvadro)

source: Yes
ar: نعم
eo: Jes

source: No
ar: لا
eo: Ne

source: File Info
ar: معلومات الملف
eo: Dosiera Informo

source: File
ar: ملف
eo: Dosiero

source: bit
ar: بت
eo: iom

source: samples per second
ar: عينات لكل ثانية
eo: specimenoj je sekundo

source: Encoding Mode:
ar: نمط الترميز:
eo: Kodiga Reĝimo:

source: MPEG
ar: إم بي إي جي

source: Intensity Stereo
ar: مجسم شديد
eo: Intensa Stereo

source: MS Stereo
ar: مجسم وسط-جانبي

source: yes
ar: نعم
eo: jes

source: Bands 4 to 31
ar: النطاقات من 4 إلى 31
eo: Bandoj 4 ĝis 31

source: Bands 8 to 31
ar: النطاقات من 8 إلى 31
eo: Bandoj 8 ĝis 31

source: Bands 12 to 31
ar: النطاقات من 12 إلى 31
eo: Bandoj 12 ĝis 31

source: Bands 16 to 31
ar: النطاقات من 16 إلى 31
eo: Bandoj 16 ĝis 31

source: MPEG Version 1 (ISO/IEC 11172-3)
ar: إم بي إي جي الإصدار 1 (ISO/IEC 11172-3)
eo: MPEG Versio 1 (ISO/IEC 11172-3)

source: MPEG Version 2 (ISO/IEC 13818-3)
ar: إم بي إي جي الإصدار 2 (ISO/IEC 13818-3)
eo: MPEG Versio 2 (ISO/IEC 13818-3)

source: MPEG Version 2.5 (unofficial)
ar: إم بي إي جي الإصدار 2.5 (غير رسمية)
eo: MPEG-Versio 2.5 (neoficiala)

source: Layer I
ar: الطبقة I
eo: Tavolo I

source: Layer II
ar: الطبقة II
eo: Tavolo II

source: Layer III
ar: الطبقة III
eo: Tavolo III

source: Content
ar: المحتوى
eo: Enhavo

source: Select a date from the calendar.
ar: حدد تاريخًا من التقويم.
eo: Elektu daton el la kalendaro.

source: Opens a dialog for selecting a date from the calendar.
ar: يفتح نافذة حوار لاختيار تاريخ من التقويم.
eo: Malfermas dialogon por elekti daton el la kalendaro.

source: Set the date to today.
ar: اضبط التاريخ إلى اليوم.
eo: Agordu la daton al hodiaŭ.

source: &Today
ar: الي&وم
eo: &Hodiaŭ

source: Author/Copyright
ar: المؤلف/حقوق النسخ
eo: Aŭtoro/Kopirajto

source: Miscellaneous
ar: متنوّع
eo: Diversaj

source: You have changed the sample rate. Do you want to convert the whole file to the new sample rate or do you only want to set the rate information in order to repair a damaged file? Note: changing only the sample rate can cause "Mickey Mouse" effects.
ar: لقد غيرت معدل العينة. هل تريد تحويل الملف بأكمله إلى معدل العينة الجديد أم تريد فقط تعيين معلومات المعدل لإصلاح ملف تالف؟ ملاحظة: تغيير معدل العينة فقط قد يسبب تأثيرات "ميكي ماوس".
eo: Vi ŝanĝis la specimenan indicon. Ĉu vi volas konverti la tutan dosieron al la nova specimena indico aŭ ĉu vi volas nur agordi la indicon por ripari difektitan dosieron? Noto: ŝanĝi nur la specimenan indicon povas kaŭzi "Mickey Mouse" efikojn.

source: &Convert
ar: &حوّل
eo: &Konverti

source: &Set Rate
ar: &عيّن المعدل
eo: Agordi Ofte&con

source: &Remove
ar: أ&زل
eo: Fo&rigi

source: &Add
ar: أ&ضف
eo: &Aldoni

source: auto-generate keywords
ar: توليد الكلمات المفتاحية آليًا
eo: aŭtomate generi ŝlosilvortoj

source: <b>Auto-Generate Keywords</b><br> Create a list of keywords by going through all present file information and merge it with the current list of keywords.
ar: <b>إنشاء الكلمات المفتاحية آلياً</b><br> أنشئ قائمة بالكلمات المفتاحية من خلال مراجعة جميع معلومات الملف الحالية ودمجها مع القائمة الحالية للكلمات المفتاحية.
eo: <b>Aŭtomate Generi Ŝlosilvortojn</b><br> Kreu liston de ŝlosilvortoj trarigardante ĉiujn nunajn dosierajn informojn kaj kunfandi ĝin kun la nuna listo de ŝlosilvortoj.

source: A&uto
ar: آ&ليّ
eo: Aut&omate

source: List of keywords.
ar: قائمة الكلمات المفتاحية.
eo: Listo de ŝlosilvortoj.

source: Select Date
ar: حدّد التاريخ
eo: Elekti Daton

source: Go to Position
ar: انتقل إلى موقع
eo: Iri al Pozicio

source: Goto...
ar: انتقل إلى...
eo: Iri al...

source: Insert At...
ar: أدرج عند...
eo: Enmeti ĉe...

source: Low Pass
ar: منخفض التردد
eo: Malaltpasilo

source: cutoff frequency
ar: تردد القطع
eo: detranĉa frekvenco

source: <b>cutoff frequency</b> Determines the highest audible frequency, higher frequencies will be cut off.
ar: <b>تردد القطع</b> يحدد أعلى تردد مسموع، سيُقطع الترددات الأعلى.
eo: <b>tranĉa frekvenco</b> Difinas la plej altan aŭdeblan frekvencon, pli altaj frekvencoj estos fortranĉitaj.

source: New Signal
ar: إشارة جديدة
eo: Nova Signalo

source: <b>Sample rate</b><br>Here you can select one of the predefined well-known sample rates or you can enter any sample rate on your own.
ar: <b>معدل العينة</b><br>هنا يمكنك اختيار أحد معدلات العينة المعروفة المحددة مسبقًا أو يمكنك إدخال أي معدل عينة بنفسك.
eo: <b>Sampleksoofrekvenco</b><br>Ĉi tie vi povas elekti unu el la antaŭdifinitaj konataj specimenofrekvencoj aŭ vi povas enigi ajnan specimenoftecon memstare.

source: Samples per second
ar: عينات في الثانية
eo: Specimenoj por sekundo

source: Bit
ar: بت

source: <b>Number of Tracks</b><br>Select a number of tracks of the new signal. If you are not sure now, you can add or delete tracks later in the program.
ar: <b>عدد المسارات</b><br>حدد عدد مسارات الإشارة الجديدة. إذا لم تكن متأكدًا الآن، يمكنك إضافة أو حذف المسارات لاحقًا في البرنامج.
eo: <b>Nombro da Trakoj</b><br>Elektu kelkajn trakojn de la nova signalo. Se vi ne certas nun, vi povas aldoni aŭ forigi spurojn poste en la programo.

source: <b>Resolution</b><br>Select a resolution in bits in which the file will be saved. However, Kwave always uses 24 bits as its own internal resolution to give the best results when processing the audio data.
ar: <b>الدقة</b><br> حدد دقة بالبتات سيُحفظ الملف بها. ومع ذلك، يستخدم موجة دائمًا 24 بت كدقة داخلية خاصة به لإعطاء أفضل النتائج عند معالجة بيانات الصوت.
eo: <b>Distingivo</b><br>Elektu distingivon en bitoj en kiu la dosiero estos konservita. Tamen, Kwave ĉiam uzas 24 bitojn kiel sian propran internan distingivon por doni la plej bonajn rezultojn dum prilaborado de la sondatenoj.

source: Select this to set the length of the file by time
ar: حدد هذا لضبط طول الملف حسب الوقت
eo: Elektu ĉi tion por agordi la longon de la dosiero laŭ tempo

source: Time
ar: الوقت
eo: Tempo

source: Select this to enter the number of samples directly
ar: حدد هذا لإدخال عدد العينات مباشرة
eo: Elektu ĉi tion por enigi la nombron da specimenoj rekte

source: Samples
ar: عينات
eo: Specimenoj

source: Minimum
ar: الحد الأدنى
eo: Minimumo

source: (File Size)
ar: (حجم الملفّ)
eo: (Dosiero Grandeco)

source: Maximum
ar: الحد الأعلى
eo: Maksimumo

source: Sets the file size by the percentage of the possible maximum
ar: يضبط حجم الملف بالنسبة المئوية للحد الأقصى الممكن
eo: Fiksas la grandecon de dosiero laŭ la procento de la ebla maksimumo

source: (Resulting file size: %1 MB)
ar: (حجم الملف الناتج: %1 ميغابايت)
eo: (Rezulta dosiergrandeco: %1 MB)

source: Add Noise
ar: أضف تشويش
eo: Aldoni Bruon

source: Mode
ar: الوضع
eo: Reĝimo

source: add a noise level by percentage
ar: أضف مستوى ضوضاء بالنسبة المئوية
eo: aldonu brunivelon laŭ procento

source: Adds a noise level given as a percentage relative to the maximum volume level. For example: "1 %", "15%" or "100%"
ar: يضيف مستوى ضوضاء معطى كنسبة مئوية بالنسبة لأقصى مستوى صوت. على سبيل المثال: "1%"، "15%" أو "100%"
eo: Aldonas brunivelon donitan kiel procenton rilate al la maksimuma volumnivelo. Ekzemple: "1 %", "15%" aŭ "100%"

source: &Percentage
ar: ال&نسبة
eo: &Procento

source: add a noise level in dB
ar: أضف مستوى ضوضاء بوحدة dB
eo: aldoni brunivelon en dB

source: adds a noise level in logarithmic scale (decibel). For example: "-3 dB", "- 6 dB".
ar: يضيف مستوى ضوضاء بمقياس لوغاريتمي (ديسيبل). على سبيل المثال: "-3 dB"، "-6 dB".
eo: aldonas brunivelon en logaritma skalo (decibelo). Ekzemple: "-3 dB", "- 6 dB".

source: &Logarithmic
ar: &لوغارتميّ
eo: &Logaritma

source: Volume
ar: الصوت
eo: Laŭteco

source: Noise Level
ar: مستوى الضوضاء
eo: Brua Nivelo

source: Normalize
ar: المساواة
eo: Normaligi

source: Analyzing volume level...
ar: جاري تحليل مستوى الصوت...
eo: Analizante laŭteconivelon...

source: Normalizing (%1 dB) ...
ar: جاري التسوية (%1 dB) ...
eo: Normaligante (%1 dB)...

source: Notch Filter
ar: مرشح الشق
eo: Noĉa Filtrilo

source: center frequency
ar: التردد المركزي
eo: centra frekvenco

source: <b>center frequency</b> Determines the center of the frequency range that should be removed.
ar: <b>التردد المركزي</b> يحدد مركز نطاق التردد الذي يجب إزالته.
eo: <b>centra frekvenco</b> Difinas la centron de la frekvenca gamo kiu devus esti forigita.

source: bandwidth
ar: عرض نطاق
eo: bendolarĝo

source: <b>bandwidth</b> Determines the width of the frequency range that should be removed.
ar: <b>عرض النطاق</b> يحدد عرض نطاق التردد الذي يجب إزالته.
eo: <b>bendolarĝo</b> Difinas la larĝecon de la frekvenca gamo kiu devus esti forigita.

source: Pitch Shift
ar: تغيير درجة الصوت
eo: Tonaltŝanĝo

source: Frequency:
ar: التردد:
eo: Ofteco:

source: chopper frequency
ar: تردد المقطّع
eo: chopper-frekvenco
