Repository: KDE/kwave
Catalog: po/*/kwave.po
Languages: ar, eo

source: Krautrock
ar: كراوتروك

source: Leftfield
ar: ليفتفيلد

source: Lounge
ar: صالة
eo: Salono

source: Math Rock
ar: روك رياضي
eo: Matematika Roko

source: New Romantic
ar: نيو رومانتيك
eo: Nova Romantika

source: Nu-Breakz
ar: نو-بريكز

source: Post-Punk
ar: ما بعد بانك
eo: Post-punko

source: Post-Rock
ar: ما بعد الروك
eo: Post-Roko

source: Psytrance
ar: سيترانس

source: Shoegaze
ar: شوجيز

source: Space Rock
ar: روك الفضاء
eo: Spaca Roko

source: Trop Rock
ar: تروب روك
eo: Tropa Roko

source: World Music
ar: موسيقى العالم
eo: Monda Muziko

source: Neoclassical
ar: كلاسيكي حديث
eo: Novklasika

source: Audiobook
ar: كتاب مسموع
eo: Aŭdlibro

source: Audio Theatre
ar: مسرح صوتي
eo: Audio-Teatro

source: Neue Deutsche Welle
ar: الموجة الألمانية الجديدة

source: Podcast
ar: نشرة
eo: Podkasto

source: Indie Rock
ar: إيندي روك
eo: Sendependa Roko

source: G-Funk
ar: جي فانك
eo: G-Funko

source: Dubstep
ar: دبستيب

source: Garage Rock
ar: روك الجراج
eo: Garaĝo Roko

source: Psybient
ar: سايبينت

source: Unknown
ar: مجهول
eo: Nekonata

source: Linear
ar: خطّي
eo: Lineara

source: Spline
ar: خط تكعيبي

source: Polynom, nth Degree
ar: متعدد الحدود، من الدرجة ن
eo: Polinomo, n-a Grado

source: Polynom, 3rd Degree
ar: متعدد الحدود، من الدرجة الثالثة
eo: Polinomo, 3-a Grado

source: Polynom, 5th Degree
ar: متعدد الحدود، من الدرجة الخامسة
eo: Polinomo, 5-a Grado

source: Polynom, 7th Degree
ar: متعدد الحدود، من الدرجة السابعة
eo: Polinomo, 7-a Grado

source: Sample and Hold
ar: الاعتيان والقبض

source: Failed opening the log file '%1' for writing
ar: فشل فتح ملف السجل '%1' للكتابة
eo: Malsukcesis malfermi la protokoldosieron '%1' por skribado

source: Unable to open '%1'
ar: تعذّر فتح الملفّ '%1'
eo: Ne eblas malfermi '%1'

source: ALSA (Advanced Linux Sound Architecture)
ar: ALSA (هندسة الصوت المتقدمة للينكس)
eo: ALSA (Altnivela Linukso-Sona Arkitekturo)

source: OSS (Open Sound System)
ar: OSS (نظام الصوت المفتوح)
eo: OSS (Malferma Sonsistemo)

source: Pulse Audio
ar: بولس أوديو
eo: Pulso Aŭdio

source: Qt Multimedia Audio
ar: كيو تي ملتيميديا ​​أوديو
eo: Qt Plurmedia Aŭdio

source: Running plugin '%1'...
ar: يشغّل الملحقة '%1'…
eo: Rulante kromprogramon '%1'...

source: The plugin '%1' is unknown or invalid.
ar: الملحقة '%1' غير معروفة أو غير صالحة.
eo: La kromaĵo '%1' estas nekonata aŭ nevalida.

source: Error On Loading Plugin
ar: خطأ في تحميل الملحقة
eo: Eraro dum Ŝargo de Kromaĵo

source: Loading plugin %1...
ar: يحمل الملحقة %1…
eo: Ŝargante kromaĵon %1...

source: Linear Two's Complement
ar: مكمل ثنائي خطي
eo: Lineara Dua Komplemento

source: Unsigned Integer
ar: عدد صحيح غير موقّع
eo: Sensigna Entjero

source: 32-bit IEEE Floating-Point
ar: نقطة عائمة 32-بت IEEE
eo: 32-bita IEEE Glitpunkto

source: 64-bit IEEE Double Precision Floating-Point
ar: نقطة عائمة مزدوجة الدقة 64-بت IEEE
eo: 64-bita IEEE Duobla Preciza Flospunkto

source: Signal is empty, nothing to save.
ar: الإشارة فارغة، لا شيء لحفظه.
eo: Signalo estas malplena, nenio por konservi.

source: Saving in this format will lose the following additional file attribute(s): %1 Do you still want to continue?
ar: سيؤدي الحفظ بهذا التنسيق إلى فقدان سمة(سمات) الملف الإضافية التالية: %1 هل ما زلت تريد المتابعة؟
eo: Konservado en ĉi tiu formato perdos la jenajn kromajn atributojn de dosiero: %1 Ĉu vi ankoraŭ volas daŭrigi?

source: (built with KDE Frameworks %1)
ar: (مبني بإطار عمل كِيدِي %1)
eo: (konstruita kun KDE Frameworks %1)

source: An error occurred while saving the file.
ar: حدث خطأ أثناء حفظ الملف.
eo: Okazis eraro dum konservado de la dosiero.

source: The file has been truncated and might be corrupted.
ar: اقُتطع الملف وقد يكون تالفًا.
eo: La dosiero estas detranĉita kaj eble estas koruptita.

source: Sorry, the file type is not supported.
ar: عذرًا، نوع الملف غير متاح.
eo: Pardonu, la dosiertipo ne estas subtenata.

source: Insert Clipboard at position
ar: أدرج الحافظة في الموضع
eo: Enmeti Tondujon ĉe pozicio

source: Paste
ar: ألصق
eo: Alglui

source: Crop
ar: اقتصّ
eo: Stuci

source: Expand Selection to Label
ar: وسّع التحديد إلى التسمية
eo: Vastigi Elekton al Etikedo

source: Select Next Labels
ar: حدد التسميات التالية
eo: Elekti Sekvajn Etikedojn

source: Select Previous Labels
ar: حدد التسميات السابقة
eo: Elekti Antaŭajn Etikedojn

source: Select All Tracks
ar: حدد كافة المسارات
eo: Elekti Ĉiujn Trakojn

source: Deselect all tracks
ar: ألغ تحديد كافة المسارات
eo: Malelekti ĉiujn trakojn

source: Invert Track Selection
ar: اعكس تحديد المسار
eo: Inversigi Trak-Elekton

source: Select Track
ar: حدد المسار
eo: Elekti Trakon

source: Deselect Track
ar: ألغ تحديد المسار
eo: Malelekti Trakon

source: Toggle Track Selection
ar: بدل تحديد المسار
eo: Baskuligi Elekton de Trako

source: Append Track
ar: ألحق مسار
eo: Aldoni Trakon

source: Insert Track
ar: أدرج مساراً
eo: Enmeti Trakon

source: Delete Track
ar: احذف المسار
eo: Forigi Trakon

source: Insert Space
ar: أدرج فرغ
eo: Enmeti Spacon

source: Not enough memory for saving undo information.
ar: لا توجد ذاكرة كافية لحفظ معلومات التراجع.
eo: Ne sufiĉa memoro por konservi malfar-informojn.

source: Do you want to continue without the possibility to undo?
ar: هل تريد الاستمرار دون إمكانية التراجع؟
eo: Ĉu vi volas daŭrigi sen la ebleco malfari?

source: <b>Hint</b>: you can configure the amount of memory<br>available for undo under '%1'/'%2'.
ar: <b>تلميح</b>: يمكنك تكوين مقدار الذاكرة <br>المتاحة للتراجع ضمن '%1'/'%2'.
eo: <b>Konsilo</b>: vi povas agordi la kvanton da memoro<br>disponebla por malfari sub '%1'/'%2'.

source: Settings
ar: إعدادات
eo: Agordoj

source: Memory
ar: الذاكرة
eo: Memoro

source: Last Action
ar: أخر إجراء
eo: Lasta Ago

source: Modify File Info
ar: عدّل معلومات الملف
eo: Modifi Dosiero-Informojn

source: Delete All Labels
ar: احذف كل التسميات
eo: Forigi Ĉiuj Etikedoj

source: Delete Label
ar: احذف التسمية
eo: Forigi Etikedon

source: Manual Track Selection
ar: تحديد يدوي للمسار
eo: Mana Voja Elekto

source: Manual Selection
ar: تحديد يدويّ
eo: Mana Elekto

source: New File
ar: ملفّ جديد
eo: Nova Dosiero

# name of the undo action for inserting a meta data object
source: Insert %1
ar: إدراج %1
eo: Enigi %1

source: Insert %1 %2 objects
ar: أدرج %1 %2 كائن
eo: Enigi %1 %2 objektojn

source: Insert Meta Data
ar: أدرج البيانات الوصفية
eo: Enigi Metadatumojn

# name of the undo action for deleting a meta data object
source: Delete %1
ar: احذف %1
eo: Forigi %1

source: Delete %1 %2 objects
ar: احذف %1 %2 كائن
eo: Forigi %1 %2 objektojn

source: Delete Meta Data
ar: احذف البيانات الوصفية
eo: Forigi Metadatumojn

source: Modify Samples
ar: عدّل العينات
eo: Modifi Specimenojn

# name of the undo action for modifying a meta data object
source: Modify %1
ar: عدل %1
eo: Modifi %1

source: Modify %1 %2 objects
ar: عدّل %1 %2 كائن
eo: Modifi %1 %2 objektoj

source: Modify Meta Data
ar: عدّل البيانات الوصفيّة
eo: Modifi Metadatumojn

source: None
ar: لا شيء
eo: Neniu

source: Hamming
ar: هامينغ

source: Hanning
ar: هاننج

source: Blackman
ar: بلاكمان
eo: Nigrulo

source: name
ar: اسم
eo: nomo

source: version
ar: إصدارة
eo: versio

source: authors
ar: مؤلفين
eo: aŭtoroj

source: Plugins found: %1
ar: الملحقات الموجودة: %1
eo: Kromaĵoj trovitaj: %1

source: About Kwave
ar: عن موجة
eo: Pri Kwave

source: <h1>Kwave - a sound editor by KDE</h1>
ar: <h1>موجة محرر صوت من كيدي</h1>
eo: <h1>Kwave - sonredaktilo de KDE</h1>

source: About
ar: عن
eo: Pri

source: <html><head/><body><p><span style=" font-size:x-large; font-weight:600;">Kwave is a sound editor based on KDE Frameworks. </span></p><p><br/>With Kwave you can edit many sorts of audio files including multi track files. You are able to alter and play back each track on its own.<br/>Kwave also includes many plugins to transform the audio data in several ways and presents a graphical view with a complete zoom and scroll capability.</p></body></html>
ar: <html><head/><body><p><span style=" font-size:x-large; font-weight:600;">موجدة هو محرر صوت مبني على أطر عمل كيدي. </span></p><p><br/>مع موجة يمكنك تحرير العديد من أنواع ملفات الصوت بما في ذلك الملفات متعددة المسارات. يمكنك تعديل وتشغيل كل مسار على حدة.<br/>يتضمن موجة أيضًا العديد من الملحقات لتحويل بيانات الصوت بطرق متعددة ويقدم عرضًا رسوميًا مع إمكانية تكبير وتصغير كاملة وقدرة على التمرير.</p></body></html>
eo: <html><head/><body><p><span style=" font-size:x-large; font-weight:600;">Kwave estas sonredaktilo bazita sur KDE Frameworks. </span></p><p><br/>Per Kwave vi povas redakti multajn specojn de sondosieroj inkluzive de multtrakaj dosieroj. Vi povas ŝanĝi kaj reludi ĉiun aŭtoveturejon per si mem.<br/>Kwave ankaŭ inkluzivas multajn kromaĵojn por transformi la sonajn datumojn en pluraj manieroj kaj prezentas grafikan vidon kun kompleta zomo kaj movokapableco.</p></body></html>

source: Authors
ar: المؤلفون
eo: Aŭtoroj

source: Thanks To
ar: الشكر إلى
eo: Dankon al

source: Plugins info
ar: معلومات الملحقات
eo: Informoj pri kromprogramoj

source: Translation
ar: الترجمة
eo: Traduko

source: License agreement
ar: اتفاقية الترخيص
eo: Permesila interkonsento

source: ms
ar: م‌ث

source: Amplify Free
ar: تضخيم حر
eo: Amplifi Liberan

source: Fade In
ar: ظهور تدريجي
eo: Maldissolvi

source: Fade Out
ar: اختفاء
eo: Dissolvi

source: Fade Intro
ar: تتلاشى المقدمة
eo: Maldissolvi Enkondukon

source: Fade Leadout
ar: تتلاشى الخاتمة
eo: Dissolvi Konkludon

source: Hz
ar: هرتز

source: dB
ar: دسب

source: &Stop
ar: أو&قِف
eo: &Halti

source: &Listen
ar: ا&ستمع
eo: &Aŭskulti

source: Band Pass
ar: مرشح نطاقي
eo: Bandpasilo

source: Hz
ar: هرتز

source: start/stop pre-listening
ar: بدء/إيقاف الاستماع المسبق
eo: komenci/ĉesigi antaŭaŭskultadon

source: Start or stop the pre-listening of the current settings. If pre-listening is enabled, you will nearly immediately hear any change in the selected parameters.
ar: ابدأ أو أوقف الاستماع المسبق للإعدادات الحالية. إذا مُكن الاستماع المسبق، فستسمع أي تغيير في المعلمات المحددة على الفور تقريبًا.
eo: Komenci aŭ ĉesigi la antaŭaŭskultadon de la nunaj agordoj. Se antaŭaŭskultado estas ebligita, vi preskaŭ tuj aŭdos ajnan ŝanĝon en la elektitaj parametroj.

source: ASCII encoded audio
ar: صوت مُرمَّز بـ ASCII
eo: ASCII kodita audio

source: Unable to open the file for saving.
ar: تعذر فتح الملف للحفظ.
eo: Ne eblas malfermi la dosieron por konservi.

source: Amiga IFF/8SVX Sound File Format
ar: تنسيق ملف الصوت Amiga IFF/8SVX
eo: Amiga IFF/8SVX Sondosiero-Formato

source: Compressed Audio Interchange Format
ar: تنسيق تبادل الصوت المضغوط
eo: Kunpremita Audio Interŝanĝa Formato

source: Audio Interchange Format
ar: تنسيق تبادل الصوت
eo: Audio Interŝanĝa Formato

source: Audio Visual Research File Format
ar: تنسيق ملف Audio Visual Research
eo: Formato de Aŭdio-Vida Esploro

source: Core Audio File Format
ar: تنسيق ملف Core Audio

source: Berkeley, IRCAM, Carl Sound Format
ar: تنسيق صوت Berkeley، IRCAM، Carl

source: NIST SPHERE Audio File Format
ar: تنسيق ملف الصوت NIST SPHERE
eo: NIST-SFERO Sondosierformato

source: Sample Vision Format
ar: تنسيق Sample Vision
eo: Specimena Vida Formato

source: Format or function is not implemented
ar: التنسيق أو الوظيفة غير مطبقة
eo: Formato aŭ funkcio ne estas efektivigitaj

source: File header is damaged
ar: رأس الملف تالف
eo: Dosiera kaplinio estas difektita

source: Invalid codec type
ar: نوع الترميز غير صالح
eo: Nevalida kodeko-tipo

source: Opening the file failed
ar: فشل فتح الملف
eo: Malfermo de la dosiero malsukcesis

source: Read access failed
ar: فشل الوصول للقراءة
eo: Legado malsukcesis

source: Invalid sample format
ar: تنسيق العينة غير صالح
eo: Nevalida specimena formato

source: An error occurred while opening the file: '%1'
ar: حدث خطأ أثناء فتح الملف: '%1'
eo: Eraro okazis dum malfermo de la dosiero: '%1'

source: FLAC audio
ar: صوت FLAC
eo: FLAC-aŭdio

source: Opening the FLAC bitstream failed.
ar: فشل فتح دفق بتات FLAC.
eo: Malfermo de la FLAC-bitfluo malsukcesis.

source: Error while parsing the FLAC metadata. (%s)
ar: خطأ أثناء تحليل البيانات الوصفية لـ FLAC. (%s)
eo: Eraro dum analizado de la metadatumoj de FLAC. (%s)

source: Unable to open the FLAC encoder.
ar: تعذر فتح مرمز FLAC.
eo: Ne eblas malfermi la FLAC-kodilon.

# menu: /Settings/MP3 Encoder Setup
source: MP3 Encoder Setup
ar: إعدادات مرمز MP3
eo: Agordo de MP3-kodilo

source: MPEG layer III audio
ar: صوت إم بي إي جي الطبقة III
eo: MPEG-tavolo III-aŭdio

source: MPEG layer II audio
ar: صوت إم بي إي جي الطبقة II
eo: MPEG-tavolo II audio

source: MPEG layer I audio
ar: صوت إم بي إي جي الطبقة I
eo: MPEG-tavolo I audio

source: The file has an invalid checksum. Do you still want to continue?
ar: الملف يحتوي على مجموع غير صالح. هل ما زلت تريد المتابعة؟
eo: La dosiero havas nevalidan kontrolsumon. Ĉu vi ankoraŭ volas daŭrigi?

source: The file contains an invalid channel mode 0x%1 Assuming Mono...
ar: الملف يحتوي على وضع قناة غير صالح 0x%1 سيفترض أنه أحادي...
eo: La dosiero enhavas nevalidan kanalreĝimon 0x%1 Suponante Mono...

source: The opened file is no MPEG file or it is damaged. No header information has been found.
ar: الملف المفتوح ليس ملف إم بي إي جي أو أنه تالف. لم يعثر على معلومات الرأس.
eo: La malfermita dosiero ne estas MPEG-dosiero aŭ ĝi estas difektita. Neniu kap-informo estis trovita.

source: Checksum error
ar: خطأ في المجموع
eo: Kontrolsumo-eraro

source: Synchronization lost
ar: فقدت المزامنة
eo: Sinkronigo perdita

source: File contains invalid data
ar: الملف يحتوي على بيانات غير صالحة
eo: Dosiero enhavas nevalidajn datumojn

source: Unknown error 0x%1. Damaged file?
ar: خطأ غير معروف 0x%1. ملف تالف؟
eo: Nekonata eraro 0x%1. Difektita dosiero?

source: An error occurred while decoding the file: '%1', at position %2.
ar: حدث خطأ أثناء فك ترميز الملف: '%1', في الموضع %2.
eo: Okazis eraro dum malkodado de la dosiero: '%1', a pozicio %2.

source: Do you still want to continue?
ar: هل تريد المتابعة؟
eo: Ĉu vi ankoraŭ volas daŭrigi?

source: Do you want to continue and ignore all following errors?
ar: هل تريد المتابعة وتجاهل جميع الأخطاء التالية؟
eo: Ĉu vi volas daŭrigi kaj ignori ĉiujn sekvajn erarojn?

source: The file format you have chosen supports only mono or stereo. This file will be mixed down to stereo when saving.
ar: تنسيق الملف الذي اخترته يدعم الأحادي أو المجسم فقط. سيُدمج هذا الملف إلى مجسم عند الحفظ.
eo: La dosierformato, kiun vi elektis, subtenas nur mono aŭ stereo. Ĉi tiu dosiero estos miksita al stereo dum konservado.

source: Unable to open the file for saving!
ar: تعذر فتح الملف للحفظ!
eo: Ne eblas malfermi la dosieron por konservi!

# %1=name of the external program, %2=stderr of the program
source: An error occurred while calling the external encoder '%1': %2
ar: حدث خطأ أثناء استدعاء المرمز الخارجي '%1': %2
eo: Eraro okazis dum vokado de la ekstera kodilo '%1': %2

source: (user defined)
ar: (عرّفه المستخدم)
eo: (Uzanto difinita)

source: sample rate in Hz (use %1 as placeholder) or kHz (use %2 as placeholder)
ar: معدل العينة بالهرتز (استخدم %1 كعنصر نائب) أو كيلوهرتز (استخدم %2 كعنصر نائب)
eo: provtempo en Hz (uzi %1 kiel anstataŭilon) aŭ kHz (uzi %2 kiel anstataŭilon)

source: bits per sample, use %1 as placeholder
ar: بت لكل عينة، استخدم %1 كعنصر نائب
eo: bitoj specimene, uzi %1 kiel lokokupilon

source: parameter for minimum bitrate in bits/sec (use %1 as placeholder)
ar: معلمة لأدنى معدل بت بالبت/الثانية (استخدم %1 كعنصر نائب)
eo: parametro por minimuma bitrapideco en bitoj/sek (uzi %1 kiel anstataŭilon)

source: parameter for maximum bitrate in bits/sec (use %1 as placeholder)
ar: معلمة لأعلى معدل بت بالبت/الثانية (استخدم %1 كعنصر نائب)
eo: parametro por maksimuma bitrapideco en bitoj/sek (uzi %1 kiel anstataŭilon)

source: parameter for average bitrate in bits/sec (use %1 as placeholder)
ar: معلمة لمتوسط معدل بت بالبت/الثانية (استخدم %1 كعنصر نائب)
eo: parametro por meza bitrapideco en bitoj/sek (uzi %1 kiel anstataŭilon)

source: Select MP3 Encoder
ar: اختر مرمز MP3
eo: Elekti MP3-kodilon

source: Congratulation, the test was successful!
ar: مبارك، كان الاختبار ناجحًا!
eo: Gratulon, la testo sukcesis!

source: MP3 Encoder Settings
ar: إعدادات مرمز MP3
eo: Agordoj de MP3-kodilo

source: Program
ar: برنامج
eo: Programo

source: manually browse for the encoder
ar: استعرض يدويًا للعثور على المرمز
eo: permane foliumi por la kodilo

source: &Select...
ar: ا&ختر...
eo: &Elekti...

source: select one of the predefined encoder setups
ar: اختر أحد إعدادات المرمز المحددة مسبقًا
eo: elektu unu el la antaŭdifinitaj kodilaj agordoj

source: auto-detect the installed encoder
ar: اكتشف المرمز المثبت آليًا
eo: aŭtomate detekti la instalitan kodilon

source: &Auto Detect...
ar: ا&كتشف آليًّا...
eo: &Aŭtomate Detekti...

source: show the usage information of the encoder
ar: اعرض معلومات استخدام المرمز
eo: montri la uzajn informojn de la kodilo

source: &Usage
ar: الا&ستخدام
eo: &Uzado

source: path to the encoder
ar: المسار إلى المرمز
eo: vojo al la kodilo

source: Path:
ar: المسار:
eo: Vojo:

source: find the full path to the encoder
ar: ابحث عن المسار الكامل إلى المرمز
eo: trovi la plenan vojon al la kodilo

source: &Locate
ar: &حدد الموقع
eo: &Lokigi

source: Parameters
ar: المتغيرات الوسيطة
eo: Parametroj

source: Input
ar: الدّخل
eo: Enigo

source: Sign:
ar: و&قّع:
eo: Signo:

source: parameter for switching the byte order
ar: معلمة لتبديل ترتيب البايت
eo: parametro por ŝanĝi la bajtan ordon

source: parameter for telling the encoder to use raw data as input format
ar: معلمة لإخبار المرمز باستخدام البيانات الأولية كتنسيق إدخال
eo: parametro por diri al la kodilo uzi krudajn datumojn kiel enigformaton

source: Raw Format:
ar: التنسيق الخام:
eo: Kruda Formato:

source: Byte Order:
ar: ترتيب البايتات:
eo: Bajta Ordo:

source: parameter to use signed sample format
ar: معلمة لاستخدام تنسيق عينة موقعة
eo: parametro por uzi subskribitan specimenan formaton

source: Format
ar: التنسيق
eo: Formato

source: Sample Rate:
ar: معدّل الإعتيان:
eo: Ekzempla indico:

source: Bits per Sample:
ar: عدد البت في العينة:
eo: Bitoj por Specimeno:

source: Channels:
ar: القنوات:
eo: Kanaloj:

source: mono:
ar: أحادي:

source: parameter for single channel files (mono)
ar: معلمة لملفات القناة المفردة (أحادي)
eo: parametro por unukanalaj dosieroj (mono)

source: stereo:
ar: مجسمي:

source: parameter for multi channel files (stereo or more channels)
ar: معلمة لملفات متعددة القنوات (مجسمي أو أكثر)
eo: parametro por plurkanalaj dosieroj (stereo aŭ pli da kanaloj)

source: Quality
ar: الجودة
eo: Kvalito

source: max
ar: أقصى
eo: maks

source: min
ar: أدنى

source: Bitrate:
ar: معدل البت:
eo: Bitrapideco:

source: avg
ar: متوسط
eo: averg

source: Encoding
ar: التّرميز
eo: Kodigado

source: Emphasis:
ar: التشديد:
eo: Emfazo:

source: none
ar: لا شيء
eo: neniu

source: parameter for no emphasis
ar: معلمة لعدم التشديد
eo: parametro por neniu emfazo

source: 50/15ms
ar: 50/15م‌ث

source: parameter for 50/15ms emphasis
ar: معلمة لتشديد 50/15 مللي ثانية
eo: parametro por 50/15ms emfazo

source: parameter for CCIT J17 emphasis
ar: معلمة لتشديد CCIT J17
eo: parametro por CCIT J17 emfazo

source: Noise Shaping:
ar: تشكيل الضوضاء:
eo: Formado de Bruo:

source: parameters for configuring noise shaping
ar: معلمات لتكوين تشكيل الضوضاء
eo: parametroj por agordi bruoformadon

source: Compatibility:
ar: درجة التوافق:
eo: Kongrueco:

source: parameters for compatibility settings
ar: معلمات لإعدادات التوافق
eo: parametroj por kongruaj agordoj

source: Flags
ar: أعلام
eo: Flagoj

source: Copyright:
ar: حقوق النسخ:
eo: Kopirajto:

source: parameter for marking the file as copyrighted
ar: معلمة لوضع علامة على الملف بأنه محمي بحقوق النشر
eo: parametro por marki la dosieron kiel kopirajtigita

source: Original:
ar: الأصلية:
eo: Originala:

source: parameter for marking the signal as original (not a copy)
ar: معلمة لوضع علامة على الإشارة على أنها أصلية (ليست نسخة)
eo: parametro por marki la signalon kiel originalan (ne kopion)

source: Protect:
ar: حماية:
eo: Protekti:

source: parameter to enable CRC protection
ar: معلمة لتمكين حماية CRC
eo: parametro por ebligi CRC-protekton

source: Prepend:
ar: قدّم:
eo: Antaŭmeti:

source: additional parameters to put at the start of the encoder command line
ar: معلمات إضافية لوضعها في بداية سطر أمر المرمز
eo: pliajn parametrojn por meti ĉe la komenco de la komandlinio de kodilo

source: Append:
ar: ألحق:
eo: Aldoni:

source: additional parameters to append at the end of the encoder command line
ar: معلمات إضافية لإلحاقها في نهاية سطر أمر المرمز
eo: kromajn parametrojn almeti ĉe la fino de la komandlinio de kodilo

source: Info
ar: معلومات

source: Encoder Help:
ar: مساعد المرمز:
eo: Helpo pri kodilo:

source: parameter for getting usage information of the encoder
ar: معلمة للحصول على معلومات استخدام المرمز
eo: parametro por ricevi informojn pri uzado de la kodilo

source: Version Info:
ar: معلومات الإصدارة:
eo: Informoj pri Versio:

source: parameter for getting the encoder version information
ar: معلمة للحصول على معلومات إصدار المرمز
eo: parametro por ricevi informojn pri la versio de kodilo

source: try to encode some short test signal with the current settings
ar: حاول ترميز بعض إشارات الاختبار القصيرة بالإعدادات الحالية
eo: provi kodi iun mallongan testsignalon kun la nunaj agordoj

source: Test...
ar: اختبار...
eo: Testo...

source: Ogg Opus audio
ar: صوت Ogg Opus
eo: Aŭdio Ogg Opus

source: Ogg Vorbis audio
ar: صوت Ogg Vorbis

source: Ogg audio
ar: صوت Ogg

source: Ogg bitstream has zero-length.
ar: دفق بتات Ogg له طول صفري.
eo: Ogg bitstream havas nul-longon.

source: Input does not appear to be an Ogg bitstream.
ar: الإدخال لا يبدو أنه دفق بتات Ogg.
eo: Enigo ne ŝajnas esti Ogg-bitfluo.

source: Error reading first page of the Ogg bitstream data.
ar: خطأ في قراءة الصفحة الأولى من بيانات دفق بتات Ogg.
eo: Eraro legante la unuan paĝon de la Ogg-bitfluaj datumoj.

source: Error reading initial header packet.
ar: خطأ في قراءة حزمة الرأس الأولية.
eo: Eraro legante komencan kappakon.

source: Error: Codec not supported
ar: خطأ: الترميز غير مدعوم
eo: Eraro: Kodeko ne subtenata

source: Corrupt or missing data in bitstream. Continuing.
ar: بيانات تالفة أو مفقودة في دفق البت. جاري المتابعة.
eo: Koruptitaj aŭ mankantaj datumoj en bitfluo. Daŭrigante.

# error in Ogg encoder, no support for a compression type (e.g. opus, vorbis etc)
source: Error: No Codec for '%1' available
ar: خطأ: لا يوجد مرمز متاح لـ '%1'
eo: Eraro: Neniu Kodeko por '%1' disponebla

source: One or more invalid/out of range arguments.
ar: وسيط واحد أو أكثر غير صالح/خارج النطاق.
eo: Unu aŭ pluraj nevalidaj/eksterintervalaj argumentoj.

source: The mode struct passed is invalid.
ar: هيكل الوضع المُمرر غير صالح.
eo: La reĝima strukturo pasigita estas nevalida.

source: An internal error was detected.
ar: اكُتشاف خطأ داخلي.
eo: Interna eraro estis detektita.

source: The compressed data passed is corrupted.
ar: البيانات المضغوطة المُمررة تالفة.
eo: La kunpremitaj datumoj pasigitaj estas koruptitaj.

source: Invalid/unsupported request number.
ar: رقم طلب غير صالح/غير مدعوم.
eo: Nevalida/nesubtenata petonumero.

source: A decoder structure is invalid or already freed.
ar: هيكل فك الترميز غير صالح أو محرر فعلًا.
eo: Malĉifrilo estas nevalida aŭ jam liberigita.

source: Decoder error: %1
ar: خطأ في فك الترميز: %1
eo: Malĉifrila eraro: %1

source: End of file before finding Opus Comment headers.
ar: نهاية الملف قبل العثور على رؤوس تعليقات Opus.
eo: Fino de dosiero antaŭ trovi Opus Comment-kapojn.

source: This Ogg bitstream does not contain valid Opus audio data.
ar: دفق بتات Ogg هذا لا يحتوي على بيانات صوت Opus صالحة.
eo: Ĉi tiu Ogg-bitfluo ne enhavas validajn sonajn datumojn de Opus.

source: Opus decoder failed
ar: فشل فك ترميز Opus
eo: Opus-malĉifrilo malsukcesis
