Repository: KDE/kwave
Catalog: po/*/kwave.po
Languages: ar, eo

source: Buffer:
ar: المخزن المؤقت:
eo: Bufro:

source: Level:
ar: المستوى:
eo: Nivelo:

source: Maybe your system lacks support for the corresponding hardware or the hardware is not connected.
ar: ربما لا يوفر نظامك إمكانية التعامل مع الجهاز المقابل أو أن الجهاز غير متصل.
eo: Eble al via sistemo mankas subteno por la responda aparataro aŭ la aparataro ne estas konektita.

source: The audio device seems to be occupied by another application. Retrying...
ar: يبدو أن جهاز الصوت مشغول بتطبيق آخر. جاري إعادة المحاولة...
eo: La sona aparato ŝajnas esti okupata de alia aplikaĵo. Reprovante...

source: Some unexpected error happened (%1). You may try an other recording method or recording device.
ar: حدث خطأ غير متوقع (%1). يمكنك تجربة طريقة تسجيل أخرى أو جهاز تسجيل آخر.
eo: Iu neatendita eraro okazis (%1). Vi povas provi alian registran metodon aŭ registran aparaton.

# %1 = a device name
source: Unable to open the recording device (%1)
ar: تعذر فتح جهاز التسجيل (%1)
eo: Ne eblas malfermi la registradan aparaton (%1)

source: %1 channels
ar: %1 قناة
eo: %1 kanaloj

source: %1 is not supported, using %2
ar: %1 غير متاح؛ يستخدم %2
eo: %1 ne estas subtenata, uzante %2

source: Recording with %1 channel(s) failed, using %2 channel(s)
ar: فشل التسجيل باستخدام %1 قناة، يستخدم %2 قناة
eo: Registrado kun %1 kanalo(j) malsukcesis, uzante %2 kanalo(j)

source: %1 Hz is not supported, using %2 Hz
ar: %1 هرتز غير متاح، يستخدم %2 هرتز
eo: %1 Hz ne estas subtenata, uzante %2 Hz

source: %1 Hz failed, using %2 Hz
ar: فشل %1 هرتز، يستخدم %2 هرتز
eo: %1 Hz malsukcesis, uzante %2 Hz

source: Compression '%1' not supported, using '%2'
ar: ضغط '%1' غير متاح، يستخدم '%2'
eo: Kunpremo '%1' ne estas subtenata, uzante '%2'

source: Compression '%1' failed, using '%2'.
ar: فشل ضغط '%1'، يستخدم '%2'.
eo: Kunpremo '%1' malsukcesis, uzante '%2'.

source: %1 bits per sample is not supported, using %2 bits per sample
ar: %1 بت لكل عينة غير متاح، يستخدم %2 بت لكل عينة
eo: %1 bitoj per specimeno ne estas subtenataj, uzante %2 bitojn per specimeno

source: %1 bits per sample failed, using %2 bits per sample
ar: فشل %1 بت لكل عينة، يستخدم %2 بت لكل عينة
eo: %1 bitoj per specimeno malsukcesis, uzante %2 bitojn per specimeno

source: Sample format '%1' is not supported, using '%2'
ar: تنسيق العينة '%1' غير متاح، يستخدم '%2'
eo: Ekzempla formato '%1' ne estas subtenata, uzante '%2'

source: Sample format '%1' failed, using '%2'
ar: فشل تنسيق العينة '%1'، يستخدم '%2'
eo: Ekzempla formato '%1' malsukcesis, uzante '%2'

source: The current sample format is not supported!
ar: تنسيق العينة الحالي غير متاح!
eo: La nuna ekzempla formato ne estas subtenata!

source: The current compression type is not supported!
ar: نوع الضغط الحالي غير متاح!
eo: La nuna kunprema tipo ne estas subtenata!

source: Buffer overrun. Please increase the number and/or size of the record buffers.
ar: فيض المخزن المؤقت. يرجى زيادة عدد و/أو حجم مخازن التسجيل المؤقتة.
eo: Bufro transpaso. Bonvolu pliigi la nombron kaj/aŭ grandecon de la registrilaj bufroj.

source: The recording device seems to be busy.
ar: يبدو أن جهاز التسجيل مشغول.
eo: La registra aparato ŝajnas esti okupata.

source: Reading from the recording device failed. Error number = %1 (%2)
ar: فشل القراءة من جهاز التسجيل. رقم الخطأ = %1 (%2)
eo: Legado de la registra aparato malsukcesis. Erarnumero = %1 (%2)

source: Reverse
ar: اعكس
eo: Renversi

source: Change sample rate
ar: غيّر معدّل الاعتيان
eo: Ŝanĝi specimenan oftecon

source: Changing sample rate from %1 kHz to %2 kHz...
ar: جاري تغيير معدل العينة من %1 كيلوهرتز إلى %2 كيلوهرتز...
eo: Ŝanĝante sample-frekvencon de %1 kHz al %2 kHz...

source: Please choose where to save the files
ar: يرجى اختيار مكان حفظ الملفات
eo: Bonvolu elekti kien elporti la dosierojn

source: <p>Select the pattern that is used to create the filename of each saved block. It currently understands the following placeholders:</p> <ul> <li><tt><b>[%filename]</b></tt>name of the file, without the path</li> <li><tt><b>[</b>%<i>0</i></tt><i>N</i><tt><b>nr]</b></tt>the index of the file, optionally with leading zeroes (if <tt>'0</tt>' prepended) and optionally a fixed number of digits (<tt>N</tt>)</li> <li><tt><b>[%</b><i>0</i><i>N</i><b>count]</b></tt>the number of files that will be saved</li> <li><tt><b>[%</b><i>0</i><i>N</i><b>total]</b></tt>the highest index within the files that will be saved</li> </ul>
ar: <p>حدد النموذج المستخدم لإنشاء اسم الملف لكل كتلة محفوظة. يفهم حاليًا العناصر النائبة التالية:</p> <ul> <li><tt><b>[%filename]</b></tt>اسم الملف، بلا مسار</li> <li><tt><b>[</b>%<i>0</i></tt><i>N</i><tt><b>nr]</b></tt>فهرس الملف، اختياريًا بأصفار رائدة (إذا أُضيف <tt>'0'</tt>) واختياريًا بعدد ثابت من الأرقام (<tt>N</tt>)</li> <li><tt><b>[%</b><i>0</i><i>N</i><b>count]</b></tt>عدد الملفات التي ستُحفظ</li> <li><tt><b>[%</b><i>0</i><i>N</i><b>total]</b></tt>أعلى فهرس ضمن الملفات التي ستُحفظ</li> </ul>
eo: <p>Elektu la ŝablonon kiu estas uzata por krei la dosiernomon de ĉiu konservita bloko. Ĝi nuntempe komprenas la jenajn anstataŭaĵojn:</p> <ul> <li><tt><b>[%filename]</b></tt>nomo de la dosiero, sen la vojo</li > <li><tt><b>[</b>%<i>0</i></tt><i>N</i><tt><b>nr]</b> </tt>la indekso de la dosiero, laŭvole kun antaŭaj nuloj (se <tt>'0</tt>' antaŭmetita) kaj laŭvole fiksa nombro da ciferoj (<tt>N</tt>)</li> <li><tt><b>[%</b><i>0</i><i>N</i><b>kalkulo]</b></tt>la nombro da dosieroj kiuj estos konservita</li> <li><tt><b>[%</b><i>0</i><i>N</i><b>tute]</b></tt>la plej alta indekso ene de la dosieroj kiuj estos konservitaj</li> </ul>

source: Filename pattern:
ar: نمط اسم الملف:
eo: Dosiernomo ŝablono:

source: Numbering:
ar: التعداد:
eo: Numerado:

source: Determines how the <b>numbering of the files</b> should happen:<ul> <li>Continue after the <b>highest index</b> that can be found, avoiding collisions with existing files</li> <li>Always start numbering from <b>one</b>, possibly colliding with already existing files</li> </ul>
ar: يحدد كيفية <b>ترقيم الملفات</b>:<ul> <li>المتابعة بعد <b>أعلى فهرس</b> يمكن العثور عليه، وتجنب التعارض مع الملفات الموجودة</li> <li>ابدأ الترقيم دائمًا من <b>واحد</b>، مع احتمال التعارض مع الملفات الموجودة مسبقًا</li> </ul>
eo: Determinas kiel la <b>numerado de la dosieroj</b> devus okazi:<ul> <li>Daŭrigi post la <b>plej alta indekso</b> trovebla, evitante koliziojn kun ekzistantaj dosieroj</li > <li>Ĉiam komencu numeradon de <b>unu</b>, eble koliziante kun jam ekzistantaj dosieroj</li> </ul>

source: Continue after highest index
ar: المتابعة بعد أعلى فهرس
eo: Daŭrigi post la plej alta indekso

source: Always start with 1, overwrite if necessary
ar: ابدأ دائمًا بـ 1، واستبدل إذا لزم الأمر
eo: Ĉiam komenci per 1, superskribi se necese

source: Extension:
ar: الامتداد:
eo: Etendo:

source: Choose what encoding to save the blocks with.
ar: اختر الترميز الذي ستُحفظ الكتل به.
eo: Elektu la kodigon per kiu konservi la blokojn.

source: Location to save the files
ar: موقع حفظ الملفات
eo: Loko por konservi la dosierojn

source: Choose where to save the files
ar: اختر مكان حفظ الملفات
eo: Elektu ĉu konservi la dosierojn

source: Example of the first file name that will be saved, using the file name pattern, extension, and numbering
ar: مثال على اسم الملف الأول الذي سيُحفظ، باستخدام نموذج اسم الملف، والامتداد، والترقيم
eo: Ekzemplo de la unua dosiernomo kiu estos konservita, uzante la dosiernoman ŝablonon, finaĵon kaj numeradon

source: TextLabel
ar: لصيقة نصّيّة
eo: TekstEtikedo

source: Example file name:
ar: مثال اسم الملف:
eo: Ekzempla dosiernomo:

source: Save selection only
ar: احفظ التحديد فقط
eo: Konservi nur elekton

source: This would overwrite the following file(s): %1Do you really want to continue?
ar: هذا سيستبدل الملف(ات) التالية: %1 هل تريد حقًا المتابعة؟
eo: Ĉi tio anstataŭigus la jenajn dosierojn: %1Ĉu vi vere volas daŭrigi?

source: The following directories do not exist: %1Do you want to create them and continue?
ar: المجلدات التالية غير موجودة: %1 هل تريد إنشاءها والمتابعة؟
eo: La jenaj dosierujoj ne ekzistas: %1Ĉu vi volas krei ilin kaj daŭrigi?

source: Start
ar: ابدأ
eo: Komenci

source: Select Range
ar: حدد النطاق
eo: Elekti Gamon

source: (resulting window size: %1)
ar: (حجم النافذة الناتج: %1)
eo: (rezulta fenestra grandeco: %1)

source: Size of bitmap: %1x%2
ar: حجم الصورة النقطية: %1×%2
eo: Grandeco de bitmapo: %1x%2

source: Set FFT/Time Resolution Parameters
ar: تعيين معاملات دقة FFT/الوقت
eo: Agordi FFT/Tempo-Distingivajn Parametrojn

source: display
ar: العرض
eo: ekrano

source: Use different colors for amplitude
ar: استخدم ألوانًا مختلفة للسعة
eo: Uzi malsamajn kolorojn por amplitudo

source: Use colors
ar: استخدم الألوان
eo: Uzi kolorojn

source: Use grayscale only for amplitude
ar: استخدم التدرج الرمادي فقط للسعة
eo: Uzi grizskalon nur por amplitudo

source: Grayscale
ar: تدرج الرمادي
eo: Grizskalo

source: Update
ar: حدّث
eo: Ĝisdatigo

source: Automatically update the sonagram <br>if the signal data has changed
ar: حدّث السونوغرام آليًا <br>إذا تغيرت بيانات الإشارة
eo: Aŭtomate ĝisdatigi la sonagramon <br>se la signalaj datumoj ŝanĝiĝis

source: On modifications
ar: عند التعديلات
eo: Pri modifoj

source: Automatically update the sonagram if the selection<br>has been enlarged, reduced or moved
ar: حدّث السونوغرام آليًا إذا <br>وُسّع التحديد أو صُغّر أو نُقل
eo: Aŭtomate ĝisdatigu la sonagramon se la elekto<br>estas pligrandigita, reduktita aŭ movita

source: Follow selection
ar: اتبع التحديد
eo: Sekvi elekton

source: FFT settings
ar: إعدادات FFT
eo: FFT-agordoj

source: Number of FFT points:
ar: عدد نقاط FFT:
eo: Nombro da FFT-poentoj:

source: Window function:
ar: دالة الإطار:
eo: Fenestra funkcio:

source: Choose windowing function here.<br> If the transformation should stay reversible, use the type "None".
ar: اختر دالة التقطيع هنا.<br> إذا كان يجب أن يبقى التحويل قابلًا للعكس، فاستخدم النوع "لا شيء".
eo: Elektu fenestran funkcion ĉi tie.<br> Se la transformo restu reigebla, uzu la tipon "Neniu".

source: <b>Number of FFT points:</b><p></p>Try to choose numbers with small prime factors,<br> if choosing big window sizes.<br> The computation will be much faster!
ar: <b>عدد نقاط FFT:</b><p></p>حاول اختيار أرقام بعوامل أولية صغيرة،<br> إذا كنت تختار أحجام نوافذ كبيرة.<br> سيكون الحساب أسرع بكثير!
eo: <b>Nombro de FFT-punktoj:</b><p></p>Provu elekti nombrojn kun malgrandaj primaj faktoroj,<br> se elektas grandajn fenestrajn grandecojn.<br> La komputado estos multe pli rapida!

source: Sonagram
ar: السونوغرام
eo: Sonagramo

source: &Sonagram
ar: ال&سونوغرام
eo: &Sonagramo

source: &Export to Bitmap...
ar: &صدّر إلى صورة نقطية…
eo: &Eksporti al Bitmapo...

source: &Close
ar: أ&غلق
eo: &Fermi

source: Time: ------ ms
ar: الوقت: ------ ملي ثانية
eo: Tempo: ------ ms

source: Frequency: ------ Hz
ar: التّردّد: ------ هرتز
eo: Ofteco: ------ Hz

source: Amplitude: --- %
ar: السعه: --- ٪
eo: Amplekso: --- %

source: Time: 0 ms
ar: الوقت: 0 ملي ثانية
eo: Tempo: 0 ms

source: Frequency: 0 Hz
ar: التّردّد: 0 هرتز
eo: Ofteco: 0 Hz

source: Amplitude: 0 %
ar: السعه: --- ٪
eo: Amplekso: 0 %

source: Save Sonagram
ar: احفظ السونوغرام
eo: Konservi Sonagramon

source: Sonagram of %1
ar: سونوغرام %1
eo: Sonagramo de %1

source: Time: %1
ar: الوقت: %1
eo: Tempo: %1

source: Frequency: %1 Hz
ar: التّردّد: %1 هرتز
eo: Ofteco: %1 Hz

source: Amplitude: %1%
ar: مجال: %1٪
eo: Amplekso: %1%

source: Enter Command...
ar: أدخِل أمرًا...
eo: Enigu komandon...

source: Enter Command:
ar: أدخِل أمرًا:
eo: Enigu komandon:

source: please enter a text command here...
ar: الرجاء إدخال أمر نصي هنا…
eo: bonvolu enigi tekstan komandon ĉi tie...

# menu: /Settings/Enter Command
source: Enter Command
ar: أدخِل أمرًا
eo: Enigi Komandon

source: change volume by factor
ar: غيِّر مستوى الصوت بمعامل
eo: ŝanĝi laŭtecon laŭ faktoro

source: Increments or decrements the volume by a factor. For example: "x1", "x2", "/ 4"
ar: يزيد أو ينقص مستوى الصوت بمقدار عامل حسابي. على سبيل المثال: "x1"، "x2"، "/ 4"
eo: Pliigas aŭ malpliigas la laŭtecon je faktoro. Ekzemple: "x1", "x2", "/ 4"

source: &Factor
ar: ال&عامل
eo: &Faktoro

source: change volume by percentage
ar: غيِّر مستوى الصوت بالنسبة المئوية
eo: ŝanĝi laŭtecon je procento

source: Sets the volume to a relative percentage of the original level. For example: "50 %", "75%" or "125%"
ar: يضبط مستوى الصوت على نسبة مئوية نسبية من المستوى الأصلي. على سبيل المثال: "50%"، "75%"، أو "125%".
eo: Agordas la laŭtecon al relativa procento de la originala nivelo. Ekzemple: "50 %", "75%" aŭ "125%"

source: change volume in dB
ar: غيِّر مستوى الصوت بالديسيبل
eo: ŝanĝi laŭtecon en dB

source: Increments or decrements the volume in logarithmic scale (decibel). For example: "+3 dB", "+ 6 dB", "-3 dB".
ar: يزيد أو ينقص مستوى الصوت بالديسيبل. على سبيل المثال: "+3 ديسيبل"، "+6 ديسيبل"، "-3 ديسيبل".
eo: Pliigas aŭ malpliigas la laŭtecon en logaritma skalo (decibelo). Ekzemple: "+3 dB", "+ 6 dB", "-3 dB".

source: Silence
ar: الصمت
eo: Silento

source: T.H.F. Klok and Cedric Tefft
eo: T.H.F. Klok kaj Cedric Tefft

source: CCITT G.711 u-law
eo: CCITT G.711 u-leĝo

source: CCITT G.711 A-law
eo: CCITT G.711 A-leĝo

source: NeXT, Sun Audio
eo: Sekva, Sun Audio

source: Creative Voice
eo: Kreiva Voĉo

source: and %1 second
eo: kaj %1 sekundo
