Repository: KDE/kwave
Catalog: po/*/kwave.po
Languages: ar, eo

source: To Next Labels
ar: إلى التسمية التالية
eo: Al Sekvaj Etikedoj

source: To Previous Labels
ar: إلى التسمية السابقة
eo: Al Antaŭaj Etikedoj

source: Kwave Macro Files
ar: ملفات ماكرو لبرنامج موجة
eo: Kwave Makrodosieroj

source: All Files
ar: كلّ الملفّات
eo: Ĉiuj dosieroj

source: All Supported Files
ar: كلّ الملفّات المدعومة
eo: Ĉiuj Subtenataj Dosieroj

source: No Compression
ar: دون ضغط
eo: Neniu Kunpremo

source: Apple ACE2
ar: أبل ACE2

source: Apple ACE8
ar: أبل ACE8

source: Apple MAC3
ar: أبل MAC3

source: Apple MAC6
ar: أبل MAC6

source: DVI Audio / IMA
ar: DVI صوتي / IMA
eo: DVI Aŭdio / IMA

source: MPEG Layer I
ar: إم بي إي جي الطبقة I
eo: MPEG Tavolo I

source: MPEG Layer II
ar: إم بي إي جي الطبقة II
eo: MPEG Tavolo II

source: MPEG Layer III
ar: إم بي إي جي الطبقة III
eo: MPEG Tavolo III

source: Do you really want to abort the current action?
ar: أتريد حقًا إلغاء الإجراء الحالي؟
eo: Ĉu vi vere volas ĉesigi la nunan agon?

source: Album
ar: الألبوم
eo: Albumo

source: Name of the album if the source is an album that consist of more medias.
ar: اسم الألبوم إذا كان المصدر ألبومًا يتكون من وسائط متعددة.
eo: Nomo de la albumo se la fonto estas albumo kiu konsistas el pli da amaskomunikiloj.

source: Annotation
ar: شرح
eo: Komentario

source: Provides general comments about the file or the subject of the file. If the comment is several sentences long, end each sentence with a period. Do not include newline characters!
ar: يقدم تعليقات عامة حول الملف أو موضوع الملف. إذا كان التعليق يتكون من عدة جمل، فانهِ كل جملة بنقطة. لا تدرج أحرفَ سطر جديد!
eo: Provizas ĝeneralajn komentojn pri la dosiero aŭ la temo de la dosiero. Se la komento longas plurajn frazojn, fini ĉiun frazon per punkto. Ne enmetu novliniajn signojn!

source: Archival location
ar: موقع الأرشيف
eo: Arkiva loko

source: Indicates where the subject of the file is archived.
ar: يشير إلى مكان أرشفة موضوع الملف.
eo: Indikas kie la temo de la dosiero estas arkivita.

source: Author
ar: المؤلف
eo: Aŭtoro

source: Identifies the name of the author of the original subject of the file. Example: 'van Beethoven, Ludwig'
ar: يحدد اسم مؤلف الموضوع الأصلي للملف. مثال: 'فان بيتهوفن، لودفيغ'
eo: Identigas la nomon de la aŭtoro de la originala temo de la dosiero. Ekzemplo: 'van Beethoven, Ludwig'

source: Lower Bitrate
ar: معدل البت الأدنى
eo: Malsupra Bitrate

source: Specifies the lower limit in a VBR bitstream.
ar: يحدد الحد الأدنى في دفق البت VBR.
eo: Specifas la malsupran limon en VBR-bitfluo.

source: Bitrate Mode
ar: وضع معدل البت

source: Bitrate Mode (ABR, VBR, CBR, etc...)
ar: وضع معدل البت (ABR, VBR, CBR، إلخ...)
eo: Bitrate Mode (ABR, VBR, CBR, ktp...)

source: Bitrate
ar: معدّل بِتّ
eo: Bitrapideco

source: Nominal bitrate of the audio stream in bits per second
ar: معدل البت الاسمي لدفق الصوت بالبت في الثانية
eo: Nominala bitrapideco de la sonfluo en bitoj je sekundo

source: Upper Bitrate
ar: معدل البت الأعلى
eo: Supra Bitrapideco

source: Specifies the upper limit in a VBR bitstream.
ar: يحدد الحد الأعلى في دفق البت VBR.
eo: Specifas la supran limon en VBR-bitfluo.

source: Bits per Sample
ar: عدد البت في العينة
eo: Bitoj por Specimeno

source: Specifies the number of bits per sample.
ar: يحدد عدد البتات لكل عينة.
eo: Specifas la nombron da bitoj per specimeno.

source: CD
ar: القرص المدمج
eo: KD

source: Number of the CD, if the source is an album of more CDROMs
ar: رقم القرص المضغوط، إذا كان المصدر ألبومًا من أقراص مضغوطة متعددة
eo: Nombro de la KD, se la fonto estas albumo de pliaj KDROMoj

source: CDS
ar: أقراص مدمجة
eo: KDoj

source: Number of CDs, if the source is an album of more CDROMs
ar: عدد الأقراص المضغوطة، إذا كان المصدر ألبومًا من أقراص مضغوطة متعددة
eo: Nombro da KD-oj, se la fonto estas albumo de pliaj KDROM-oj

source: Commissioned
ar: المتعهد
eo: Komisiita

source: Lists the name of the person or organization that commissioned the subject of the file.
ar: يسرد اسم الشخص أو المنظمة التي تعهدت بموضوع الملف.
eo: Listigas la nomon de la persono aŭ organizo kiu komisiis la temon de la dosiero.

source: Comments
ar: تعليقات
eo: Komentoj

source: Compression
ar: الضغط
eo: Kunpremo

source: Sets a mode for compressing the audio data to reduce disk space.
ar: يضبط وضعًا لضغط بيانات الصوت لتقليل مساحة القرص.
eo: Agordas reĝimon por kunpremi la audio datenojn por redukti diskospacon.

source: Contact
ar: المتراسل
eo: Kontakto

source: Contact information for the creators or distributors of the track. This could be a URL, an email address, the physical address of the producing label.
ar: معلومات الاتصال لمنشئي المسار أو موزعيها. يمكن أن يكون هذا عنوان URL، أو عنوان بريد إلكتروني، أو العنوان الفعلي لشركة الإنتاج.
eo: Kontaktinformoj por la kreintoj aŭ distribuistoj de la trako. Ĉi tio povus esti URL, retadreso, la fizika adreso de la produktanta eldon-etikedo.

source: Copyright
ar: حقوق النسخ
eo: Kopirajto

source: Records the copyright information for the file. If there are multiple copyrights, separate them by a semicolon followed by a space. Example: 'Copyright Linux community 2002'
ar: يسجل معلومات حقوق النشر للملف. إذا كانت هناك حقوق نشر متعددة، ففصلها بفاصلة منقوطة يليها مسافة. مثال: 'حقوق النشر مجتمع لينكس 2002'
eo: Registras la kopirajtajn informojn por la dosiero. Se estas pluraj kopirajtoj, apartigu ilin per punktokomo sekvata de spaco. Ekzemplo: 'Copyright Linuksa komunumo 2002'

source: Copyrighted
ar: محفوظ الحقوق
eo: Kopirajtita

source: Indicates whether the file is protected by copyright or not.
ar: يشير إلى ما إذا كان الملف محميًا بحقوق النشر أم لا.
eo: Indikas ĉu la dosiero estas protektita per kopirajto aŭ ne.

source: Date
ar: التاريخ
eo: Dato

source: Specifies the date the subject of the file was created. Example: '2001-12-24'
ar: يحدد تاريخ إنشاء موضوع الملف. مثال: '2001-12-24'
eo: Specifas la daton en kiu la temo de la dosiero estis kreita. Ekzemplo: '2001-12-24'

source: Engineer
ar: المهندس
eo: Inĝeniero

source: Shows the name of the engineer who worked on the file. If there are multiple engineers, separate the names by a semicolon and a blank.
ar: يعرض اسم المهندس الذي عمل على الملف. إذا كان هناك عدة مهندسين، فافصل الأسماء بفاصلة منقوطة ومسافة.
eo: Montras la nomon de la inĝeniero kiu laboris pri la dosiero. Se estas pluraj inĝenieroj, apartigu la nomojn per punktokomo kaj spaceto.

source: Estimated Length
ar: الطول التقريبي
eo: Laŭtaksa Longo

source: Estimated length of the file in samples
ar: الطول التقريبي للملف بالعينات
eo: Laŭtaksa longo de la dosiero en specimenoj

source: Filename
ar: اسم الملفّ
eo: Dosiernomo

source: Name of the opened file
ar: اسم الملف المفتوح
eo: Nomo de la malfermita dosiero

source: File Size
ar: حجم الملفّ
eo: Dosiera Grandeco

source: Size of the file in bytes
ar: حجم الملف بالبايت
eo: Grandeco de la dosiero en bajtoj

source: Genre
ar: النوع
eo: Ĝenro

source: Describes the genre or style of the original work. Examples: 'classic', 'pop'
ar: يصف نوع أو أسلوب العمل الأصلي. أمثلة: 'كلاسيكي'، 'بوب'
eo: Priskribas la ĝenron aŭ stilon de la originala verko. Ekzemploj: 'klasika', 'popmuziko'

source: ID3 Tags
ar: وسوم ID3
eo: ID3-Etikedoj

source: List of ID3 Tags
ar: قائمة وسوم ID3
eo: Listo de ID3-Etikedoj

source: ISRC number for the track; see the ISRC intro page for more information on ISRC numbers. http://www.ifpi.org/site-content/online/isrc_intro.html
ar: رقم ISRC للمسار؛ انظر صفحة مقدمة ISRC لمزيد من المعلومات حول أرقام ISRC. http://www.ifpi.org/site-content/online/isrc_intro.html
eo: ISRC-nombro por la trako; vidu la enkondukan paĝon de ISRC por pliaj informoj pri ISRC-numeroj. http://www.ifpi.org/site-content/online/isrc intro.html

source: Keywords
ar: الكلمات المفتاحيّة
eo: Ŝlosilvortoj

source: Provides a list of keywords that refer to the file or subject of the file.
ar: يوفر قائمة بالكلمات المفتاحية التي تشير إلى الملف أو موضوع الملف.
eo: Provizas liston de ŝlosilvortoj kiuj rilatas al la dosiero aŭ temo de la dosiero.

source: Labels
ar: التسميات
eo: Etikedoj

source: The list of labels/markers.
ar: قائمة التسميات/العلامات.
eo: La listo de etikedoj/markoj.

source: Length of the file in samples.
ar: طول الملف بالعينات.
eo: Longo de la dosiero en specimenoj.

source: License
ar: الرخصة
eo: Permesilo

source: License information, e.g., 'All Rights Reserved', 'Any Use Permitted', an URL to a license or the EFF Open Audio License ('distributed under the terms of the Open Audio License. See http://www.eff.org/IP/Open_licenses/eff_oal.html for details'), etc.
ar: معلومات الترخيص، على سبيل المثال، 'جميع الحقوق محفوظة'، 'أي استخدام مسموح به'، عنوان URL لترخيص أو ترخيص EFF للصوت المفتوح ('يوزع تحت شروط ترخيص الصوت المفتوح. انظر http://www.eff.org/IP/Open_licenses/eff_oal.html للتفاصيل'), إلخ.
eo: Licenca informo, ekz., 'Ĉiuj Rajtoj Rezervitaj', 'Ajna Uzo Permesita', URL al permesilo aŭ la EFF Open Audio License ('disdonita laŭ la termoj de la Open Audio License. Vidu http:// www.eff.org/IP/Open_licenses/eff_oal.html por detaloj'), ktp.

source: Medium
ar: متوسط
eo: Meza

source: Describes the original subject of the file, where it was first recorded. Example: 'orchestra'
ar: البيئة
eo: Priskribas la originan temon de la dosiero, kie ĝi unue estis registrita. Ekzemplo: 'orkestro'

source: Mime Type
ar: نوع تنسيق الملف
eo: Mimo Tipo

source: Mime type of the file format
ar: نوع Mime لتنسيق الملف
eo: Mime-speco de la dosierformato

source: Emphasis
ar: تشديد
eo: Emfazo

source: Audio emphasis mode
ar: وضع تشديد الصوت
eo: Audio-emfaza reĝimo

source: Layer
ar: الطبقة
eo: Tavolo

source: MPEG Layer, I, II or III
ar: طبقة إم بي إي جي، I، II أو III
eo: MPEG Tavolo, I, II aŭ III

source: Mode Extension
ar: نمط الامتداد
eo: Mode Etendo

source: MPEG Mode Extension (only if Joint Stereo)
ar: امتداد وضع إم بي إي جي (فقط إذا كان مجسم مشترك)
eo: MPEG-Reĝima Etendaĵo (nur se Komuna Stereo)

source: Version
ar: الإصدارة
eo: Versio

source: MPEG Version, 1, 2 or 2.5
ar: إصدار إم بي إي جي، 1، 2 أو 2.5
eo: MPEG-Versio, 1, 2 aŭ 2.5

source: Name
ar: الاسم
eo: Nomo

source: Stores the title of the subject of the file. Example: "Symphony No.6, Op.68 'Pastoral'"
ar: يخزن عنوان موضوع الملف. مثال: "السمفونية رقم 6، Op.68 'الرعوية'"
eo: Konservas la titolon de la temo de la dosiero. Ekzemplo: "Symphony No.6, Op.68 'Pastoral'"

source: Opus Frame Length
ar: طول إطار Opus
eo: Opus Kadro Longo

source: Opus Frame Length in ms (supported values are 2.5, 5, 10, 20, 40, or 60 ms)
ar: طول إطار Opus بالمللي ثانية (القيم المدعومة هي 2.5، 5، 10، 20، 40، أو 60 مللي ثانية)
eo: Opus Frame Longo en ms (subtenataj valoroj estas 2.5, 5, 10, 20, 40, aŭ 60 ms)

source: Organization
ar: المنظّمة
eo: Organizo

source: Name of the organization producing the track (i.e. the 'record label')
ar: اسم المنظمة المنتجة للمسار (أي 'شركة الإنتاج')
eo: Nomo de la organizo produktanta la trakon (t.e. la 'diskodiskedo')

source: Original
ar: أصلي
eo: Originala

source: Indicates whether the file is an original or a copy
ar: يشير إلى ما إذا كان الملف أصليًا أم نسخة
eo: Indikas ĉu la dosiero estas originalo aŭ kopio

source: Performer
ar: المؤدّي
eo: Prezentisto

source: The artist(s) who performed the work. In classical music this would be the conductor, orchestra, soloists. In an audio book it would be the actor who did the reading.
ar: الفنان(ون) الذين أدوا العمل. في الموسيقى الكلاسيكية، سيكون هذا قائد الأوركسترا، والأوركسترا، والعازفين المنفردين. في الكتاب الصوتي، سيكون الممثل الذي قام بالقراءة.
eo: La artisto(j) kiu prezentis la verkon. En klasika muziko ĉi tio estus la direktisto, orkestro, solistoj. En aŭdlibro estus la aktoro, kiu faris la legadon.

source: Private
ar: خاص
eo: Privata

source: Indicates whether the subject is private
ar: يشير إلى ما إذا كان الموضوع خاصًا
eo: Indikas ĉu la subjekto estas privata

source: Product
ar: المنتج
eo: Produkto

source: Specifies the name or the title the file was originally intended for. Example: 'Linux audio collection'
ar: يحدد الاسم أو العنوان الذي أُعد الملف له أصلاً. مثال: 'مجموعة لينكس الصوتية'
eo: Specifas la nomon aŭ la titolon por kiu la dosiero estis origine destinita. Ekzemplo: 'Linuksa sonkolekto'

source: Sample Format
ar: تنسيق العينة
eo: Specimena Formato

source: Format used for storing the digitized audio samples. Example: '32-bit IEEE floating-point'
ar: التنسيق المستخدم لتخزين عينات الصوت الرقمية. مثال: 'نقطة عائمة 32-بت IEEE'
eo: Formato uzata por konservi la ciferecigitajn sonspecimenojn. Ekzemplo: '32-bita IEEE glitkoma'

source: Sample Rate
ar: معدّل الإعتيان
eo: Ekzempla indico

source: Number of samples per second
ar: عدد العينات في الثانية
eo: Nombro da specimenoj por sekundo

source: Software
ar: البرمجية
eo: Programaro

source: Identifies the name of the software package used to create the file. Example: 'Kwave v0.6.4-1'
ar: يحدد اسم حزمة البرامج المستخدمة لإنشاء الملف. مثال: 'Kwave v0.6.4-1'
eo: Identigas la nomon de la programaro uzita por krei la dosieron. Ekzemplo: 'Kwave v0.6.4-1'

source: Source
ar: المصدر
eo: Fonto

source: Identifies the name of the person or organization who supplied the original subject of the file. Example: 'Chaotic Sound Research'
ar: يحدد اسم الشخص أو المنظمة التي زودت بالموضوع الأصلي للملف. مثال: 'أبحاث الصوت الفوضوي'
eo: Identigas la nomon de la persono aŭ organizo kiu provizis la originan temon de la dosiero. Ekzemplo: 'Kaosa Sonesplorado'

source: Source form
ar: شكل المصدر
eo: Fonta formo

source: Identifies the original form of the material that was digitized. Examples: 'Record/Vinyl/90RPM', 'Audio DAT', 'tape/CrO2/60min'
ar: يحدد الشكل الأصلي للمادة المرقومة. أمثلة: 'تسجيل/فينيل/90 دورة في الدقيقة'، 'Audio DAT'، 'شريط/CrO2/60 دقيقة'
eo: Identigas la originalan formon de la materialo kiu estis ciferecigita. Ekzemploj: 'Rekordo/Vinyl/90RPM', 'Audio DAT', 'tape/CrO2/60min'

source: Subject
ar: الموضوع
eo: Subjekto

source: Describes the subject of the file. Example: 'Bird voices at early morning'
ar: يصف موضوع الملف. مثال: 'Bird voices at early morning'
eo: Priskribas la temon de la dosiero. Ekzemplo: 'Birdaj voĉoj frumatene'

source: Technician
ar: التقني
eo: Teknikisto

source: Identifies the technician who digitized the subject file. Example: 'Torvalds, Linus'
ar: يحدد الفني الذي رقمن ملف الموضوع. مثال: 'أبو سارة الغزاوي'
eo: Identigas la teknikiston kiu ciferecigis la teman dosieron. Ekzemplo: 'Torvalds, Linus'

source: Track
ar: المسار
eo: Trako

source: Track of the CD if the source was a CDROM.
ar: مسار القرص المضغوط إذا كان المصدر قرصًا مضغوطًا.
eo: Trako de la KD se la fonto estis KDROM.

source: Tracks
ar: المسارات
eo: Trakoj

source: Number of tracks of the CD if the source was a CDROM.
ar: عدد مسارات القرص المضغوط إذا كان المصدر قرصًا مضغوطًا.
eo: Nombro de trakoj de la KD se la fonto estis KDROM.

source: Channels
ar: القنوات
eo: Kanaloj

source: Specifies the number of channels of the signal.
ar: يحدد عدد قنوات الإشارة.
eo: Specifas la nombron da kanaloj de la signalo.

source: Base Quality
ar: الجودة الأساسية
eo: Baza Kvalito

source: Base quality of the compression in VBR mode
ar: الجودة الأساسية للضغط في وضع VBR
eo: Baza kvalito de la kunpremo en VBR-reĝimo

source: May be used to differentiate multiple versions of the same track title in a single collection. (e.g. remix info)
ar: يمكن استخدامه للتمييز بين إصدارات متعددة لنفس عنوان المقطوعة في مجموعة واحدة. (مثل معلومات remix)
eo: Povas esti uzata por diferencigi plurajn versiojn de la sama trakotitolo en ununura kolekto. (ekz. remiksaĵinformoj)

# file progress dialog
source: File:
ar: ملف:
eo: Dosiero:

# file progress dialog
source: Length:
ar: الطول:
eo: Longo:

# file progress dialog
source: Sample Rate:
ar: معدّل الإعتيان:
eo: Ekzempla indico:

# file progress dialog, %1=number of samples per second
source: %1 Samples per second
ar: %1 عينة في الثانية
eo: %1 Specimenoj por sekundo

# file progress dialog
source: Resolution:
ar: الدقة:
eo: Distingivo:

# file progress dialog, %1=number of bits per sample (8, 16, 24...)
source: %1 Bits per sample
ar: %1 بت في العينة
eo: %1 Bitoj per specimeno

# file progress dialog
source: Tracks:
ar: المقطوعات:
eo: Trakoj:

# number of tracks
source: 1 (mono)
ar: 1 (أحادي)

# number of tracks
source: 2 (stereo)
ar: 2 (مجسمي)

# number of tracks
source: 4 (quadro)
ar: 4 (رباعي)
eo: 4 (kvadro)

source: Do you really want to abort the operation?
ar: أتريد حقًا إلغاء العملية؟
eo: Ĉu vi vere volas ĉesigi la operacion?

# file progress dialog, %1=transfer rate, %2=remaining duration
source: %1 kB/s (%2 remaining)
ar: %1 كيلوبايت/ثانية (%2 متبقي)
eo: %1 kB/s (%2 ceteraj)

source: %1 MB of %2 MB done
ar: %1 م.بايت من %2 م.بايت تمّت
eo: %1 MB de %2 MB farita

# file progress dialog, %1=a number of samples
source: %1 samples
ar: %1 عينات
eo: %1 specimenoj

source: Sinus
ar: جيب
eo: Sinuso

source: Rectangular
ar: مستطيل
eo: Rektangula

source: Sawtooth
ar: أسنان المنشار
eo: Segildento

source: Inverse Sawtooth
ar: منشار عكسي
eo: Inversa Segildento

source: Triangular
ar: مثلث
eo: Triangula

source: Square Sinus
ar: جيب تربيعي
eo: Kvadrata Sinuso

source: Cubic Sinus
ar: جيب تكعيبي
eo: Kuba Sinuso

source: Blues
ar: درجات الأزرق
eo: Bluso

source: Classic Rock
ar: روك كلاسيكي
eo: Klasika Roko

source: Country
ar: بلدي
eo: Lando

source: Dance
ar: رقص
eo: Danco

source: Disco
ar: موسيقى الديسكو
eo: Diskoteko

source: Funk
ar: فانك
eo: Funko

source: Grunge
ar: غرنج

source: Hip-Hop
ar: هيب هوب
eo: Hiphopo

source: Jazz
ar: جاز
eo: Ĵazo

source: Metal
ar: ميتال
eo: Metalo

source: New Age
ar: العصر الجديد
eo: Nova Epoko

source: Oldies
ar: الأغاني القديمة
eo: Maljunuloj

source: Other
ar: أخرى
eo: Alia

source: Pop
ar: بوب
eo: Popo

source: Rhythm and Blues
ar: ريذم أند بلوز
eo: Ritmo kaj Bluso

source: Rap
ar: راب
eo: Repo

source: Reggae
ar: ريغي
eo: Regeo

source: Rock
ar: روك
eo: Roko

source: Techno
ar: تكنو
eo: Tekno

source: Industrial
ar: صناعي
eo: Industria

source: Alternative
ar: بديل
eo: Alternativo

source: Ska
ar: سكا

source: Death Metal
ar: ديث ميتال
eo: Mortmetalo

source: Pranks
ar: برانكس
eo: ŝercoj

source: Soundtrack
ar: موسيقى تصويرية
eo: Sontrako

source: Euro-Techno
ar: تيكنو-اوروبي

source: Ambient
ar: امبيانت

source: Trip-Hop
ar: تريب-هوب

source: Vocal
ar: فوكال
eo: Vokalo

source: Jazz & Funk
ar: جاز وفانك
eo: Ĵazo & Funko

source: Fusion
ar: فيوشن
eo: Fuzio

source: Trance
ar: غشية
eo: Tranco

source: Classical
ar: كلاسيكي
eo: Klasika

source: Instrumental
ar: انسترمنتل
eo: Instrumenta

source: Acid
ar: حمض
eo: Acido

source: House
ar: منزل
eo: Domo

source: Game
ar: لعبة
eo: Ludo

source: Sound Clip
ar: كليب غنائي
eo: Sonklipo

source: Gospel
ar: إنجيل
eo: Evangelio

source: Noise
ar: ضجيج
eo: Bruo

source: Alternative Rock
ar: روك بديل
eo: Alternativa Roko

source: Bass
ar: جهير
eo: Baso

source: Soul
ar: نفس
eo: Animo

source: Punk
ar: بانكد
eo: Punko

source: Space
ar: مسافة
eo: Spaco

source: Meditative
ar: تأملي
eo: Meditema

source: Instrumental Pop
ar: انسترومنتال بوب
eo: Instrumenta Popmuziko

source: Instrumental Rock
ar: انسترومنتال روك
eo: Instrumenta Roko

source: Ethnic
ar: عرقي
eo: Etna

source: Gothic
ar: القوطية
eo: gotika

source: Darkwave
ar: دارك وايف

source: Techno-Industrial
ar: تيكنو-اندستريال
eo: Tekno-Industria

source: Electronic
ar: إلكتروني
eo: Elektronika

source: Pop-Folk
ar: بوب ​​​​شعبي

source: Eurodance
ar: يورودانس
eo: Eŭrodanco

source: Dream
ar: حلم
eo: Sonĝo

source: Southern Rock
ar: روك جنوبي
eo: Suda Roko

source: Comedy
ar: كوميدي
eo: Komedio

source: Cult
ar: عبادة
eo: Kulto

source: Gangsta
ar: غانغستا

source: Top 40
ar: أعلى 40
eo: Supraj 40

source: Christian Rap
ar: راب مسيحي
eo: Kristana Repo

source: Pop/Funk
ar: بوب/فونك
eo: Popmuziko/Funko

source: Jungle
ar: أجمة
eo: Ĝangalo

source: Native American
ar: امريكي أصلي
eo: Indiĝeno

source: Cabaret
ar: كباريه
eo: Kabaredo

source: New Wave
ar: نيو ويف
eo: Nova Ondo

source: Psychedelic
ar: بسيكُدلِك
eo: Psikedela

source: Rave
ar: رايف

source: Showtunes
ar: شاوتونز

source: Trailer
ar: العرض الدعائي
eo: Antaŭfilmo

source: Lo-Fi
ar: لو-في

source: Tribal
ar: قبلي
eo: Triba

source: Acid Punk
ar: اسِد بانك
eo: Acida punko

source: Acid Jazz
ar: اسِد جاز
eo: Acida Ĵazo

source: Polka
ar: بولكا
eo: Polko

source: Retro
ar: عتيق

source: Musical
ar: موسيقي
eo: Muzika

source: Rock 'n' Roll
ar: روك آند رول
eo: Rokenrolo

source: Hard Rock
ar: هارد روك
eo: Malmola Roko

source: Folk
ar: شعبي

source: Folk-Rock
ar: فولك روك
eo: Folk-Rokenrolo

source: National Folk
ar: فولك محلي
eo: Nacia Folk

source: Swing
ar: أرجوحة
eo: Svingi

source: Fast Fusion
ar: فيوجن سريع
eo: Rapida Fuzio

source: Bebop
ar: بيبوب

source: Latin
ar: لاتيني
eo: latina

source: Revival
ar: ريفيفال
eo: Reviviĝo

source: Celtic
ar: سلتيك
eo: Kelta

source: Bluegrass
ar: بلوكراس
eo: Bluherbo

source: Avantgarde
ar: ريادي
eo: Avangardo

source: Gothic Rock
ar: غوثك روك
eo: Gotika Roko

source: Progressive Rock
ar: بروغريسيف روك
eo: Progresema Roko

source: Psychedelic Rock
ar: روك سايكدلي
eo: Psikedela Roko

source: Symphonic Rock
ar: روك سيمفوني
eo: Simfonia Roko

source: Slow Rock
ar: روك بطيء
eo: Malrapida Roko

source: Big Band
ar: بيغ باند
eo: Granda Bando

source: Chorus
ar: جوقة
eo: Ĥoro

source: Easy Listening
ar: إيزي ليسينينج
eo: Facila Aŭskultado

source: Acoustic
ar: سمعي
eo: Akustika

source: Humour
ar: فكاهة
eo: Humuro

source: Speech
ar: حديث
eo: Parolado

source: Chanson
ar: أغنية

source: Opera
ar: أوبرا
eo: Opero

source: Chamber Music
ar: موسيقى الحجرة
eo: Ĉambra Muziko

source: Sonata
ar: سوناتا
eo: Sonato

source: Symphony
ar: سيمفونية
eo: Simfonio

source: Booty Bass
ar: بوتي باس

source: Primus
ar: بريموس
eo: Primuso

source: Porn Groove
ar: بورن جروف
eo: Porno Groove

source: Satire
ar: هجاء
eo: Satiro

source: Slow Jam
ar: جام بطيء
eo: Malrapida Konfitaĵo

source: Club
ar: نادي
eo: Klubo

source: Tango
ar: تانجو

source: Samba
ar: سامبا
eo: sambo

source: Folklore
ar: فلكلور
eo: Folkloro

source: Ballad
ar: بالاد
eo: Balado

source: Power Ballad
ar: شعبية قوية
eo: Potenca Balado

source: Rhythmic Soul
ar: صول ايقاعي
eo: Ritma Animo

source: Freestyle
ar: أسلوب حر
eo: Liberstilo

source: Duet
ar: ثنائي
eo: Dueto

source: Punk Rock
ar: بانك روك
eo: Punk-Roko

source: Drum Solo
ar: سولو الطبل
eo: Tamburo Solo

source: A Cappella
ar: أكابيلا

source: Euro-House
ar: أوروبي-هاوس
eo: Eŭro-House

source: Dance Hall
ar: قاعة الرقص
eo: Dancejo

source: Goa
ar: غوا
eo: Goao

source: Drum & Bass
ar: طبل و جهير
eo: Tamburo & Baso

source: Club-House
ar: نادي-منزل
eo: Klub-House

source: Hardcore Techno
ar: تكنو هاردكور

source: Terror
ar: ترهيب
eo: Teruro

source: Indie
ar: مستقل

source: BritPop
ar: بريت بوب

source: Negerpunk
ar: بانك الغنج

source: Polsk Punk
ar: بانك بولوني

source: Beat
ar: نبضة

source: Christian Gangsta Rap
ar: راب غانجستا مسيحي
eo: Kristana Gangsta Repo

source: Heavy Metal
ar: هيفي ميتال
eo: Peza metalo

source: Black Metal
ar: بلاك ميتال
eo: Nigra Metalo

source: Crossover
ar: خط تحويل
eo: Interkruciĝo

source: Contemporary Christian
ar: مسيحي معاصر
eo: Nuntempa kristano

source: Christian Rock
ar: روك مسيحي
eo: Kristana Roko

source: Merengue
ar: ميرينجو

source: Salsa
ar: السالسا
eo: Salso

source: Thrash Metal
ar: ثراش ميتال
eo: Thrash Metalo

source: Anime
ar: أنمي
eo: Animeo

source: JPop
ar: جِبوب

source: SynthPop
ar: سينثبوب

source: Abstract
ar: تخيل
eo: Abstraktaĵo

source: Art Rock
ar: آرت روك
eo: Arta Roko

source: Baroque
ar: باروكية
eo: Baroko

source: Bhangra
ar: بانغرا

source: Big Beat
ar: إيقاع قوي

source: Breakbeat
ar: إيقاع كسر

source: Chillout
ar: استرخاء

source: Downtempo
ar: داونتمبو

source: Dub
ar: داب

source: Eclectic
ar: إيكليكتيك
eo: Eklektika

source: Electro
ar: إليكترو
eo: Elektro

source: Electroclash
ar: إلكتروكلاش
eo: Elektrokolizio

source: Emo
ar: إيمو

source: Experimental
ar: تجريبي
eo: Eksperimenta

source: Garage
ar: مرأب
eo: Garaĝo

source: Global
ar: عام
eo: Tutmonda

source: Illbient
ar: إيلبيانت

source: Industro-Goth
ar: صناعي-قوطي
eo: Industro-goto

source: Jam Band
ar: فرقة موسيقى الجام
