Repository: KDE/kwave
Catalog: po/*.po
Languages: fr

source: compression '%1' not supported, using '%2'
fr: La compression « %1 » n'est pas gérée. La compression « %2 » sera utilisée à la place.

source: continue after highest index
fr: continuer après l'index le plus élevé

source: copy the current selection to the clipboard
fr: copier la sélection courante et la placer dans le presse papier

source: create a new empty file
fr: créer un nouveau fichier vide

source: crop
fr: couper la sélection

source: cut
fr: couper

source: cut the current selection and move it to the clipboard
fr: couper la sélection courante et la déplacer dans le presse papier

source: cutoff frequency
fr: fréquence de coupure

source: decoder_mp3
fr: décodeur MP3

source: delete
fr: supprimer

source: delete label
fr: supprimer un label

source: delete the current selection
fr: supprime la sélection courante

source: delete track
fr: supprimer une piste

source: detecting endianness (standard search)...
fr: Détection de l'encodage des octets (recherche standard)...

source: detecting endianness (statistic search)...
fr: Détection de l'encodage des octets (recherche par statistique)...

source: directory for storing swap files
fr: Le dossier qui sera utilisé pour stocker les fichiers de la mémoire virtuelle

source: display
fr: Affichage

source: done
fr: terminé

source: drag and drop
fr: glisser - déposer

source: enable pre-recording
fr: activer le pré-enregistrement

source: error on loading plugin
fr: Erreur pendant le chargement du module externe

source: every 2nd Point
fr: Tous les 2 points

source: example:
fr: exemple :

source: file contains invalid data
fr: Le fichier contient des données non valables

source: file header is damaged
fr: L'en-tête du fichier est endommagée

source: fileinfo
fr: informations sur les fichiers audio

source: follow selection
fr: Suivre la sélection

source: format or function is not implemented
fr: Format ou fonction non implantée

source: greyscale
fr: Nuances de gris

source: highest
fr: Grand

source: i/o error, maybe the driver is not present in your kernel or it is not properly configured.
fr: Erreur d'entrée / sortie. Peut être que le driver n'est pas présent dans le noyaux du système ou qu'il n'est pas correctement configuré.

source: index of the label
fr: index du label

source: insert
fr: insérer

source: insert the content of clipboard
fr: insérer le contenu du presse papier

source: insert track
fr: insérer une piste

source: into 1st half
fr: dans le premier quart

source: into 2nd half
fr: dans le second quart

source: invalid codec type
fr: Type de codec non valable

source: invalid or unknown file type: '%1'
fr: Fichier non valable ou de type inconnu : « %1 »

source: invalid sample format
fr: Format d'échantillonnage non valable

source: last action
fr: dernière action

source: length:
fr: Durée :

source: linear
fr: linéaire

source: linear two's complement
fr: Linéaire avec complément à deux

source: low pass
fr: passe bas

source: lowest
fr: Petit

source: lowpass
fr: filtre passe bas

source: megabytes of physical memory
fr: La taille en méga-octets de la mémoire physique

source: megabytes of virtual memory
fr: La taille en méga-octets de la mémoire virtuelle

source: memory
fr: gestion de la mémoire

source: modify file info
fr: modifier les informations du fichier

source: modify file information
fr: modifier les informations du fichier

source: modify label
fr: modifier le label

source: modify samples
fr: modifier les échantillons

source: mute the current selection
fr: assourdir la sélection courante

source: n-polynom
fr: polynôme n

source: name
fr: nom

source: newsignal
fr: nouveau signal audio

source: no
fr: non

source: no compression
fr: aucune compression

source: noise
fr: générateur de bruit

source: notch_filter
fr: filtre réjecteur

source: null device
fr: périphérique inconnu

source: numbering:
fr: numérotation :

source: on modifications
fr: Dans les modifications

source: oops, plugin '%1' is unknown or invalid!
fr: Avertissement : le module externe « %1 » est inconnu ou non valable !

source: open an existing file
fr: ouvrir un fichier déjà existant

source: opening the FLAC bitstream failed.
fr: l'ouverture du flux FLAC a échoué

source: opening the file failed
fr: L'ouverture du fichier a échouée

source: out of memory
fr: Pas assez de mémoire

source: paste
fr: coller

source: pause playback
fr: met en pause la lecture

source: paused
fr: pause

source: pitch shift
fr: décalage fréquentiel

source: pitch_shift
fr: décalage fréquentiel

source: playback
fr: lecture

source: playback device
fr: périphérique de lecture :

source: playback rate %1 Hz is not supported
fr: la lecture à une fréquence de %1 Hz n'est pas disponible

source: polynom, 3rd degree
fr: polynôme de dégré 3

source: polynom, 5th degree
fr: polynôme de dégré 5

source: polynom, 7th degree
fr: polynôme de dégré 7

source: polynom, nth degree
fr: polynôme de dégré n

source: prerecording...
fr: pré-enregistrement...

source: read access failed
fr: Accès en lecture interdite

source: reading...
fr: lecture en cours...

source: recently selected Point
fr: Point récemment sélectionné

source: record
fr: enregistreur de sons

source: recording device
fr: périphérique d'enregistrement

source: recording...
fr: Enregistrement en cours...

source: resolution:
fr: Résolution :

source: sample and hold
fr: échantillonné et bloqué

source: sample format '%1' failed, using '%2'
fr: le format d'échantillonage «%1» a échoué. Le format «%2» sera utilisé à la place

source: sample format '%1' is not supported, using '%2'
fr: le format d'échantillonage «%1» n'est pas géré. Le format «%2» sera utilisé à la place.

source: sample rate:
fr: Fréquence d'échantillonnage :

source: samples
fr: échantillons

source: samples per second
fr: échantillons par seconde

source: save selection only
fr: enregister uniquement la sélection

source: save the current file
fr: enregistre le fichier courant

source: searching for missing chunk '%1'...
fr: Recherche pour le portion manquante « %1 »...

source: select by number of samples
fr: Sélectionner comme nombre d'échantillons

source: select by percentage of the signal's length
fr: Paramètre la taille du fichier sonore par le pourcentage de sa taille

source: select by time
fr: Sélectionner du temps

source: select range
fr: Sélectionner une plage d'échantillons

source: select this to enter the number of samples directly
fr: sélectionnez ici le nombre d'échantillons

source: select this to set the length of the file by time
fr: sélectionnez ici la durée de votre fichier sonore

source: select zoom factor
fr: sélectionner le facteur de zoom

source: selection
fr: Sélection

source: selection, left border
fr: sélection, bord gauche

source: selectrange
fr: sélection d'une plage d'échantillons

source: sets the file size by the percentage of the possible maximum
fr: paramètre la taille du fichier sonore par le pourcentage de sa taille maximale possible

source: sets the selection by the percentage of the whole signal
fr: Sélectionner par le pourcentage de la taille complète du signal

source: size of bitmap: %1x%2
fr: Taille du Bitmap : %1x%2

source: size of the playback buffer in bytes
fr: taille du tampon de lecture en octets

source: sonagram
fr: sonagramme

source: source:
fr: Fichier :

source: spline
fr: rainure

source: start playback
fr: Démarre la lecture

source: start playback and loop
fr: Démarre la lecture en boucle

source: start/stop pre-listening
fr: Arrêter / démarrer l'aperçu

source: stop playback or loop
fr: arrête la lecture

source: synchronization lost
fr: Perte de synchronisation

source: to &End
fr: A la &Fin

source: to &Maximum
fr: au &maximum

source: to &Start
fr: Au débu&t

source: to be done...
fr: terminés...

source: to next labels
fr: vers les labels suivants

source: to previous labels
fr: vers les labels précédents

source: tracks:
fr: pistes :

source: trigger level
fr: niveau du seuil

source: unable to load the file '%1' that contains the plugin '%2' !
fr: impossible de charger le fichier « %1 » qui contient le module externe « %2 » !

source: unable to open '%1'
fr: impossible d'ouvrir « %1 »

source: unable to open the recording device
fr: impossible d'ouvrir le périphérique d'enregistrement

source: unknown error 0x%X. damaged file?
fr: Erreur inconnue « 0x%X ». Le fichier est il endommagé ?

source: unsigned integer
fr: Entier non signé

source: unusable buffer size: %1
fr: Taille de mémoire tampon inutilisable : %1

source: update
fr: Mise à jour

source: use colors
fr: Utilisation des couleurs

source: use different colors for amplitude
fr: utilisation de différentes couleurs pour l'amplitude

source: use greyscale only for amplitude
fr: utilisation des nuances de gris pour l'amplitude

source: waiting for trigger...
fr: attente de « trigger »...

source: with &Clipboard
fr: avec le &presse-papiers

source: yes
fr: Oui

source: zero
fr: générateur de silence

source: zoom in
fr: Agrandir

source: zoom out
fr: rétrécir

source: zoom to all
fr: zoomer à l'ensemble de la piste

source: zoom to selection
fr: zoomer la sélection
