Repository: KDE/kwave
Catalog: po/*.po
Languages: fr

source: &Play
fr: &Jouer

source: (modified)
fr: (modifié)

source: MB
fr: Mo

source: for KDE
fr: pour KDE

source: %1 (%2 samples)
fr: %1 (%2 échantillons)

source: %1 Bytes
fr: %1 octets

source: %1 KB/s (%2 remain)
fr: %1 ko/s (%2 restant)

source: %1 MB (%2 byte)
fr: %1 Mo (%2 octets)

source: %1 MB of %2 MB done
fr: %1 Mo de %2 Mo réalisés

source: %1 bit
fr: %1 octets

source: %1 bits per sample
fr: %1 bits par échantillon

source: %1 bits per sample are not supported
fr: %1 bits par échantillon n'est pas supportée

source: %1 bits per sample failed, using %2 bits per sample
fr: La résolution de %1 bits par échantillon a échoué. La résolution de %2 bits par échantillon sera utilisée à la place.

source: %1 bits per sample is not supported, using %2 bits per sample
fr: La résolution de %1 bits par échantillon n'est pas gérée. La résolution de %2 bits par échantillon sera utilisée à la place.

source: %1 bytes
fr: %1 octets

source: %1 is not supported, using %2
fr: La compression « %1 » n'est pas gérée. La compression « %2 » sera utilisée à la place.

source: %1 kB (%2 byte)
fr: %1 Ko (%2 octets)

source: %1 samples
fr: %1 échantillons

source: %1 samples per second
fr: %1 échantillons par seconde

source: %1 tracks
fr: %1 pistes

source: %1Hz failed, using %2Hz
fr: La fréquence de %1Hz a échoué. La fréquence de %2 Hz sera utilisée à la place.

source: %1Hz is not supported, using %2Hz
fr: La fréquence de %1 Hz n'est pas gérée. La fréquence de %2 Hz sera utilisée à la place.

source: &About Kwave
fr: &A propos de Kwave

source: &Add
fr: &Ajouter

source: &Additive Synthesis
fr: Synthèse &additionnelle

source: &All
fr: &Tous

source: &Amplify
fr: &Amplification

source: &As...
fr: &Sous...

source: &Average spectrum
fr: Spectre des &moyennes

source: &Band Pass
fr: Filtre passe &bande

source: &Begin
fr: Dé&but

source: &Blocks...
fr: &Blocs...

source: &Calculate
fr: &Calculer

source: &Center Signal
fr: Signal &Centré

source: &Change rate
fr: &Changer la période

source: &Choose type
fr: &Choisir le type

source: &Clipboard
fr: &Presse papier

source: &Continue
fr: &Continuer

source: &Convert
fr: &Convertir

source: &Convert label distance to pitch
fr: &Convertir la distance entre deux labels en un décalage fréquentiel

source: &Create
fr: &Créer

source: &Crop
fr: &Couper la sélection

source: &Distort
fr: &Distortion

source: &Enable usage of virtual memory
fr: Activ&er l'usage de la mémoire virtuelle

source: &End
fr: &Fin

source: &Enter Command
fr: &Entrer une commande

source: &Envelope
fr: &Enveloppe

source: &Expand to labels
fr: &Élargir par rapport aux labels

source: &Export to Bitmap ...
fr: &Exporter vers un fichier bitmap...

source: &Factor
fr: Coe&fficient

source: &Filter
fr: &Filtre

source: &Flip Phase
fr: &Mouvement de Phase

source: &Flush
fr: &Vider

source: &Free
fr: &Libre

source: &Frequencies
fr: &Fréquences

source: &Generate
fr: &Générer

source: &Insert labels...
fr: &Insertion de labels...

source: &Invert Selection
fr: &Inversion de la sélection

source: &Limit to
fr: &Limitée à

source: &Listen
fr: Écou&ter

source: &Load labels...
fr: Chargement des &Labels...

source: &Logarithmic
fr: &Logarithmique

source: &Loop
fr: Bouc&le

source: &Low pass
fr: Fi&ltre passe-bas

source: &Memory
fr: &Gestion de la mémoire

source: &Mix
fr: &Mixer

source: &Mix & Paste
fr: &Mixer & Coller

source: &Moving Average
fr: Déplacer la &moyenne

source: &New
fr: &Nouveau...

source: &New...
fr: &Nouveau...

source: &Next
fr: Page &suivante

source: &Next Page
fr: Page &suivante

source: &No, store uncompressed
fr: &Non, ne pas compresser

source: &Noise
fr: &Bruit

source: &Notch Filter
fr: &Filtre réjecteur

source: &Nothing
fr: &Aucun

source: &Percent
fr: &Pourcentage

source: &Percentage
fr: &Pourcentage

source: &Periodic Silence
fr: Silence &périodique

source: &Physical Memory
fr: &Mémoire physique

source: &Pitch Shift
fr: Décalage fré&quentiel

source: &Play
fr: &Jouer

source: &Playback
fr: &Lecture

source: &Presets
fr: &Pré-réglages

source: &Previous Page
fr: Page &précédente

source: &Pulse Train
fr: Train d'im&pulsions

source: &Range
fr: &Plage d'échantillons

source: &Record
fr: En&registrer

source: &Repair
fr: &Réparation

source: &Resample
fr: &Re-échantillonner

source: &Reverse
fr: Inve&rser

source: &Samples
fr: Écha&ntillons

source: &Save...
fr: &Enregistrer...

source: &Search...
fr: &Sélection...

source: &Select all
fr: &Sélectionner tout

source: &Select...
fr: &Sélectionner...

source: &Selection
fr: &Sélection

source: &Selection...
fr: &Sélection...

source: &Set Rate
fr: &Paramétrer la période

source: &Sonagram
fr: &Sonagramme

source: &Start recording
fr: Démarrer l'enregi&strement

source: &Stop
fr: Arrê&ter

source: &Test...
fr: &Tester...

source: &Time
fr: &Temps

source: &Today
fr: Au&jourd'hui

source: &Track
fr: Pis&te

source: &Undo and Redo
fr: &Défaire et refaire

source: &Virtual Memory
fr: Mémoire &virtuelle

source: &Visible area
fr: Région &visible

source: &Yes, use G711
fr: &Oui, utiliser « G711 »

source: &to new Window
fr: &Dans une nouvelle fenêtre

source: ( resulting window size: %1 )
fr: ( taille de la fenêtre cible : %1 )

source: (Resulting file size: %1 MB)
fr: (Taille du fichier cible : %1 Mo)

source: (Stereo)
fr: (Stéréo)

source: (empty)
fr: (vide)

source: (file size)
fr: (taille du fichier)

source: (stereo)
fr: (stéréo)

source: (unknown)
fr: (inconnu)

source: 2 (stereo)
fr: 2 (stéréo)

source: 256 Bytes
fr: 256 octets

source: 3-polynom
fr: polynôme 3

source: 32-bit IEEE floating-point
fr: Nombre à virgule flottante sur 32 bits au format IEEE

source: 5-polynom
fr: polynôme 5

source: 64-bit IEEE double-precision floating-point
fr: Nombre à virgule flottante en double précision sur 64 bits au format IEEE

source: 7-polynom
fr: polynôme 7

source: <b>Auto-Generate Keywords</b><br> Create a list of keywords by going through all present file informations and merge them with the current list of keywords.
fr: <b>Génération automatique de mots clef</b><br> Créer une liste de mots clef en recherchant dans le fichier les informations déjà présentent et en fusionnant celles çi avec la liste courante de mots clef.

source: <b>Average Bitrate Mode</b><br> Bitrate is set to an average value, with optional upper and lower limit.
fr: <b>Mode de débit moyenné</b><br> Le débit est positionné à une valeur moyenne, avec une limite supérieure et inférieure en option.

source: <b>Bits per Sample:</b><p>Here you can select one of the bit resolutions your playback device supports. This is not necessarily the same resolution as in your audio file, Kwave dithers automatically from it's internal resolution (24 bit) to the setting you specify. Higher resolutions mean better audio quality.</p>
fr: <b>Octets par échantillon :<b><p>Vous pouvez choisir une des résolutions que votre périphérique de lecture accepte. Ce n'est pas obligatoirement la même que celle de votre fichier audio, Kwave adapte sa résolution interne (24 bits) au paramètre choisi. Plus la résolution est haute, plus la qualité est bonne.</p>

source: <b>Buffer Size:</b><p>Select a buffer size for the playback. You should set this numer as small as possible to reduce the playback latency. The latency is the delay between user interface actions like starting/stopping playback, update of the playback position and the real sound output. If you encounter dropouts you should increase this setting a bit.</p>
fr: <b>Taille du tampon :</b><p>Sélectionnez une taille de tampon pour la lecture. Vous devriez choisir une valeur la plus petite possible pour réduire la latence de lecture. La latence est le délai entre les actions utilisateur

source: <b>Compression</b><br>Here you can select one of the compression types if your audio hardware supports it.
fr: <b>Compression</b><br>Vous pouvez ici choisir un des types de compression si votre matériel le permet.

source: <b>Configure the usage of virtual memory (swap files).</b><br> If you enable the use of virtual memory, you can specify a directory where Kwave creates temporary files that it can use as an extension to the physical memory. This enables you to process files that are much larger than your physical memory. <br> Of course you can also set a limit for the total size of the page files.
fr: <b>Configure l'usage de la mémoire virtuelle (SWAP).</b><br> Si vous activez l'usage de la mémoire virtuelle, vous pouvez spécifier un dossier où Kwave créera des fichiers temporaires qui seront utilisés comme extension à la mémoire physique. Cela permettra de travailler sur des fichiers sonores dont la taille est supérieure à votre mémoire physique. <br> Bien sur vous pouvez aussi paramétrer une limite à la taille totale de votre mémoire virtuelle.

source: <b>Limit the usage of physical memory (RAM).</b><br> If you do not set a limit, the size of the physically installed memory in your computer will be determined and used as limit. You cannot set a limit higher than the totally installed amount of memory.
fr: <b>Limite l'usage de la mémoire physique (RAM).</b><br> Si vous ne fixer pas une limite, la taille de votre mémoire physique installée dans votre ordinateur sera utilisée comme valeur limite. Vous ne pouvez pas paramétrer une valeur limite supérieure à la taille de la mémoire installée dans votre ordinateur.

source: <b>Number of FFT points:</b><p></p>Try to choose numbers with small prime-factors,<br> if choosing big window sizes.<br> The computation will be much faster !
fr: <b>Nombre de points pour la FFT:</b><p></p>Essayez de choisir des nombres avec des petits facteurs de premier ordre.<br> Si vous choisissez une grande taille de fenêtre les calculs seront plus rapides !

source: <b>Number of Tracks</b><br>Select a number of tracks of the new signal. If you are not sure now, you can add or delete tracks later in the program.
fr: <b>Nombre de Pistes sonores</b><br>Paramètre le nombre de pistes sonores pour un nouveau fichier. Si vous n'êtes pas sur maintenant, vous pourrez ajouter ou supprimer une piste plus tard dans le programme.

source: <b>Number of Tracks</b><br>Select a number of tracks, e.g. for mono or stereo recording.
fr: <b>Nombre de pistes sonores</b><br>Paramètre le nombre de pistes sonores pour un nouveau fichier, tel que pour un enregistrement mono ou stéréo.

source: <b>Resolution</b><br>Select a resolution in bits in which the file will be recorded. Higher values give better quality but also more system load.
fr: <b>Résolution</b><br>Paramètre la résolution en bits pour laquelle le fichier sera enregistré. Les grandes valeurs donne une meilleure qualité mais nécessite plus de ressources processeur.

source: <b>Resolution</b><br>Select a resolution in bits in which the file will be saved. However, Kwave always uses 24 bits as it's own internal resolution to give the best results when processing the audio data.
fr: <b>Résolution</b><br>Paramètre la résolution en bits pour laquelle le fichier sera enregistré. Cependant, Kwave utilise toujours 24 bits comme résolution interne pour obtenir les meilleurs résultats quand il effectue des calculs sur des fichiers sonores.

source: <b>Sample Format</b><br>Here you can select one of the sample formats that your audio hardware supports. This normally has no big influence on the result, so you can just leave it as it is.
fr: <b>Format d'échantillonnage</b><br>Vous pouvez ici choisir un des types de for;at échantillonnage prédéfinie. Ce parametre n'a pas une grande influence sur le résultat audio.

source: <b>Sample Rate</b><br>Here you can select one of the predefined well-known sample rates or you can enter any sample rate on your own.
fr: <b>Période d'échantillonnage</b><br>Vous pouvez ici sélectionner une des périodes d'échantillonnage prédéfinie ou saisissez une période d'échantillonnage de votre choix.

source: <b>Sample Rate</b><br>Here you can select one of the predefined well-known sample rates that your sound card supports.
fr: <b>Période d'échantillonnage</b><br>Vous pouvez ici choisir une des périodes d'échantillonnage prédéfinie.

source: <b>Test...</b><p>Try to play a short sound using the current settings.</p><p><i>(sorry, not implemented yet!)</i></p>
fr: <b>Test...</b><p>Essayer de jouer une piste sonore de petite tailleen utilisant les paramètres courants.</p><p><i>(fonction non disponible pour le moment !)</i></p>

source: <b>Variable Bitrate Mode</b><br> The bitrate is selected by an average quality.
fr: <b>Mode de débit variable</b><br> Le débit est positionné pour une qualité moyenne.

source: <b>bandwidth</b> Determines the width of the frequency range that should be removed.
fr: <b>Largeur de bande</b> Détermine la largeur de la bande de fréquences qui doivent être supprimées.

source: <b>center frequency</b> Determines the center of the frequency range that should be removed.
fr: <b>fréquence centrale</b> Détermine la fréquence centrale de la plage de fréquences qui doivent être supprimées.

source: <b>chopper frequency</b><br>This setting determines how small the pieces of audio data are before they get processed by the pitch shift. If your audio data sounds interrupted, you might get better result with higher values.
fr: <b>fréquence de découpage</b><br>Cette option détermine comment les données audio de petite taille seront traitées par le décalage fréquentiel. Si vos données audio sont interrompues, vous pouvez obtenir un meilleur résultat avec des valeurs plus élevées.

source: <b>cutoff frequency</b> Determines the highest audible frequency, higher frequencies will be cut off.
fr: <b>fréquence de coupure</b> Détermine la fréquence audible la plus haute. Les fréquences qui sont au dessus seront coupées.

source: <h1>Kwave - a sound editor for KDE</h1>
fr: <h1>Kwave - Un éditeur de sons pour KDE</h1>

source: <h2>Kwave is a sound editor designed for the KDE-Desktop Environment. </h2><br> With Kwave you can edit many sorts of wav-files including multi-channel files. You are able to alter and play back each channel on its own.<br> Kwave also includes many plugins (some are still under development) to transform the wave-file in several ways and presents a graphical view with a complete zoom- and scroll capability.
fr: <h2>Kwave est un éditeur de pistes sonores pour l'environnement de bureau KDE.</h2><br> Avec Kwave vous pouvez éditer plusieurs types de fichiers sonores y compris les fichiers audio multicanaux. Vous pouvez aussi modifier et rejouer chaque piste de manière indépendante. <br> Kwave inclut aussi beaucoup de modules externes pour transformer les fichiers audio. Un grand nombre sont cependant en cours de développement. Kwave propose une interface graphique avec entre autre des fonctions de zoom et de défilement.

source: <nothing>
fr: <rien>

source: ALSA playback device (adsp*)
fr: Périphérique de lecture ALSA (adsp*)

source: ALSA record device (adsp*)
fr: Périphérique de lecture ALSA (adsp*)

source: ALSA recording device (adsp*)
fr: Périphérique de lecture ALSA (adsp*)

source: ASCII encoded audio
fr: Encodage audio ASCII

source: About &KDE
fr: A propos de &KDE

source: About Kwave
fr: A propos de Kwave

source: Acoustic
fr: Acoustique

source: All Files
fr: Tous les fichiers

source: All Supported Files
fr: Tous les fichiers supportés

source: Alternative
fr: Alternatif

source: Ambient
fr: Ambiance

source: Amplify Free
fr: Amplification libre

source: Amplify:
fr: Amplification :

source: An error occurred while opening the file: '%1'
fr: Une erreur est apparue lors de l'ouverture du fichier : « %1 »

source: An error occurred while saving the file!
fr: Une erreur est apparue lors de l'enregistrement du fichier !

source: Any device (*)
fr: Tous les périphériques (*)

source: Archival location
fr: Emplacement pour l'archivage

source: Audio Interchange Format
fr: Format audio Interchange

source: Audio emphasis mode
fr: Mode de mise en valeur de l'audio

source: Author
fr: Auteur

source: Author/Copyright
fr: Auteur et droits d'auteur

source: Authors
fr: Auteurs

source: Auto-Repair
fr: Réparation automatique

source: Average Bitrate Mode
fr: Mode de débit moyenné

source: Ballad
fr: Ballade

source: Band Pass
fr: Filtre passe bande

source: Base Quality
fr: Qualité de base

source: Base quality of the compression in VBR mode
fr: Compression de basse qualité avec le mode VBR

source: Berkeley,IRCAM,Carl Sound Format
fr: Berkeley, IRCAM, Format audio Carl

source: Bitrate
fr: Débit

source: Bits per Sample:
fr: %1 bits par échantillon :

source: Buffer Count:
fr: Mémoire tampon :

source: Buffer Size:
fr: Taille de la mémoire tampon :

source: Buffer overrun. Please increase the number and/or size of the record buffers.
fr: Un vidage de la mémoire tampon est apparu. Veuillez augmenter le nombre ou la taille de la mémoire tampon pour l'enregistrement.

source: Buffer:
fr: Mémoire tampon :

source: Celtic
fr: Celtique

source: Chamber Music
fr: Musique de chambre

source: Channels:
fr: Pistes :

source: Choose windowing function here.<br> If fourier transformation should stay reversible,<br> use the type "None".
fr: Choisissez ici une fonction de fenêtrage.<br> Si la transformation de Fourier doit rester réversible,<br> utilisez le type "Aucun"

source: Chorus
fr: Choeurs

source: Classic Rock
fr: Rock classique

source: Classical
fr: Classique

source: Clip&board
fr: Pres&se papier

source: Comedy
fr: Comedie

source: Comments
fr: Commentaires

source: Commisioned
fr: Commissionné par

source: Compressed Audio Interchange Format
fr: Format audio compressé Interchange

source: Contact information for the creators or distributors of the track. This could be a URL, an email address, the physical address of the producing label.
fr: Information pour contacter le créateur ou le distributeur du morceau. Cela peut être une URL, une adresse de courrier électronique, ou l'adresse postale du label de production.

source: Content
fr: Contenu

source: Copyright
fr: Droits d'auteur

source: Copyrighted
fr: Droits d'auteur

source: Corrupt or missing data in bitstream; continuing...
fr: Données corrompues ou manquante dans le flux de données...

source: Corrupt secondary header. Exiting.
fr: La seconde en-tête du fichier est corrompue. Fin du processus.

source: Create &type
fr: Créer un &type

source: Cu&t
fr: Co&uper

source: Cubic Sinus
fr: Sinusoïde au cube

source: Cult
fr: Culte

source: DMIX plugin
fr: Module externe DMIX

source: DSNOOP plugin
fr: Module externe DSNOOP

source: DVI Audio / IMA
fr: Audio DVI / IMA

source: De&lay
fr: Ret&ard

source: Describes the genre or style of the original work. Examples: 'classic', 'pop'
fr: Décrit le genre ou le style de musique. Exemple : « classique », « pop ».

source: Describes the original subject of the file, where it was first recorded. Example: 'orchester'
fr: Décrit le sujet d'origine du fichier, lorsqu'il a été pour la première fois enregistré. Exemple : « orchestre »

source: Describes the subject of the file. Example: 'Bird voices at early morning'
fr: Décrit le sujet du fichier. Exemple: « Chants des oiseaux le matin ».

source: Device
fr: Périphérique

source: Device:
fr: Périphérique :

source: Directory:
fr: Dossier :

source: Display
fr: Affichage

source: Do you really want to abort the current action?
fr: Voulez-vous réellement annuler l'operation en cours ?

source: Do you really want to abort the operation?
fr: Voulez-vous réellement annuler l'operation ?

source: Do you still want to continue?
fr: Voulez-vous réellement continuer ?

source: Do you want to continue and ignore all following errors?
fr: Voulez vous continuer et ignorer les prochaines erreurs ?

source: Drum Solo
fr: Batterie en solo

source: Duet
fr: Duo

source: E&xecute
fr: E&xécuter

source: Easy Listening
fr: Écoute facile

source: Electronic
fr: Electronique

source: Emphasis
fr: Mise en valeur

source: Encoding Mode:
fr: Mode d'encodage :

source: End of file before finding all Vorbis headers!
fr: La fin du fichier à été atteinte avant d'avoir pu trouver les en-têtes au format « Vorbis » !

source: Engineer
fr: Ingénieur

source: Error reading first page of Ogg bitstream data.
fr: Erreur de lecture de la première page de données du flux « Ogg ».

source: Error reading initial header packet.
fr: Erreur lors de la lecture du paquet correspondant à l'en-tête du fichier.

source: Ethnic
fr: Ethnique

source: F&x
fr: Effe&ts

source: FFT
fr: Transformée de Fourier rapide

source: FFT settings
fr: Paramétres de la transformée de Fourier rapide (FFT)

source: Fade &In
fr: Augmenter progress&ivement

source: Fade &Out
fr: Affaiblir pr&ogressivement

source: Fade In
fr: Augmenter progressivement

source: Fade Intro
fr: Augmenter progressivement

source: Fade Leadout
fr: Affaiblir progressivement

source: Fade Out
fr: Affaiblir progressivement

source: Fading
fr: Ajustement du volume

source: File &Properties...
fr: &Propriétés du fichier...

source: File Info
fr: Informations sur le fichier

source: File Size
fr: Taille du fichier

source: Filename
fr: Nom du fichier

source: Fit In
fr: Emboîter

source: Flip Horizontal
fr: Arrangement horizontal

source: Flip Vertical
fr: Arrangement vertical

source: Form1
fr: Nouveau fichier

source: Format used for storing the digitized audio samples. Example: '32-bit IEEE floating-point'
fr: Format utilisé pour stocker les échantillons audio numériques. Exemple : « Nombres à virgule flottante sur 32 bits au format IEEE ».

source: Freestyle
fr: Style libre

source: Frequency:
fr: Fréquence :

source: Frequency: ------ Hz
fr: Fréquence : ------ Hz

source: Frequency: 0 Hz
fr: Fréquence : 0 Hz

source: Game
fr: Jeu

source: Gothic
fr: Gothique

source: Gothic Rock
fr: Rock Gothique

source: Here you can select one of the predefined well-known sample rates or you can enter any sample rate on your own.
fr: Vous pouvez ici sélectionner une des périodes d'échantillonnage prédéfinie ou saisir une période d'échantillonnage de votre choix.

source: Hours
fr: Heures

source: Humour
fr: Humeur

source: ISRC number for the track; see the ISRC intro page for more information on ISRC numbers. http://www.ifpi.org/site-content/online/isrc_intro.html
fr: Numéro ISRC pour le morceau. Voir la page WEB concernant la numérotation ISRC pour plus d'informations. http://www.ifpi.org/site-content/online/isrc_intro.html

source: Identifies the name of the author of the original subject of the file. Example: 'van Beethoven, Ludwig'
fr: Identifie le nom de l'auteur du fichier original. Exemple : « Ludwig van Beethoven »

source: Identifies the name of the person or organization who supplied the original subject of the file. Example: 'Chaotic Sound Research'
fr: Identifie le nom de la personne ou de l'organisation qui a fourni le fichier. Exemple: « Chaotic Sound Research ».

source: Identifies the name of the software package used to create the file. Example: 'Kwave v0.6.4-1'
fr: Identifie le nom du logiciel qui a été utilisé pour créer le fichier. Exemple : « Kwave v0.6.4-1 ».

source: Identifies the original form of the material that was digitized. Examples: 'Record/Vinyl/90RPM', 'Audio DAT', 'tape/CrO2/60min'
fr: Identifie le type de materiel d'origine pour la numérisation. Exemples : « Enregistrement / Vinyle / 90t / min », « DAT », « Cassette / CrO2 / 60min »

source: Identifies the technican who digitized the subject file. Example: 'Torvalds, Linus'
fr: Identifie le technicien qui a numérisé le fichier. Exemple: « Linus Torvalds ».

source: If checked, the <b>record time</b> is limited and recording will automatically stop when the selected time is reached.
fr: Si cette option est activée; le <b>temps d'enregistrement</b> sera limité et l'enregistrement sera automatiquement arrêter quand la durée choisi sera dépassée.
