Repository: KDE/kwave
Catalog: po/*.po
Languages: fr

source: If the <b>record trigger</b> is enabled, recording will start as soon as the volume of the input signal goes over the selected level.
fr: Si l'option <b>Seuil d'enregistrement</b> est activée; l'enregistrement commencera quand le volume d'entrée dépassera le seuil choisi.

source: Increments or decrements the speed by a factor. For example: "x1", "x2", "/ 4"
fr: Augmente ou diminue le volume sonore à l'aide d'un coefficient. Par exemple : « x1 », « x2 », « x4 »

source: Increments or decrements the volume by a factor. For example: "x1", "x2", "/ 4"
fr: Augmente ou diminue le volume sonore à l'aide d'un coefficient. Par exemple : « x1 », « x2 », « x4 »

source: Increments or decrements the volume in logarithmic scale (decibel). For example: "+3 dB", "+ 6 dB", "-3 dB".
fr: Augmente ou diminue le volume sonore à l'aide d'une échelle logarithmique (décibel). Par exemple : « +3 dB », « +6 dB », « -3 dB ».

source: Indicates where the subject of the file is archived.
fr: Indique l'emplacement où le fichier sera archivé.

source: Indicates whether the file is an original or a copy
fr: Indique si le fichier est un original ou une copie

source: Indicates whether the file is protected by copyright or not.
fr: Indique si le fichier est protégé par des droits d'auteur ou non.

source: Indicates whether the subject is private
fr: Indique si le sujet est confidentiel

source: Industrial
fr: Industriel

source: Input does not appear to be an Ogg bitstream.
fr: Le fichier d'entrée ne semble pas être un flux de données au format « Ogg ».

source: Instrumental
fr: Instrumentale

source: Instrumental Pop
fr: Pop Instrumentale

source: Instrumental Rock
fr: Rock Instrumentale

source: Intensity Stereo
fr: Stéréo renforcé

source: Inverse Sawtooth
fr: dents de scie inversées

source: Keywords
fr: Mot-clefs :

source: Kwave auto repair
fr: Auto-réparation par Kwave

source: Kwave auto-repair
fr: Auto-réparation par Kwave

source: Label Properties...
fr: &Propriétés du fichier ...

source: Label by &Intensity
fr: Label par &Intensité

source: Label by &Period
fr: Label par &Période

source: Latin
fr: Latine

source: Layer
fr: Niveau

source: Layer I
fr: Niveau I

source: Layer II
fr: Niveau II

source: Layer III
fr: Niveau III

source: Length
fr: Taille

source: Length: %1
fr: Taille : %1

source: Level
fr: Niveau

source: Level Meter
fr: Niveau du volume sonore

source: Level:
fr: Niveau :

source: License
fr: Licence

source: License agreement
fr: Accord de licence

source: License information, eg, 'All Rights Reserved', 'Any Use Permitted', a URL to a license or the EFF Open Audio License ('distributed under the terms of the Open Audio License. see http://www.eff.org/IP/Open_licenses/eff_oal.html for details'), etc.
fr: Informations sur la licence, tel que « Tous droits réservés », « Toutes utilisations permises », une URL vers une licence ou la « licence EFF Open Audio » (voir l'adresse http://www.eff.org/IP/Open_licenses/eff_oal.html pour plus de détails).

source: Limit &to
fr: Limi&tée à

source: Limit the recording time
fr: Limiter le temps d'enregistrement

source: List of keywords.
fr: Liste de mots clef.

source: Lists the name of the person or organization that commissioned the subject of the file.
fr: Affiche le nom de la personne ou de l'organisation qui commissionne le fichier.

source: Loading plugins...
fr: Chargement des modules externes...

source: Low Pass
fr: Passe bas

source: Lower Bitrate
fr: Débit faible

source: MPEG Layer I
fr: MPEG niveau I

source: MPEG Layer II
fr: MPEG niveau II

source: MPEG Layer III
fr: MPEG niveau III

source: MPEG Layer, I, II or III
fr: MPEG niveau I, II ou III

source: MPEG Mode Extension (only if Joint Stereo)
fr: Mode étendu du format MPEG (seulement en stéréo)

source: MPEG Version 2.5 (unofficial)
fr: MPEG Version 2.5 (non officiel)

source: MPEG Version, 1, 2 or 2.5
fr: MPEG version, 1, 2 ou 2.5

source: MPEG audio
fr: Audio MPEG

source: MPEG layer1 audio
fr: Format audio MPEG niveau 1

source: MPEG layer2 audio
fr: Format audio MPEG niveau 2

source: MPEG layer3 audio
fr: Format audio MPEG niveau 3

source: MS Stereo
fr: Stéréo MS

source: May be used to differentiate multiple versions of the same track title in a single collection. (e.g. remix info)
fr: Ce champs peut être utilisé pour différentier des versions multiples d'un même morceau dans une liste. (tel que des informations sur un « remix »)

source: Medium
fr: Média d'origine

source: Memory Settings
fr: Paramétres pour la gestion de la mémoire

source: Milliseconds
fr: Millisecondes

source: Mime Type
fr: Type MIME

source: Mime type of the file format
fr: Le type MIME correspondant au format du fichier

source: Mode Extension
fr: Mode étendu

source: Musical
fr: Musique

source: Name
fr: Nom

source: Name of the album if the source is an album that consist of more medias.
fr: Nom de l'album si la source est est constitué de plusieurs médias.

source: Name of the opened file
fr: Nom du fichier ouvert

source: Name of the organization producing the track (i.e. the 'record label')
fr: Nom de l'organisation qui a produit le morceau (tel que le « label d'enregistrement »)

source: Native American
fr: Americaine native

source: NeXT,Sun Audio
fr: NeXT, format audio Sun

source: New &Window
fr: Nouvelle &fenêtre

source: New File
fr: Nouveau fichier

source: New Signal
fr: Nouveau signal audio

source: Noise
fr: Bruit

source: Nominal Bitrate
fr: Débit nominal

source: Nominal bitrate of the audio stream in bits per second
fr: Débit nominal du flux audio en bits par seconde

source: None
fr: Aucun

source: Notch Filter
fr: Filtre réjecteur

source: Number of FFT points:
fr: Nombre de points de la FFT :

source: Number of channels: mono, stereo...
fr: Nombre de pistes : mono, stéréo ...

source: Number of the CD, if the source is an album of more CDROMs
fr: Numéro du CD, si la source est un album de plusieurs CDROM

source: OSS playback device (dsp*)
fr: Périphérique de lecture OSS (dsp*)

source: OSS record device (dsp*)
fr: Périphérique de lecture OSS (dsp*)

source: OSS recording device (audio*)
fr: Périphérique d'enregistrement OSS (audio*)

source: OSS recording device (dsp*)
fr: Périphérique de lecture OSS (dsp*)

source: Ogg bitstream has zero-length.
fr: Le flux de données au format « Ogg » à une taille nulle.

source: Ogg, Vorbis audio
fr: Format audio Ogg / Vorbis

source: Oldies
fr: Ancienne morceau

source: One or more encoding parameters are not supported. Please change the settings and try again...
fr: Un ou plusieurs paramètres pour l'encodeur ne sont pas supportés. Veuillez modifier le paramétrage et réessayer...

source: Opening the device '%1' failed: %2
fr: L'ouverture du périphérique « %1 » à échoué : %2

source: Opens a dialog for selecting a date from the calendar.
fr: Ouvre une boîte de dialogue pour la sélection de la date à partir d'un calendrier.

source: Opera
fr: Opéra

source: Organization
fr: Organisation

source: Other
fr: Autre

source: Out of memory
fr: Pas assez de mémoire

source: Out of memory!
fr: Pas assez de mémoire!

source: Overview
fr: Aperçu

source: Pause/Continue
fr: Pause / Continuer

source: Performer
fr: Interprète

source: Periods...
fr: Périodes...

source: Pitch Shift
fr: Décalage fréquentiel

source: Playback
fr: Lecture

source: Playback Method:
fr: Méthode de lecture :

source: Playback Settings
fr: Options de lecture

source: Playback Test
fr: Test de lecture

source: Playback is currently running.Please stop playback first and then try again
fr: Une lecture est en cours. Réessayez après l'avoir arrêtée.

source: Playback resolution in bits per sample
fr: Résolution de lecture en bits par échantillon

source: Plugins info
fr: Modules externes

source: Porn Groove
fr: Groove pornographique

source: Power Ballad
fr: Ballade puissante

source: Pre-Record:
fr: Pré-enregistrement :

source: Presets
fr: Pré-réglages

source: Private
fr: Confidentiel

source: Product
fr: Sujet de production

source: Progressive Rock
fr: Rock progressif

source: Provides a list of keywords that refer to the file or subject of the file.
fr: Donne une liste de mot-clefs pour identifier le fichier ou le sujet du fichier.

source: Provides general comments about the file or the subject of the file. If the comment is several sentences long, end each sentence with a period. Do not include newline characters!
fr: Donne des commentaires d'ordre général sur le fichier ou sur le sujet du fichier. Si le commentaire est constitué de plusieurs phrases, séparés les par des point. N'utilisez pas de retour chariot !

source: Provides general comments about the file or the subject of the file. If the comment is several sentences long, end each sentence with a period. Do not include newline characters!
fr: Donne des commentaires d'ordre général sur le fichier ou sur le sujet du fichier. Si le commentaire est constitué de plusieurs phrases, séparés les par des points. N'utilisez pas de retour chariot !

source: Psychadelic
fr: Psychédélique

source: Psychedelic Rock
fr: Rock psychédélique

source: R&edo
fr: R&efaire

source: Re&quantize
fr: Re-&quantifier

source: Reading from the recording device failed, error number = %1 (%2)
fr: La lecture des données à partir du périphérique d'enregistrement à échoué. Le code erreur est %1 (%2)

source: Ready.
fr: Prêt.

source: Record
fr: Enregistrer

source: Record &Time:
fr: Durée de l'enregistrement :

source: Record Control
fr: Contrôle de l'enregistrement

source: Record Trigger:
fr: Seuil d'enregistrement :

source: Record!
fr: Enregistrer !

source: Recording
fr: Enregistrement en cours

source: Recording Method:
fr: Mode d'enregistrement :

source: Recording with %1 track(s) failed, using %2 track(s)
fr: L'enregistrement de la piste « %1 » a échoué. La piste « %2 » sera utilisée à la place

source: Records the copyright information for the file. If there are multiple copyrights, separate them by a semicolon followed by a space. Example: 'Copyright Linux community 2002'
fr: Enregistre les informations de droits d'auteur pour le fichier. S'il y a plusieurs droits d'auteur, séparés les par un point-virgule suivi d'un espace. Exemple : « Copyright Linux community 2002 »

source: Rectangular
fr: Rectangulaire

source: Resolution
fr: Résolution

source: Resolution:
fr: Résolution :

source: Retro
fr: Rétro

source: Revert
fr: Rétablir

source: Rhythmic Soul
fr: Soul rythmique

source: S&ave
fr: E&nregistrer...

source: S&top
fr: Arrê&ter

source: S&top recording
fr: Arrê&ter l'enregistrement

source: Sample Format
fr: Format d'échantillonnage

source: Sample Format:
fr: Format d'échantillonnage :

source: Sample Rate
fr: Période d'échantillonnage

source: Sample Rate:
fr: Période d'échantillonnage :

source: Samples
fr: Échantillons

source: Save Blocks
fr: Enregistrer les blocs

source: Save Preset
fr: Enregistrer les pré-réglages

source: Saving in this format will lose the following additional file attribute(s): %1 Do you still want to continue?
fr: L'enregistrement du fichier dans ce format fera perdre le(s) attribut(s) suivant(s): %1 Voulez vous continuer ?

source: Sawtooth
fr: dents de scie

source: Scroll &left
fr: Déplacer à &gauche

source: Scroll &right
fr: Déplacer à &droite

source: Seconds
fr: Secondes

source: Selec&t...
fr: Sélec&tionner...

source: Select Date
fr: Sélectionner la date

source: Select Playback Device
fr: Sélectionnez le périphérique de lecture

source: Select Range...
fr: Sélectionner une plage d'échantillons...

source: Select Record Device
fr: Sélectionnez le périphérique d'enregistrement

source: Select a date from the calendar.
fr: Permet de sélectionner une date dans le calendrier.

source: Select a resolution in bits in which the file will be saved.
fr: Sélectionner une résolution en bits pour chaque fichier qui sera enregistré.

source: Selected
fr: Sélectionné

source: Set FFT/time resolution parameters
fr: Paramètres de la résolution de la FFT / temps

source: Set the date to today.
fr: Mettre à la date d'aujourd'hui.

source: Sets a mode for compressing the audio data to reduce disk space.
fr: Paramètre un mode de compression pour les données audio pour réduire l'espace utilisé sur le disque.

source: Sets the speed to a relative percentage of the original speed. For example: "50 %", "75%" or "125%"
fr: Paramètre le volume sonore à un pourcentage qui est relatif au niveau sonore d'origine. Par exemple : « 50 % », « 75 % », ou « 125 % »

source: Sets the volume to a relative percentage of the original level. For example: "50 %", "75%" or "125%"
fr: Paramètre le volume sonore à un pourcentage qui est relatif au niveau sonore d'origine. Par exemple : « 50 % », « 75 % », ou « 125 % »

source: Shows the length of the file in samples and if possible as time.
fr: Affiche la taille du fichier en nombre d'échantillons et si possible la durée.

source: Shows the name of the engineer who worked on the file. If there are multiple engineers, separate the names by a semicolon and a blank.
fr: Affiche le nom de l'ingénieur qui a travaillé sur le fichier. S'il y a plusieurs ingénieurs, séparés les noms par un point virgule et un espace.

source: Shows the number of tracks of the signal. You can add or delete tracks via the Edit menu.
fr: Affiche le nombre de pistes sonores du morceau. Vous pouvez ajouter ou supprimer une piste via le menu « Édition ».

source: Signal is empty, nothing to save !
fr: Le signal est vide, il n'y a rien à enregistrer !

source: Sinus
fr: Sinusoïde

source: Size of the file in bytes
fr: Taille du fichier en octets

source: Slow Jam
fr: Jam lent

source: Slow Rock
fr: Rock lent

source: Software
fr: Logiciel

source: Sonagram of
fr: Sonagramme de

source: Sonata
fr: Sonate

source: Sorry, the currently selected compression type can not be used for saving. Do you want to use G711 ULAW compression instead?
fr: Désolé, le type de compression sélectionné ne peut être utilisé pour enregistrer le fichier. Voulez vous utiliser le type de compression « G711 ULAW » à la place ?

source: Sorry, the file type is not supported!
fr: Désolé, le type de fichier n'est pas géré !

source: Sound Clip
fr: Effet sonore

source: Soundtrack
fr: Musique de film

source: Source form
fr: Type de source

source: Spe&ctrum
fr: Spe&ctre

source: Specifies the date the subject of the file was created. Example: '2001-12-24'
fr: Spécifie la date de création du fichier. Exemple : « 24-12-2001 ».

source: Specifies the lower limit in a VBR bitstream.
fr: Spécifie la limite basse d'un flux VBR.

source: Specifies the name or the title the file was originally intended for. Example: 'Linux audio collection'
fr: Spécifie le nom ou le titre du fichier prévu à l'origine. Exemple : « Collection audio sous Linux »

source: Specifies the upper limit in a VBR bitstream.
fr: Spécifie la limite haute d'un flux VBR.

source: Speech
fr: Discourt

source: Speed
fr: Vitesse

source: Speed:
fr: Vitesse :

source: Square Sinus
fr: Sinusoïde au carré

source: Start or stop the pre-listening of the current settings. If pre-listening is enabled, you will nearly immediately hear any change in the selected parameters.
fr: Démarre ou arrête la lecture de l'aperçu sonore avec les paramètres courants. Si l'option pour l'aperçu sonore est activée, vous pouvez immédiatement écouter les changements réalisés dans les paramètres.

source: Stereo
fr: Stéréo

source: Stop Recording
fr: Arrêter l'enregistrement

source: Stores the title of the subject of the file. Example: 'Symphony No.6, Op.68 "Pastoral"'
fr: Affiche le titre du fichier. Exemple : « Symphony No.6, Op.68 Pastoral ».

source: Subject
fr: Sujet

source: Symphonic Rock
fr: Rock symphonique

source: Symphony
fr: Symphonie

source: Technican
fr: Technicien

source: Techno-Industrial
fr: Techno-Industriel

source: Thanks To
fr: Remerciements à

source: The WAV file seems to be damaged: some chunks are duplicate or missing! Kwave will only use the first ones and ignores the rest. This might lead to a loss of data. If If you want to get your file repaired completely, please write an e-mail to the Kwave mailing list and we will help you...
fr: Le fichier « WAV » doit être endommagé : quelques portions du fichier sont en double ou sont manquantes ! Kwave utilisera les premières portions du fichier qui sont valables et ignorera les autres. Cela peut vous faire perdre des données. Si vous voulez réparer complètement votre fichier endommagé, envoyé un courrier électronique à la liste de diffusion de Kwave. Nous essayerons de vous aider...

source: The artist(s) who performed the work. In classical music this would be the conductor, orchestra, soloists. In an audio book it would be the actor who did the reading.
fr: L'artiste(s) qui a réalisé le travail. Pour de la musique classique, cela peut être le chef d'orchestre, l'orchestre en lui-même, ou bien un musicien en solo. Pour les livres audio, cela peut être l'acteur qui fait la lecture.

source: The current compression type is not supported!
fr: Désolé, le type de fichier n'est pas géré !

source: The current sample format is not supported!
fr: Désolé, le format courant pour les échantillons n'est pas géré !

source: The device '%1' cannot be opened in the correct mode.
fr: Impossible d'ouvrir le périphérique « %1 » correctement.

source: The device '%1' seems to be occupied by another application. Please try again later.
fr: Le périphérique %1 est utilisé par une autre application. Veuillez réessayer.

source: The device is busy. Maybe an other application is currently using it. Please try again later. (Hint: you might find out the name and process id of the program by calling: "fuser -v %1" on the command line.)
fr: Le périphérique est occupé. Peut être qu'une autre application l'utilise actuellement. Vous devriez essayer ultérieurement. (suggestion : vous pouvez trouver le numéro d'identification du processus du programme correspondant en saisisant la ligne de commande « fuser -v %1 » sur une ligne de commande du système).

source: The file '%1' already exists. Do you really want to overwrite it?
fr: Le fichier « %1 » existe déjà. Voulez-vous réellement l'écraser ?

source: The file contains an invalid channel mode 0x%1 Assuming Mono...
fr: Le fichier contient un canal non valable dans le mode 0x%1 Le flux de données sera traité en mono...

source: The file has an invalid checksum. Do you still want to continue?
fr: Le fichier a une somme de contrôle non valable. Voulez-vous vraiment continuer ?

source: The file has been structurally damaged or is no .wav file. Should Kwave try to repair it?
fr: Le fichier a une structure qui est endommagée ou n'est pas un fichier « .WAV ». Voulez vous que Kwave essaye de le réparer ?

source: The file has been truncated and might be corrupted!
fr: Le fichier a été écrasé et peut être corrompu !

source: The list ob labels / markers.
fr: Liste des labels / markers.

source: The opened file is no .WAV file or damaged: There is not enough valid sound data. It makes no sense to continue now...
fr: Le fichier n'est pas un fichier « .WAV » ou est endommagé : Il n'y a pas assez de données sonores valables. Il est impossible de continuer...

source: The opened file is no MPEG file or is damaged. No header information has been found...
fr: Le fichier ouvert n'est pas un fichier MPEG ou il est endommagé. Aucune en-tête d'information n'a été trouvé...

source: The recording device seems to be busy!
fr: Le périphérique d'enregistrement est occupé !

source: This Ogg bitstream does not contain Vorbis audio data.
fr: Ce flux « Ogg » ne contient pas de données au format « Vorbis ».

source: This file has been modified. Do you want to save it?
fr: Ce fichier a été modifié. Voulez-vous l'enregistrer ?

source: This would overwrite the following file(s): %1Do you really want to continue?
fr: Le(s) fichier(s) suivant(s) sera(ont) écrasé(s) : Voulez vous continuer ?

source: Time
fr: Temps

source: Time: %1
fr: Temps : %1

source: Time: ------ ms
fr: Temps : ------ ms

source: Time: 0 ms
fr: Temps : 0 ms

source: Track
fr: Piste

source: Track of the CD if the source was a CDROM.
fr: Piste du CD si la source est un CDROM.

source: Tracks
fr: Pistes

source: Tracks:
fr: Pistes :

source: Transform
fr: Transformer

source: Tri&m
fr: &Arranger

source: Triangular
fr: Triangulaire

source: U&ndo
fr: An&nuler

source: Unable to open the FLAC encoder!
fr: Impossible d'ouvrir l'encodeur FLAC.

source: Unable to open the file for saving!
fr: Impossible d'ouvrir le fichier pour l'enregistrer !

source: Unknown
fr: Inconnu

source: Upper Bitrate
fr: Débit important

source: Variable Bitrate Mode
fr: Mode de débit variable

source: Visualization
fr: Visualisation

source: Window Function:
fr: Fonction de la fenêtre:

source: You have changed the sample rate. Do you want to convert the whole file to the new sample rate or do you only want to set the rate information in order to repair a damaged file? Note: changing only the sample rate can cause "mickey mouse" effects!
fr: Vous avez changé la période d'échantillonnage. Voulez vous convertir le fichier dans son intégralité avec cette nouvelle période d'échantillonnage ou voulez vous seulement paramétrer les informations concernant cette période à cette valeur pour pouvoir réparer un fichier endommagé ? Nota : changer uniquement les informations concernant la période d'échantillonnage peut provoquer des dysfonctionnements pendant la lecture du flux audio.

source: You have not selected any bitrate for the encoding. Do you want to continue and encode with %1 kBit/s or cancel and choose a different bitrate?
fr: Vous n'avez pas choisi un débit pour l'encodage. Voulez vous continuer et encoder avec un débit de %1 ko/s ou annuler l'opération pour en choisir un vous même ?

source: Zero
fr: Zéro

source: Zoom &In
fr: Agrand&ir

source: Zoom &Out
fr: &Rétrécir

source: Zoom to &Selection
fr: Zoomer sur la &sélection

source: about
fr: à propos de

source: add label
fr: Ajouter un label

source: amplify free
fr: amplification libre

source: amplifyfree
fr: amplification libre

source: append track
fr: ajouter une piste

source: applying '%1' ...
fr: Traitement de « %1 » en cours...

source: authors
fr: auteurs

source: auto-generate keywords
fr: Génération automatique de mots clef

source: automatically update the sonagram <br>if the signal data has changed
fr: met à jour automatiquement le sonogramme<br>si le la piste sonore à été modifiée.

source: automatically update the sonagram if the selection<br>has been enlarged, reduced or moved
fr: met à jour automatiquement le sonogramme si la sélection<br>a été élargie, réduite, ou déplacée.

source: band_pass
fr: filtre passe bande

source: bands 0 to 31
fr: bandes de 0 à 31

source: bands 12 to 31
fr: bandes de 12 à 31

source: bands 16 to 31
fr: bandes de 16 à 31

source: bands 8 to 31
fr: bandes de 8 à 31

source: bandwidth
fr: Largeur de bande

source: bit
fr: bits

source: browse for a directory to hold page files
fr: Permet de choisir un dossier qui sera utilisé pour stocker les fichiers de la mémoire virtuelle

source: buffering...
fr: Mise en mémoire tampon...

source: by Factor
fr: Par coefficient multiplicateur

source: by Percentage
fr: En pourcentage

source: center frequency
fr: fréquence centrale

source: change speed by a factor
fr: Change la vitesse suivant un coefficient

source: change speed by percentage
fr: Change la vitesse par pourcentages

source: change volume by factor
fr: change le volume suivant un facteur

source: change volume by percentage
fr: change le volume suivant un poucentage

source: change volume in dB
fr: change le volume en décibels

source: checksum error
fr: Erreur de somme de contrôle

source: chopper frequency
fr: fréquence de découpage

source: codec_wav
fr: codec WAVE

source: compression %1 failed, using %2.
fr: Le format de compression « %1 » a échoué. Le format « %2 » sera utilisé à la place.
